jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h

/**********************************************************************************************************************
 * Copyright (c) Prophesee S.A.                                                                                       *
 *                                                                                                                    *
 * Licensed under the Apache License, Version 2.0 (the "License");                                                    *
 * you may not use this file except in compliance with the License.                                                   *
 * You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0                                 *
 * Unless required by applicable law or agreed to in writing, software distributed under the License is distributed   *
 * on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.                      *
 * See the License for the specific language governing permissions and limitations under the License.                 *
 **********************************************************************************************************************/
#ifndef __GENX320_ALL_PUB_REGISTERS_H
#define __GENX320_ALL_PUB_REGISTERS_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

/* ------------------------------------------------------")
 * : 
 * ------------------------------------------------------ */

#define ROI_CTRL 	(0x00000000UL) 	/*<! ROI control Register */
#define 	ROI_CTRL_TD_EN_Pos 	(0x1U)
#define 	ROI_CTRL_TD_EN_Msk 	(0x1UL << ROI_CTRL_TD_EN_Pos) 	/*!< 0x00000002 */
#define 	ROI_CTRL_TD_EN 	ROI_CTRL_TD_EN_Msk
#define 	ROI_CTRL_TD_SHADOW_TRIGGER_Pos 	(0x5U)
#define 	ROI_CTRL_TD_SHADOW_TRIGGER_Msk 	(0x1UL << ROI_CTRL_TD_SHADOW_TRIGGER_Pos) 	/*!< 0x00000020 */
#define 	ROI_CTRL_TD_SHADOW_TRIGGER 	ROI_CTRL_TD_SHADOW_TRIGGER_Msk
#define 	ROI_CTRL_PX_IPHOTO_EN_Pos 	(0x6U)
#define 	ROI_CTRL_PX_IPHOTO_EN_Msk 	(0x1UL << ROI_CTRL_PX_IPHOTO_EN_Pos) 	/*!< 0x00000040 */
#define 	ROI_CTRL_PX_IPHOTO_EN 	ROI_CTRL_PX_IPHOTO_EN_Msk
#define 	ROI_CTRL_PX_ROW_MON_RSTN_Pos 	(0x7U)
#define 	ROI_CTRL_PX_ROW_MON_RSTN_Msk 	(0x1UL << ROI_CTRL_PX_ROW_MON_RSTN_Pos) 	/*!< 0x00000080 */
#define 	ROI_CTRL_PX_ROW_MON_RSTN 	ROI_CTRL_PX_ROW_MON_RSTN_Msk
#define 	ROI_CTRL_PX_SW_RSTN_Pos 	(0xAU)
#define 	ROI_CTRL_PX_SW_RSTN_Msk 	(0x1UL << ROI_CTRL_PX_SW_RSTN_Pos) 	/*!< 0x00000400 */
#define 	ROI_CTRL_PX_SW_RSTN 	ROI_CTRL_PX_SW_RSTN_Msk
#define 	ROI_CTRL_PX_HALT_PROGRAMMING_Pos 	(0xBU)
#define 	ROI_CTRL_PX_HALT_PROGRAMMING_Msk 	(0x1UL << ROI_CTRL_PX_HALT_PROGRAMMING_Pos) 	/*!< 0x00000800 */
#define 	ROI_CTRL_PX_HALT_PROGRAMMING 	ROI_CTRL_PX_HALT_PROGRAMMING_Msk
#define TEST_BUS_CTRL 	(0x00000004UL) 	/*<! Controls the tbus input selection and amplifier use as well as the agpio input selection */
#define 	TEST_BUS_CTRL_RO_DFT_BUF_EN_Pos 	(0x2U)
#define 	TEST_BUS_CTRL_RO_DFT_BUF_EN_Msk 	(0x1UL << TEST_BUS_CTRL_RO_DFT_BUF_EN_Pos) 	/*!< 0x00000004 */
#define 	TEST_BUS_CTRL_RO_DFT_BUF_EN 	TEST_BUS_CTRL_RO_DFT_BUF_EN_Msk
#define 	TEST_BUS_CTRL_TBUS_TPA1_CTL_Pos 	(0x4U)
#define 	TEST_BUS_CTRL_TBUS_TPA1_CTL_Msk 	(0x1FUL << TEST_BUS_CTRL_TBUS_TPA1_CTL_Pos) 	/*!< 0x000001F0 */
#define 	TEST_BUS_CTRL_TBUS_TPA1_CTL 	TEST_BUS_CTRL_TBUS_TPA1_CTL_Msk
#define 	TEST_BUS_CTRL_TBUS_TPA2_CTL_Pos 	(0x9U)
#define 	TEST_BUS_CTRL_TBUS_TPA2_CTL_Msk 	(0x1FUL << TEST_BUS_CTRL_TBUS_TPA2_CTL_Pos) 	/*!< 0x00003E00 */
#define 	TEST_BUS_CTRL_TBUS_TPA2_CTL 	TEST_BUS_CTRL_TBUS_TPA2_CTL_Msk
#define 	TEST_BUS_CTRL_TBUS_R2R_TPA1_EN_Pos 	(0xEU)
#define 	TEST_BUS_CTRL_TBUS_R2R_TPA1_EN_Msk 	(0x1UL << TEST_BUS_CTRL_TBUS_R2R_TPA1_EN_Pos) 	/*!< 0x00004000 */
#define 	TEST_BUS_CTRL_TBUS_R2R_TPA1_EN 	TEST_BUS_CTRL_TBUS_R2R_TPA1_EN_Msk
#define 	TEST_BUS_CTRL_TBUS_R2R_TPA2_EN_Pos 	(0xFU)
#define 	TEST_BUS_CTRL_TBUS_R2R_TPA2_EN_Msk 	(0x1UL << TEST_BUS_CTRL_TBUS_R2R_TPA2_EN_Pos) 	/*!< 0x00008000 */
#define 	TEST_BUS_CTRL_TBUS_R2R_TPA2_EN 	TEST_BUS_CTRL_TBUS_R2R_TPA2_EN_Msk
#define 	TEST_BUS_CTRL_TBUS_ADC_SW_Pos 	(0x10U)
#define 	TEST_BUS_CTRL_TBUS_ADC_SW_Msk 	(0x1UL << TEST_BUS_CTRL_TBUS_ADC_SW_Pos) 	/*!< 0x00010000 */
#define 	TEST_BUS_CTRL_TBUS_ADC_SW 	TEST_BUS_CTRL_TBUS_ADC_SW_Msk
#define 	TEST_BUS_CTRL_AGPIO_LV0_CTL_Pos 	(0x11U)
#define 	TEST_BUS_CTRL_AGPIO_LV0_CTL_Msk 	(0xFUL << TEST_BUS_CTRL_AGPIO_LV0_CTL_Pos) 	/*!< 0x001E0000 */
#define 	TEST_BUS_CTRL_AGPIO_LV0_CTL 	TEST_BUS_CTRL_AGPIO_LV0_CTL_Msk
#define 	TEST_BUS_CTRL_AGPIO_LV1_CTL_Pos 	(0x15U)
#define 	TEST_BUS_CTRL_AGPIO_LV1_CTL_Msk 	(0xFUL << TEST_BUS_CTRL_AGPIO_LV1_CTL_Pos) 	/*!< 0x01E00000 */
#define 	TEST_BUS_CTRL_AGPIO_LV1_CTL 	TEST_BUS_CTRL_AGPIO_LV1_CTL_Msk
#define LIFO_CTRL 	(0x00000008UL) 	/*<! Lifo control register */
#define 	LIFO_CTRL_EN_Pos 	(0x0U)
#define 	LIFO_CTRL_EN_Msk 	(0x1UL << LIFO_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	LIFO_CTRL_EN 	LIFO_CTRL_EN_Msk
#define 	LIFO_CTRL_CONT_OP_EN_Pos 	(0x1U)
#define 	LIFO_CTRL_CONT_OP_EN_Msk 	(0x1UL << LIFO_CTRL_CONT_OP_EN_Pos) 	/*!< 0x00000002 */
#define 	LIFO_CTRL_CONT_OP_EN 	LIFO_CTRL_CONT_OP_EN_Msk
#define 	LIFO_CTRL_DFT_MODE_EN_Pos 	(0x2U)
#define 	LIFO_CTRL_DFT_MODE_EN_Msk 	(0x1UL << LIFO_CTRL_DFT_MODE_EN_Pos) 	/*!< 0x00000004 */
#define 	LIFO_CTRL_DFT_MODE_EN 	LIFO_CTRL_DFT_MODE_EN_Msk
#define 	LIFO_CTRL_TIMER_EN_Pos 	(0x3U)
#define 	LIFO_CTRL_TIMER_EN_Msk 	(0x1UL << LIFO_CTRL_TIMER_EN_Pos) 	/*!< 0x00000008 */
#define 	LIFO_CTRL_TIMER_EN 	LIFO_CTRL_TIMER_EN_Msk
#define 	LIFO_CTRL_TIMER_THRESHOLD_Pos 	(0x4U)
#define 	LIFO_CTRL_TIMER_THRESHOLD_Msk 	(0x3FFFUL << LIFO_CTRL_TIMER_THRESHOLD_Pos) 	/*!< 0x0003FFF0 */
#define 	LIFO_CTRL_TIMER_THRESHOLD 	LIFO_CTRL_TIMER_THRESHOLD_Msk
#define LIFO_TOFF_STATUS 	(0x0000000CUL) 	/*<! Lifo Toff duration */
#define 	LIFO_TOFF_STATUS_Pos 	(0x0U)
#define 	LIFO_TOFF_STATUS_Msk 	(0xFFFFUL << LIFO_TOFF_STATUS_Pos) 	/*!< 0x0000FFFF */
#define 	LIFO_TOFF_STATUS_VALID_Pos 	(0x10U)
#define 	LIFO_TOFF_STATUS_VALID_Msk 	(0x1UL << LIFO_TOFF_STATUS_VALID_Pos) 	/*!< 0x00010000 */
#define 	LIFO_TOFF_STATUS_VALID 	LIFO_TOFF_STATUS_VALID_Msk
#define 	LIFO_TOFF_STATUS_OVERRUN_Pos 	(0x11U)
#define 	LIFO_TOFF_STATUS_OVERRUN_Msk 	(0x1UL << LIFO_TOFF_STATUS_OVERRUN_Pos) 	/*!< 0x00020000 */
#define 	LIFO_TOFF_STATUS_OVERRUN 	LIFO_TOFF_STATUS_OVERRUN_Msk
#define LIFO_TON_STATUS 	(0x00000010UL) 	/*<! Lifo Ton duration */
#define 	LIFO_TON_STATUS_Pos 	(0x0U)
#define 	LIFO_TON_STATUS_Msk 	(0xFFFFFFFUL << LIFO_TON_STATUS_Pos) 	/*!< 0x0FFFFFFF */
#define 	LIFO_TON_STATUS_VALID_Pos 	(0x1CU)
#define 	LIFO_TON_STATUS_VALID_Msk 	(0x1UL << LIFO_TON_STATUS_VALID_Pos) 	/*!< 0x10000000 */
#define 	LIFO_TON_STATUS_VALID 	LIFO_TON_STATUS_VALID_Msk
#define 	LIFO_TON_STATUS_OVERRUN_Pos 	(0x1DU)
#define 	LIFO_TON_STATUS_OVERRUN_Msk 	(0x1UL << LIFO_TON_STATUS_OVERRUN_Pos) 	/*!< 0x20000000 */
#define 	LIFO_TON_STATUS_OVERRUN 	LIFO_TON_STATUS_OVERRUN_Msk
#define CHIP_ID 	(0x00000014UL) 	/*<! Chip Identification register */
#define 	CHIP_ID_Pos 	(0x0U)
#define 	CHIP_ID_Msk 	(0xFFFFFFFFUL << CHIP_ID_Pos) 	/*!< 0xFFFFFFFF */
#define SPARE_CTRL0 	(0x00000018UL) 	/*<! Spare input signals for analog core. */
#define 	SPARE_CTRL0_LIFO_OUTPUT_SEL_5_Pos 	(0x5U)
#define 	SPARE_CTRL0_LIFO_OUTPUT_SEL_5_Msk 	(0x1UL << SPARE_CTRL0_LIFO_OUTPUT_SEL_5_Pos) 	/*!< 0x00000020 */
#define 	SPARE_CTRL0_LIFO_OUTPUT_SEL_5 	SPARE_CTRL0_LIFO_OUTPUT_SEL_5_Msk
#define 	SPARE_CTRL0_GCD_ALL_CLSTR_RST_EN_Pos 	(0x6U)
#define 	SPARE_CTRL0_GCD_ALL_CLSTR_RST_EN_Msk 	(0x1UL << SPARE_CTRL0_GCD_ALL_CLSTR_RST_EN_Pos) 	/*!< 0x00000040 */
#define 	SPARE_CTRL0_GCD_ALL_CLSTR_RST_EN 	SPARE_CTRL0_GCD_ALL_CLSTR_RST_EN_Msk
#define 	SPARE_CTRL0_LIFO_OUTPUT_SEL_8_6_Pos 	(0x7U)
#define 	SPARE_CTRL0_LIFO_OUTPUT_SEL_8_6_Msk 	(0x7UL << SPARE_CTRL0_LIFO_OUTPUT_SEL_8_6_Pos) 	/*!< 0x00000380 */
#define 	SPARE_CTRL0_LIFO_OUTPUT_SEL_8_6 	SPARE_CTRL0_LIFO_OUTPUT_SEL_8_6_Msk
#define DIG_SOFT_RESET 	(0x0000001CUL) 	/*<! Digital Core Soft Reset control register */
#define 	DIG_SOFT_RESET_DIGITAL_CSR_SRST_Pos 	(0x0U)
#define 	DIG_SOFT_RESET_DIGITAL_CSR_SRST_Msk 	(0x1UL << DIG_SOFT_RESET_DIGITAL_CSR_SRST_Pos) 	/*!< 0x00000001 */
#define 	DIG_SOFT_RESET_DIGITAL_CSR_SRST 	DIG_SOFT_RESET_DIGITAL_CSR_SRST_Msk
#define 	DIG_SOFT_RESET_DIGITAL_PIPE_SRST_Pos 	(0x1U)
#define 	DIG_SOFT_RESET_DIGITAL_PIPE_SRST_Msk 	(0x1UL << DIG_SOFT_RESET_DIGITAL_PIPE_SRST_Pos) 	/*!< 0x00000002 */
#define 	DIG_SOFT_RESET_DIGITAL_PIPE_SRST 	DIG_SOFT_RESET_DIGITAL_PIPE_SRST_Msk
#define 	DIG_SOFT_RESET_ANALOG_RSTN_Pos 	(0x2U)
#define 	DIG_SOFT_RESET_ANALOG_RSTN_Msk 	(0x1UL << DIG_SOFT_RESET_ANALOG_RSTN_Pos) 	/*!< 0x00000004 */
#define 	DIG_SOFT_RESET_ANALOG_RSTN 	DIG_SOFT_RESET_ANALOG_RSTN_Msk
#define 	DIG_SOFT_RESET_PDL_OVERRIDE_Pos 	(0x3U)
#define 	DIG_SOFT_RESET_PDL_OVERRIDE_Msk 	(0x1UL << DIG_SOFT_RESET_PDL_OVERRIDE_Pos) 	/*!< 0x00000008 */
#define 	DIG_SOFT_RESET_PDL_OVERRIDE 	DIG_SOFT_RESET_PDL_OVERRIDE_Msk
#define REFRACTORY_CTRL 	(0x00000020UL) 	/*<! Register to control Refractory Period */
#define 	REFRACTORY_CTRL_REFR_COUNTER_Pos 	(0x0U)
#define 	REFRACTORY_CTRL_REFR_COUNTER_Msk 	(0xFFFFFFFUL << REFRACTORY_CTRL_REFR_COUNTER_Pos) 	/*!< 0x0FFFFFFF */
#define 	REFRACTORY_CTRL_REFR_COUNTER 	REFRACTORY_CTRL_REFR_COUNTER_Msk
#define 	REFRACTORY_CTRL_REFR_VALID_Pos 	(0x1CU)
#define 	REFRACTORY_CTRL_REFR_VALID_Msk 	(0x1UL << REFRACTORY_CTRL_REFR_VALID_Pos) 	/*!< 0x10000000 */
#define 	REFRACTORY_CTRL_REFR_VALID 	REFRACTORY_CTRL_REFR_VALID_Msk
#define 	REFRACTORY_CTRL_REFR_OVERRUN_Pos 	(0x1DU)
#define 	REFRACTORY_CTRL_REFR_OVERRUN_Msk 	(0x1UL << REFRACTORY_CTRL_REFR_OVERRUN_Pos) 	/*!< 0x20000000 */
#define 	REFRACTORY_CTRL_REFR_OVERRUN 	REFRACTORY_CTRL_REFR_OVERRUN_Msk
#define 	REFRACTORY_CTRL_REFR_CNT_EN_Pos 	(0x1EU)
#define 	REFRACTORY_CTRL_REFR_CNT_EN_Msk 	(0x1UL << REFRACTORY_CTRL_REFR_CNT_EN_Pos) 	/*!< 0x40000000 */
#define 	REFRACTORY_CTRL_REFR_CNT_EN 	REFRACTORY_CTRL_REFR_CNT_EN_Msk
#define 	REFRACTORY_CTRL_REFR_EN_Pos 	(0x1FU)
#define 	REFRACTORY_CTRL_REFR_EN_Msk 	(0x1UL << REFRACTORY_CTRL_REFR_EN_Pos) 	/*!< 0x80000000 */
#define 	REFRACTORY_CTRL_REFR_EN 	REFRACTORY_CTRL_REFR_EN_Msk
#define DIG_TEST_BUS_CTRL 	(0x00000024UL) 	/*<! TPD1 test bus source selector register */
#define 	DIG_TEST_BUS_CTRL_TBUS_SEL_TPD1_Pos 	(0x0U)
#define 	DIG_TEST_BUS_CTRL_TBUS_SEL_TPD1_Msk 	(0x3FUL << DIG_TEST_BUS_CTRL_TBUS_SEL_TPD1_Pos) 	/*!< 0x0000003F */
#define 	DIG_TEST_BUS_CTRL_TBUS_SEL_TPD1 	DIG_TEST_BUS_CTRL_TBUS_SEL_TPD1_Msk
#define ANALOG_MEASURE_EVENT 	(0x00000028UL) 	/*<! Analog Mesures Event Injection control */
#define 	ANALOG_MEASURE_EVENT_ADC_EN_Pos 	(0x0U)
#define 	ANALOG_MEASURE_EVENT_ADC_EN_Msk 	(0x1UL << ANALOG_MEASURE_EVENT_ADC_EN_Pos) 	/*!< 0x00000001 */
#define 	ANALOG_MEASURE_EVENT_ADC_EN 	ANALOG_MEASURE_EVENT_ADC_EN_Msk
#define 	ANALOG_MEASURE_EVENT_REFR_EN_Pos 	(0x1U)
#define 	ANALOG_MEASURE_EVENT_REFR_EN_Msk 	(0x1UL << ANALOG_MEASURE_EVENT_REFR_EN_Pos) 	/*!< 0x00000002 */
#define 	ANALOG_MEASURE_EVENT_REFR_EN 	ANALOG_MEASURE_EVENT_REFR_EN_Msk
#define 	ANALOG_MEASURE_EVENT_LIFO_ON_EN_Pos 	(0x2U)
#define 	ANALOG_MEASURE_EVENT_LIFO_ON_EN_Msk 	(0x1UL << ANALOG_MEASURE_EVENT_LIFO_ON_EN_Pos) 	/*!< 0x00000004 */
#define 	ANALOG_MEASURE_EVENT_LIFO_ON_EN 	ANALOG_MEASURE_EVENT_LIFO_ON_EN_Msk
#define 	ANALOG_MEASURE_EVENT_LIFO_OFF_EN_Pos 	(0x3U)
#define 	ANALOG_MEASURE_EVENT_LIFO_OFF_EN_Msk 	(0x1UL << ANALOG_MEASURE_EVENT_LIFO_OFF_EN_Pos) 	/*!< 0x00000008 */
#define 	ANALOG_MEASURE_EVENT_LIFO_OFF_EN 	ANALOG_MEASURE_EVENT_LIFO_OFF_EN_Msk
#define RO_TD_CTRL 	(0x0000002CUL) 	/*<! TD Readout Control */
#define 	RO_TD_CTRL_ACT_PDY_DRIVE_Pos 	(0x0U)
#define 	RO_TD_CTRL_ACT_PDY_DRIVE_Msk 	(0x7UL << RO_TD_CTRL_ACT_PDY_DRIVE_Pos) 	/*!< 0x00000007 */
#define 	RO_TD_CTRL_ACT_PDY_DRIVE 	RO_TD_CTRL_ACT_PDY_DRIVE_Msk
#define 	RO_TD_CTRL_ACT_PU_DRIVE_Pos 	(0x3U)
#define 	RO_TD_CTRL_ACT_PU_DRIVE_Msk 	(0xFUL << RO_TD_CTRL_ACT_PU_DRIVE_Pos) 	/*!< 0x00000078 */
#define 	RO_TD_CTRL_ACT_PU_DRIVE 	RO_TD_CTRL_ACT_PU_DRIVE_Msk
#define 	RO_TD_CTRL_SENDREQ_Y_STAT_EN_Pos 	(0x7U)
#define 	RO_TD_CTRL_SENDREQ_Y_STAT_EN_Msk 	(0x1UL << RO_TD_CTRL_SENDREQ_Y_STAT_EN_Pos) 	/*!< 0x00000080 */
#define 	RO_TD_CTRL_SENDREQ_Y_STAT_EN 	RO_TD_CTRL_SENDREQ_Y_STAT_EN_Msk
#define 	RO_TD_CTRL_SENDREQ_Y_RSTN_Pos 	(0x8U)
#define 	RO_TD_CTRL_SENDREQ_Y_RSTN_Msk 	(0x1UL << RO_TD_CTRL_SENDREQ_Y_RSTN_Pos) 	/*!< 0x00000100 */
#define 	RO_TD_CTRL_SENDREQ_Y_RSTN 	RO_TD_CTRL_SENDREQ_Y_RSTN_Msk
#define 	RO_TD_CTRL_INT_X_RSTN_Pos 	(0x9U)
#define 	RO_TD_CTRL_INT_X_RSTN_Msk 	(0x1UL << RO_TD_CTRL_INT_X_RSTN_Pos) 	/*!< 0x00000200 */
#define 	RO_TD_CTRL_INT_X_RSTN 	RO_TD_CTRL_INT_X_RSTN_Msk
#define 	RO_TD_CTRL_INT_Y_RSTN_Pos 	(0xAU)
#define 	RO_TD_CTRL_INT_Y_RSTN_Msk 	(0x1UL << RO_TD_CTRL_INT_Y_RSTN_Pos) 	/*!< 0x00000400 */
#define 	RO_TD_CTRL_INT_Y_RSTN 	RO_TD_CTRL_INT_Y_RSTN_Msk
#define 	RO_TD_CTRL_INT_X_STAT_EN_Pos 	(0xBU)
#define 	RO_TD_CTRL_INT_X_STAT_EN_Msk 	(0x1UL << RO_TD_CTRL_INT_X_STAT_EN_Pos) 	/*!< 0x00000800 */
#define 	RO_TD_CTRL_INT_X_STAT_EN 	RO_TD_CTRL_INT_X_STAT_EN_Msk
#define 	RO_TD_CTRL_INT_Y_STAT_EN_Pos 	(0xCU)
#define 	RO_TD_CTRL_INT_Y_STAT_EN_Msk 	(0x1UL << RO_TD_CTRL_INT_Y_STAT_EN_Pos) 	/*!< 0x00001000 */
#define 	RO_TD_CTRL_INT_Y_STAT_EN 	RO_TD_CTRL_INT_Y_STAT_EN_Msk
#define 	RO_TD_CTRL_ADDR_Y_STAT_EN_Pos 	(0xDU)
#define 	RO_TD_CTRL_ADDR_Y_STAT_EN_Msk 	(0x1UL << RO_TD_CTRL_ADDR_Y_STAT_EN_Pos) 	/*!< 0x00002000 */
#define 	RO_TD_CTRL_ADDR_Y_STAT_EN 	RO_TD_CTRL_ADDR_Y_STAT_EN_Msk
#define 	RO_TD_CTRL_ADDR_Y_RSTN_Pos 	(0xEU)
#define 	RO_TD_CTRL_ADDR_Y_RSTN_Msk 	(0x1UL << RO_TD_CTRL_ADDR_Y_RSTN_Pos) 	/*!< 0x00004000 */
#define 	RO_TD_CTRL_ADDR_Y_RSTN 	RO_TD_CTRL_ADDR_Y_RSTN_Msk
#define 	RO_TD_CTRL_ACK_Y_RSTN_Pos 	(0xFU)
#define 	RO_TD_CTRL_ACK_Y_RSTN_Msk 	(0x1UL << RO_TD_CTRL_ACK_Y_RSTN_Pos) 	/*!< 0x00008000 */
#define 	RO_TD_CTRL_ACK_Y_RSTN 	RO_TD_CTRL_ACK_Y_RSTN_Msk
#define 	RO_TD_CTRL_ARB_Y_RSTN_Pos 	(0x11U)
#define 	RO_TD_CTRL_ARB_Y_RSTN_Msk 	(0x1UL << RO_TD_CTRL_ARB_Y_RSTN_Pos) 	/*!< 0x00020000 */
#define 	RO_TD_CTRL_ARB_Y_RSTN 	RO_TD_CTRL_ARB_Y_RSTN_Msk
#define 	RO_TD_CTRL_ACK_Y_SET_Pos 	(0x12U)
#define 	RO_TD_CTRL_ACK_Y_SET_Msk 	(0x1UL << RO_TD_CTRL_ACK_Y_SET_Pos) 	/*!< 0x00040000 */
#define 	RO_TD_CTRL_ACK_Y_SET 	RO_TD_CTRL_ACK_Y_SET_Msk
#define 	RO_TD_CTRL_INT_X_ACT_PU_Pos 	(0x13U)
#define 	RO_TD_CTRL_INT_X_ACT_PU_Msk 	(0x7UL << RO_TD_CTRL_INT_X_ACT_PU_Pos) 	/*!< 0x00380000 */
#define 	RO_TD_CTRL_INT_X_ACT_PU 	RO_TD_CTRL_INT_X_ACT_PU_Msk
#define 	RO_TD_CTRL_REQX_CTRLLAST_BYPASS_Pos 	(0x16U)
#define 	RO_TD_CTRL_REQX_CTRLLAST_BYPASS_Msk 	(0x1UL << RO_TD_CTRL_REQX_CTRLLAST_BYPASS_Pos) 	/*!< 0x00400000 */
#define 	RO_TD_CTRL_REQX_CTRLLAST_BYPASS 	RO_TD_CTRL_REQX_CTRLLAST_BYPASS_Msk
#define ROI_SLICE_CTRL1 	(0x00000030UL) 	/*<! ROI window mode chicken bits */
#define 	ROI_SLICE_CTRL1_LIST_SEL_Pos 	(0x0U)
#define 	ROI_SLICE_CTRL1_LIST_SEL_Msk 	(0x3FFFFUL << ROI_SLICE_CTRL1_LIST_SEL_Pos) 	/*!< 0x0003FFFF */
#define 	ROI_SLICE_CTRL1_LIST_SEL 	ROI_SLICE_CTRL1_LIST_SEL_Msk
#define ROI_MASTER_CTRL 	(0x00000034UL) 	/*<! ICN ROI Multiple Window Master control(RMWM ctrl), this work along with registers roi_win_y* and roi_win_x* */
#define 	ROI_MASTER_CTRL_EN_Pos 	(0x0U)
#define 	ROI_MASTER_CTRL_EN_Msk 	(0x1UL << ROI_MASTER_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	ROI_MASTER_CTRL_EN 	ROI_MASTER_CTRL_EN_Msk
#define 	ROI_MASTER_CTRL_RUN_Pos 	(0x1U)
#define 	ROI_MASTER_CTRL_RUN_Msk 	(0x1UL << ROI_MASTER_CTRL_RUN_Pos) 	/*!< 0x00000002 */
#define 	ROI_MASTER_CTRL_RUN 	ROI_MASTER_CTRL_RUN_Msk
#define 	ROI_MASTER_CTRL_MODE_Pos 	(0x2U)
#define 	ROI_MASTER_CTRL_MODE_Msk 	(0x1UL << ROI_MASTER_CTRL_MODE_Pos) 	/*!< 0x00000004 */
#define 	ROI_MASTER_CTRL_MODE 	ROI_MASTER_CTRL_MODE_Msk
#define 	ROI_MASTER_CTRL_WIN_NB_Pos 	(0x3U)
#define 	ROI_MASTER_CTRL_WIN_NB_Msk 	(0x1FUL << ROI_MASTER_CTRL_WIN_NB_Pos) 	/*!< 0x000000F8 */
#define 	ROI_MASTER_CTRL_WIN_NB 	ROI_MASTER_CTRL_WIN_NB_Msk
#define 	ROI_MASTER_CTRL_BUSY_Pos 	(0x10U)
#define 	ROI_MASTER_CTRL_BUSY_Msk 	(0x1UL << ROI_MASTER_CTRL_BUSY_Pos) 	/*!< 0x00010000 */
#define 	ROI_MASTER_CTRL_BUSY 	ROI_MASTER_CTRL_BUSY_Msk
#define 	ROI_MASTER_CTRL_DONE_Pos 	(0x11U)
#define 	ROI_MASTER_CTRL_DONE_Msk 	(0x1UL << ROI_MASTER_CTRL_DONE_Pos) 	/*!< 0x00020000 */
#define 	ROI_MASTER_CTRL_DONE 	ROI_MASTER_CTRL_DONE_Msk
#define ROI_DRIVER_CTRL 	(0x00000038UL) 	/*<! ICN ROI Master(Slice Driver) control */
#define 	ROI_DRIVER_CTRL_EN_Pos 	(0x0U)
#define 	ROI_DRIVER_CTRL_EN_Msk 	(0x1UL << ROI_DRIVER_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	ROI_DRIVER_CTRL_EN 	ROI_DRIVER_CTRL_EN_Msk
#define 	ROI_DRIVER_CTRL_RUN_Pos 	(0x1U)
#define 	ROI_DRIVER_CTRL_RUN_Msk 	(0x1UL << ROI_DRIVER_CTRL_RUN_Pos) 	/*!< 0x00000002 */
#define 	ROI_DRIVER_CTRL_RUN 	ROI_DRIVER_CTRL_RUN_Msk
#define 	ROI_DRIVER_CTRL_MODE_Pos 	(0x2U)
#define 	ROI_DRIVER_CTRL_MODE_Msk 	(0x3UL << ROI_DRIVER_CTRL_MODE_Pos) 	/*!< 0x0000000C */
#define 	ROI_DRIVER_CTRL_MODE 	ROI_DRIVER_CTRL_MODE_Msk
#define 	ROI_DRIVER_CTRL_SHADOW_TRIG_EN_Pos 	(0x4U)
#define 	ROI_DRIVER_CTRL_SHADOW_TRIG_EN_Msk 	(0x1UL << ROI_DRIVER_CTRL_SHADOW_TRIG_EN_Pos) 	/*!< 0x00000010 */
#define 	ROI_DRIVER_CTRL_SHADOW_TRIG_EN 	ROI_DRIVER_CTRL_SHADOW_TRIG_EN_Msk
#define 	ROI_DRIVER_CTRL_BUSY_Pos 	(0x10U)
#define 	ROI_DRIVER_CTRL_BUSY_Msk 	(0x1UL << ROI_DRIVER_CTRL_BUSY_Pos) 	/*!< 0x00010000 */
#define 	ROI_DRIVER_CTRL_BUSY 	ROI_DRIVER_CTRL_BUSY_Msk
#define 	ROI_DRIVER_CTRL_DONE_Pos 	(0x11U)
#define 	ROI_DRIVER_CTRL_DONE_Msk 	(0x1UL << ROI_DRIVER_CTRL_DONE_Pos) 	/*!< 0x00020000 */
#define 	ROI_DRIVER_CTRL_DONE 	ROI_DRIVER_CTRL_DONE_Msk
#define ROI_SLICE_CTRL 	(0x0000003CUL) 	/*<! ICN ROI slice configuration control */
#define 	ROI_SLICE_CTRL_START_Pos 	(0x0U)
#define 	ROI_SLICE_CTRL_START_Msk 	(0x1FFUL << ROI_SLICE_CTRL_START_Pos) 	/*!< 0x000001FF */
#define 	ROI_SLICE_CTRL_START 	ROI_SLICE_CTRL_START_Msk
#define 	ROI_SLICE_CTRL_END_P1_Pos 	(0x10U)
#define 	ROI_SLICE_CTRL_END_P1_Msk 	(0x1FFUL << ROI_SLICE_CTRL_END_P1_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_SLICE_CTRL_END_P1 	ROI_SLICE_CTRL_END_P1_Msk
#define ICN_CONTROL 	(0x00000040UL) 	/*<! Interconnect(ICN) control register */
#define 	ICN_CONTROL_LEGACY_MODE_Pos 	(0x0U)
#define 	ICN_CONTROL_LEGACY_MODE_Msk 	(0x1UL << ICN_CONTROL_LEGACY_MODE_Pos) 	/*!< 0x00000001 */
#define 	ICN_CONTROL_LEGACY_MODE 	ICN_CONTROL_LEGACY_MODE_Msk
#define 	ICN_CONTROL_DISABLE_M0_Pos 	(0x1U)
#define 	ICN_CONTROL_DISABLE_M0_Msk 	(0x1UL << ICN_CONTROL_DISABLE_M0_Pos) 	/*!< 0x00000002 */
#define 	ICN_CONTROL_DISABLE_M0 	ICN_CONTROL_DISABLE_M0_Msk
#define 	ICN_CONTROL_DISABLE_M1_Pos 	(0x2U)
#define 	ICN_CONTROL_DISABLE_M1_Msk 	(0x1UL << ICN_CONTROL_DISABLE_M1_Pos) 	/*!< 0x00000004 */
#define 	ICN_CONTROL_DISABLE_M1 	ICN_CONTROL_DISABLE_M1_Msk
#define ROI_MASTER_CHICKEN_BIT 	(0x00000044UL) 	/*<! ICN ROI Multiple Window Master chicken bits(those bits are destinated to designer and should not be used by anyone else) */
#define 	ROI_MASTER_CHICKEN_BIT_DRIVER_REGISTER_IF_EN_Pos 	(0x0U)
#define 	ROI_MASTER_CHICKEN_BIT_DRIVER_REGISTER_IF_EN_Msk 	(0x1UL << ROI_MASTER_CHICKEN_BIT_DRIVER_REGISTER_IF_EN_Pos) 	/*!< 0x00000001 */
#define 	ROI_MASTER_CHICKEN_BIT_DRIVER_REGISTER_IF_EN 	ROI_MASTER_CHICKEN_BIT_DRIVER_REGISTER_IF_EN_Msk
#define 	ROI_MASTER_CHICKEN_BIT_HOLD_TIME_Pos 	(0x1U)
#define 	ROI_MASTER_CHICKEN_BIT_HOLD_TIME_Msk 	(0x1FUL << ROI_MASTER_CHICKEN_BIT_HOLD_TIME_Pos) 	/*!< 0x0000003E */
#define 	ROI_MASTER_CHICKEN_BIT_HOLD_TIME 	ROI_MASTER_CHICKEN_BIT_HOLD_TIME_Msk
#define CPU_INT_CONTROL 	(0x00000048UL) 	/*<! Embedded CPU External interrupt control register */
#define 	CPU_INT_CONTROL_SOFT_IT_Pos 	(0x0U)
#define 	CPU_INT_CONTROL_SOFT_IT_Msk 	(0xFFFFUL << CPU_INT_CONTROL_SOFT_IT_Pos) 	/*!< 0x0000FFFF */
#define 	CPU_INT_CONTROL_SOFT_IT 	CPU_INT_CONTROL_SOFT_IT_Msk
#define 	CPU_INT_CONTROL_IRQ_LOCK_COUNTER_CYCLES_Pos 	(0x10U)
#define 	CPU_INT_CONTROL_IRQ_LOCK_COUNTER_CYCLES_Msk 	(0x3FUL << CPU_INT_CONTROL_IRQ_LOCK_COUNTER_CYCLES_Pos) 	/*!< 0x003F0000 */
#define 	CPU_INT_CONTROL_IRQ_LOCK_COUNTER_CYCLES 	CPU_INT_CONTROL_IRQ_LOCK_COUNTER_CYCLES_Msk
#define ADC_CONTROL 	(0x0000004CUL) 	/*<! Analog Digital Converter Control Register */
#define 	ADC_CONTROL_EN_Pos 	(0x0U)
#define 	ADC_CONTROL_EN_Msk 	(0x1UL << ADC_CONTROL_EN_Pos) 	/*!< 0x00000001 */
#define 	ADC_CONTROL_EN 	ADC_CONTROL_EN_Msk
#define 	ADC_CONTROL_CLK_EN_Pos 	(0x1U)
#define 	ADC_CONTROL_CLK_EN_Msk 	(0x1UL << ADC_CONTROL_CLK_EN_Pos) 	/*!< 0x00000002 */
#define 	ADC_CONTROL_CLK_EN 	ADC_CONTROL_CLK_EN_Msk
#define 	ADC_CONTROL_START_Pos 	(0x2U)
#define 	ADC_CONTROL_START_Msk 	(0x1UL << ADC_CONTROL_START_Pos) 	/*!< 0x00000004 */
#define 	ADC_CONTROL_START 	ADC_CONTROL_START_Msk
#define 	ADC_CONTROL_CONT_NSINGLE_Pos 	(0x3U)
#define 	ADC_CONTROL_CONT_NSINGLE_Msk 	(0x1UL << ADC_CONTROL_CONT_NSINGLE_Pos) 	/*!< 0x00000008 */
#define 	ADC_CONTROL_CONT_NSINGLE 	ADC_CONTROL_CONT_NSINGLE_Msk
#define 	ADC_CONTROL_CLK_DIV_Pos 	(0x4U)
#define 	ADC_CONTROL_CLK_DIV_Msk 	(0xFFFFUL << ADC_CONTROL_CLK_DIV_Pos) 	/*!< 0x000FFFF0 */
#define 	ADC_CONTROL_CLK_DIV 	ADC_CONTROL_CLK_DIV_Msk
#define 	ADC_CONTROL_PAUSE_Pos 	(0x14U)
#define 	ADC_CONTROL_PAUSE_Msk 	(0x1FUL << ADC_CONTROL_PAUSE_Pos) 	/*!< 0x01F00000 */
#define 	ADC_CONTROL_PAUSE 	ADC_CONTROL_PAUSE_Msk
#define ADC_STATUS1 	(0x00000050UL) 	/*<! ADC start/End signal and DAC for ADC */
#define 	ADC_STATUS1_DAC_DYN_Pos 	(0x0U)
#define 	ADC_STATUS1_DAC_DYN_Msk 	(0x3FFUL << ADC_STATUS1_DAC_DYN_Pos) 	/*!< 0x000003FF */
#define 	ADC_STATUS1_DAC_DYN 	ADC_STATUS1_DAC_DYN_Msk
#define 	ADC_STATUS1_ON_DYN_Pos 	(0xAU)
#define 	ADC_STATUS1_ON_DYN_Msk 	(0x1UL << ADC_STATUS1_ON_DYN_Pos) 	/*!< 0x00000400 */
#define 	ADC_STATUS1_ON_DYN 	ADC_STATUS1_ON_DYN_Msk
#define 	ADC_STATUS1_DONE_DYN_Pos 	(0xBU)
#define 	ADC_STATUS1_DONE_DYN_Msk 	(0x1UL << ADC_STATUS1_DONE_DYN_Pos) 	/*!< 0x00000800 */
#define 	ADC_STATUS1_DONE_DYN 	ADC_STATUS1_DONE_DYN_Msk
#define 	ADC_STATUS1_BUF_H_OFFSET_DAC_DYN_Pos 	(0xCU)
#define 	ADC_STATUS1_BUF_H_OFFSET_DAC_DYN_Msk 	(0x3FUL << ADC_STATUS1_BUF_H_OFFSET_DAC_DYN_Pos) 	/*!< 0x0003F000 */
#define 	ADC_STATUS1_BUF_H_OFFSET_DAC_DYN 	ADC_STATUS1_BUF_H_OFFSET_DAC_DYN_Msk
#define 	ADC_STATUS1_BUF_L_OFFSET_DAC_DYN_Pos 	(0x12U)
#define 	ADC_STATUS1_BUF_L_OFFSET_DAC_DYN_Msk 	(0x3FUL << ADC_STATUS1_BUF_L_OFFSET_DAC_DYN_Pos) 	/*!< 0x00FC0000 */
#define 	ADC_STATUS1_BUF_L_OFFSET_DAC_DYN 	ADC_STATUS1_BUF_L_OFFSET_DAC_DYN_Msk
#define 	ADC_STATUS1_BUF_IN_OFFSET_DAC_DYN_Pos 	(0x18U)
#define 	ADC_STATUS1_BUF_IN_OFFSET_DAC_DYN_Msk 	(0x3FUL << ADC_STATUS1_BUF_IN_OFFSET_DAC_DYN_Pos) 	/*!< 0x3F000000 */
#define 	ADC_STATUS1_BUF_IN_OFFSET_DAC_DYN 	ADC_STATUS1_BUF_IN_OFFSET_DAC_DYN_Msk
#define 	ADC_STATUS1_BUF_CAL_DONE_DYN_Pos 	(0x1EU)
#define 	ADC_STATUS1_BUF_CAL_DONE_DYN_Msk 	(0x1UL << ADC_STATUS1_BUF_CAL_DONE_DYN_Pos) 	/*!< 0x40000000 */
#define 	ADC_STATUS1_BUF_CAL_DONE_DYN 	ADC_STATUS1_BUF_CAL_DONE_DYN_Msk
#define ADC_MISC_CTRL 	(0x00000054UL) 	/*<! ADC calibration and TEST */
#define 	ADC_MISC_CTRL_BUF_CAL_EN_Pos 	(0x0U)
#define 	ADC_MISC_CTRL_BUF_CAL_EN_Msk 	(0x1UL << ADC_MISC_CTRL_BUF_CAL_EN_Pos) 	/*!< 0x00000001 */
#define 	ADC_MISC_CTRL_BUF_CAL_EN 	ADC_MISC_CTRL_BUF_CAL_EN_Msk
#define 	ADC_MISC_CTRL_CMP_CAL_EN_Pos 	(0x1U)
#define 	ADC_MISC_CTRL_CMP_CAL_EN_Msk 	(0x1UL << ADC_MISC_CTRL_CMP_CAL_EN_Pos) 	/*!< 0x00000002 */
#define 	ADC_MISC_CTRL_CMP_CAL_EN 	ADC_MISC_CTRL_CMP_CAL_EN_Msk
#define 	ADC_MISC_CTRL_BUF_TEST_Pos 	(0x2U)
#define 	ADC_MISC_CTRL_BUF_TEST_Msk 	(0x7UL << ADC_MISC_CTRL_BUF_TEST_Pos) 	/*!< 0x0000001C */
#define 	ADC_MISC_CTRL_BUF_TEST 	ADC_MISC_CTRL_BUF_TEST_Msk
#define 	ADC_MISC_CTRL_DAC_MAN_INIT_Pos 	(0x5U)
#define 	ADC_MISC_CTRL_DAC_MAN_INIT_Msk 	(0x1UL << ADC_MISC_CTRL_DAC_MAN_INIT_Pos) 	/*!< 0x00000020 */
#define 	ADC_MISC_CTRL_DAC_MAN_INIT 	ADC_MISC_CTRL_DAC_MAN_INIT_Msk
#define 	ADC_MISC_CTRL_DAC_TEST_EN_Pos 	(0x6U)
#define 	ADC_MISC_CTRL_DAC_TEST_EN_Msk 	(0x1UL << ADC_MISC_CTRL_DAC_TEST_EN_Pos) 	/*!< 0x00000040 */
#define 	ADC_MISC_CTRL_DAC_TEST_EN 	ADC_MISC_CTRL_DAC_TEST_EN_Msk
#define 	ADC_MISC_CTRL_TEST_EN_Pos 	(0x7U)
#define 	ADC_MISC_CTRL_TEST_EN_Msk 	(0x1UL << ADC_MISC_CTRL_TEST_EN_Pos) 	/*!< 0x00000080 */
