jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ADC_MISC_CTRL_TEST_EN 	ADC_MISC_CTRL_TEST_EN_Msk
#define 	ADC_MISC_CTRL_TEST_CNT_Pos 	(0x8U)
#define 	ADC_MISC_CTRL_TEST_CNT_Msk 	(0xFUL << ADC_MISC_CTRL_TEST_CNT_Pos) 	/*!< 0x00000F00 */
#define 	ADC_MISC_CTRL_TEST_CNT 	ADC_MISC_CTRL_TEST_CNT_Msk
#define 	ADC_MISC_CTRL_EXT_BG_Pos 	(0xCU)
#define 	ADC_MISC_CTRL_EXT_BG_Msk 	(0x1UL << ADC_MISC_CTRL_EXT_BG_Pos) 	/*!< 0x00001000 */
#define 	ADC_MISC_CTRL_EXT_BG 	ADC_MISC_CTRL_EXT_BG_Msk
#define 	ADC_MISC_CTRL_EXT_IN_Pos 	(0xDU)
#define 	ADC_MISC_CTRL_EXT_IN_Msk 	(0x1UL << ADC_MISC_CTRL_EXT_IN_Pos) 	/*!< 0x00002000 */
#define 	ADC_MISC_CTRL_EXT_IN 	ADC_MISC_CTRL_EXT_IN_Msk
#define 	ADC_MISC_CTRL_IHALF_Pos 	(0xEU)
#define 	ADC_MISC_CTRL_IHALF_Msk 	(0x1UL << ADC_MISC_CTRL_IHALF_Pos) 	/*!< 0x00004000 */
#define 	ADC_MISC_CTRL_IHALF 	ADC_MISC_CTRL_IHALF_Msk
#define 	ADC_MISC_CTRL_RNG_Pos 	(0xFU)
#define 	ADC_MISC_CTRL_RNG_Msk 	(0x3UL << ADC_MISC_CTRL_RNG_Pos) 	/*!< 0x00018000 */
#define 	ADC_MISC_CTRL_RNG 	ADC_MISC_CTRL_RNG_Msk
#define 	ADC_MISC_CTRL_TEMP_Pos 	(0x11U)
#define 	ADC_MISC_CTRL_TEMP_Msk 	(0x1UL << ADC_MISC_CTRL_TEMP_Pos) 	/*!< 0x00020000 */
#define 	ADC_MISC_CTRL_TEMP 	ADC_MISC_CTRL_TEMP_Msk
#define 	ADC_MISC_CTRL_CLK_ADJ_Pos 	(0x12U)
#define 	ADC_MISC_CTRL_CLK_ADJ_Msk 	(0x3UL << ADC_MISC_CTRL_CLK_ADJ_Pos) 	/*!< 0x000C0000 */
#define 	ADC_MISC_CTRL_CLK_ADJ 	ADC_MISC_CTRL_CLK_ADJ_Msk
#define 	ADC_MISC_CTRL_VREFH_CNT_Pos 	(0x14U)
#define 	ADC_MISC_CTRL_VREFH_CNT_Msk 	(0x1UL << ADC_MISC_CTRL_VREFH_CNT_Pos) 	/*!< 0x00100000 */
#define 	ADC_MISC_CTRL_VREFH_CNT 	ADC_MISC_CTRL_VREFH_CNT_Msk
#define 	ADC_MISC_CTRL_BUF_ADJ_RNG_Pos 	(0x15U)
#define 	ADC_MISC_CTRL_BUF_ADJ_RNG_Msk 	(0x1UL << ADC_MISC_CTRL_BUF_ADJ_RNG_Pos) 	/*!< 0x00200000 */
#define 	ADC_MISC_CTRL_BUF_ADJ_RNG 	ADC_MISC_CTRL_BUF_ADJ_RNG_Msk
#define 	ADC_MISC_CTRL_CMP_ADJ_RNG_Pos 	(0x16U)
#define 	ADC_MISC_CTRL_CMP_ADJ_RNG_Msk 	(0x1UL << ADC_MISC_CTRL_CMP_ADJ_RNG_Pos) 	/*!< 0x00400000 */
#define 	ADC_MISC_CTRL_CMP_ADJ_RNG 	ADC_MISC_CTRL_CMP_ADJ_RNG_Msk
#define 	ADC_MISC_CTRL_CMP_OFFSET_MANUAL_DAC_Pos 	(0x17U)
#define 	ADC_MISC_CTRL_CMP_OFFSET_MANUAL_DAC_Msk 	(0xFFUL << ADC_MISC_CTRL_CMP_OFFSET_MANUAL_DAC_Pos) 	/*!< 0x7F800000 */
#define 	ADC_MISC_CTRL_CMP_OFFSET_MANUAL_DAC 	ADC_MISC_CTRL_CMP_OFFSET_MANUAL_DAC_Msk
#define ADC_MANUAL_CTRL1 	(0x00000058UL) 	/*<! Manual set DAC1 */
#define 	ADC_MANUAL_CTRL1_BUF_H_OFFSET_DAC_Pos 	(0x0U)
#define 	ADC_MANUAL_CTRL1_BUF_H_OFFSET_DAC_Msk 	(0x3FUL << ADC_MANUAL_CTRL1_BUF_H_OFFSET_DAC_Pos) 	/*!< 0x0000003F */
#define 	ADC_MANUAL_CTRL1_BUF_H_OFFSET_DAC 	ADC_MANUAL_CTRL1_BUF_H_OFFSET_DAC_Msk
#define 	ADC_MANUAL_CTRL1_BUF_L_OFFSET_DAC_Pos 	(0x6U)
#define 	ADC_MANUAL_CTRL1_BUF_L_OFFSET_DAC_Msk 	(0x3FUL << ADC_MANUAL_CTRL1_BUF_L_OFFSET_DAC_Pos) 	/*!< 0x00000FC0 */
#define 	ADC_MANUAL_CTRL1_BUF_L_OFFSET_DAC 	ADC_MANUAL_CTRL1_BUF_L_OFFSET_DAC_Msk
#define 	ADC_MANUAL_CTRL1_BUF_IN_OFFSET_DAC_Pos 	(0xCU)
#define 	ADC_MANUAL_CTRL1_BUF_IN_OFFSET_DAC_Msk 	(0x3FUL << ADC_MANUAL_CTRL1_BUF_IN_OFFSET_DAC_Pos) 	/*!< 0x0003F000 */
#define 	ADC_MANUAL_CTRL1_BUF_IN_OFFSET_DAC 	ADC_MANUAL_CTRL1_BUF_IN_OFFSET_DAC_Msk
#define 	ADC_MANUAL_CTRL1_DAC_Pos 	(0x12U)
#define 	ADC_MANUAL_CTRL1_DAC_Msk 	(0x3FFUL << ADC_MANUAL_CTRL1_DAC_Pos) 	/*!< 0x0FFC0000 */
#define 	ADC_MANUAL_CTRL1_DAC 	ADC_MANUAL_CTRL1_DAC_Msk
#define TEMP_CTRL 	(0x0000005CUL) 	/*<! Temperature Sensor control register */
#define 	TEMP_CTRL_BUF_EN_Pos 	(0x0U)
#define 	TEMP_CTRL_BUF_EN_Msk 	(0x1UL << TEMP_CTRL_BUF_EN_Pos) 	/*!< 0x00000001 */
#define 	TEMP_CTRL_BUF_EN 	TEMP_CTRL_BUF_EN_Msk
#define 	TEMP_CTRL_BUF_CAL_EN_Pos 	(0x1U)
#define 	TEMP_CTRL_BUF_CAL_EN_Msk 	(0x1UL << TEMP_CTRL_BUF_CAL_EN_Pos) 	/*!< 0x00000002 */
#define 	TEMP_CTRL_BUF_CAL_EN 	TEMP_CTRL_BUF_CAL_EN_Msk
#define 	TEMP_CTRL_BUF_OFFSET_MAN_Pos 	(0x2U)
#define 	TEMP_CTRL_BUF_OFFSET_MAN_Msk 	(0x3FUL << TEMP_CTRL_BUF_OFFSET_MAN_Pos) 	/*!< 0x000000FC */
#define 	TEMP_CTRL_BUF_OFFSET_MAN 	TEMP_CTRL_BUF_OFFSET_MAN_Msk
#define 	TEMP_CTRL_IHALF_Pos 	(0x8U)
#define 	TEMP_CTRL_IHALF_Msk 	(0x1UL << TEMP_CTRL_IHALF_Pos) 	/*!< 0x00000100 */
#define 	TEMP_CTRL_IHALF 	TEMP_CTRL_IHALF_Msk
#define 	TEMP_CTRL_BUF_ADJ_RNG_Pos 	(0x9U)
#define 	TEMP_CTRL_BUF_ADJ_RNG_Msk 	(0x1UL << TEMP_CTRL_BUF_ADJ_RNG_Pos) 	/*!< 0x00000200 */
#define 	TEMP_CTRL_BUF_ADJ_RNG 	TEMP_CTRL_BUF_ADJ_RNG_Msk
#define 	TEMP_CTRL_TEST_CTL_Pos 	(0xAU)
#define 	TEMP_CTRL_TEST_CTL_Msk 	(0x3UL << TEMP_CTRL_TEST_CTL_Pos) 	/*!< 0x00000C00 */
#define 	TEMP_CTRL_TEST_CTL 	TEMP_CTRL_TEST_CTL_Msk
#define 	TEMP_CTRL_TEST_TP_EN_Pos 	(0xCU)
#define 	TEMP_CTRL_TEST_TP_EN_Msk 	(0x1UL << TEMP_CTRL_TEST_TP_EN_Pos) 	/*!< 0x00001000 */
#define 	TEMP_CTRL_TEST_TP_EN 	TEMP_CTRL_TEST_TP_EN_Msk
#define 	TEMP_CTRL_BUF_OFFSET_DAC_DYN_Pos 	(0xDU)
#define 	TEMP_CTRL_BUF_OFFSET_DAC_DYN_Msk 	(0x3FUL << TEMP_CTRL_BUF_OFFSET_DAC_DYN_Pos) 	/*!< 0x0007E000 */
#define 	TEMP_CTRL_BUF_OFFSET_DAC_DYN 	TEMP_CTRL_BUF_OFFSET_DAC_DYN_Msk
#define 	TEMP_CTRL_BUF_CAL_DONE_DYN_Pos 	(0x13U)
#define 	TEMP_CTRL_BUF_CAL_DONE_DYN_Msk 	(0x1UL << TEMP_CTRL_BUF_CAL_DONE_DYN_Pos) 	/*!< 0x00080000 */
#define 	TEMP_CTRL_BUF_CAL_DONE_DYN 	TEMP_CTRL_BUF_CAL_DONE_DYN_Msk
#define SPARE_FROM_ANA 	(0x00000060UL) 	/*<! Spare output signals for analog core with tie low. */
#define TOP_CHICKEN 	(0x00000064UL) 	/*<! top level chicken */
#define 	TOP_CHICKEN_I2C_PREFETCH_DIS_Pos 	(0x0U)
#define 	TOP_CHICKEN_I2C_PREFETCH_DIS_Msk 	(0x1UL << TOP_CHICKEN_I2C_PREFETCH_DIS_Pos) 	/*!< 0x00000001 */
#define 	TOP_CHICKEN_I2C_PREFETCH_DIS 	TOP_CHICKEN_I2C_PREFETCH_DIS_Msk
#define 	TOP_CHICKEN_OVERRIDE_MIPI_MODE_EN_Pos 	(0x1U)
#define 	TOP_CHICKEN_OVERRIDE_MIPI_MODE_EN_Msk 	(0x1UL << TOP_CHICKEN_OVERRIDE_MIPI_MODE_EN_Pos) 	/*!< 0x00000002 */
#define 	TOP_CHICKEN_OVERRIDE_MIPI_MODE_EN 	TOP_CHICKEN_OVERRIDE_MIPI_MODE_EN_Msk
#define 	TOP_CHICKEN_OVERRIDE_MIPI_MODE_Pos 	(0x2U)
#define 	TOP_CHICKEN_OVERRIDE_MIPI_MODE_Msk 	(0x1UL << TOP_CHICKEN_OVERRIDE_MIPI_MODE_Pos) 	/*!< 0x00000004 */
#define 	TOP_CHICKEN_OVERRIDE_MIPI_MODE 	TOP_CHICKEN_OVERRIDE_MIPI_MODE_Msk
#define 	TOP_CHICKEN_OVERRIDE_HISTO_MODE_EN_Pos 	(0x3U)
#define 	TOP_CHICKEN_OVERRIDE_HISTO_MODE_EN_Msk 	(0x1UL << TOP_CHICKEN_OVERRIDE_HISTO_MODE_EN_Pos) 	/*!< 0x00000008 */
#define 	TOP_CHICKEN_OVERRIDE_HISTO_MODE_EN 	TOP_CHICKEN_OVERRIDE_HISTO_MODE_EN_Msk
#define 	TOP_CHICKEN_OVERRIDE_HISTO_MODE_Pos 	(0x4U)
#define 	TOP_CHICKEN_OVERRIDE_HISTO_MODE_Msk 	(0x1UL << TOP_CHICKEN_OVERRIDE_HISTO_MODE_Pos) 	/*!< 0x00000010 */
#define 	TOP_CHICKEN_OVERRIDE_HISTO_MODE 	TOP_CHICKEN_OVERRIDE_HISTO_MODE_Msk
#define 	TOP_CHICKEN_I2C_TIMEOUT_EN_Pos 	(0x5U)
#define 	TOP_CHICKEN_I2C_TIMEOUT_EN_Msk 	(0x1UL << TOP_CHICKEN_I2C_TIMEOUT_EN_Pos) 	/*!< 0x00000020 */
#define 	TOP_CHICKEN_I2C_TIMEOUT_EN 	TOP_CHICKEN_I2C_TIMEOUT_EN_Msk
#define 	TOP_CHICKEN_STANDBY_Pos 	(0x6U)
#define 	TOP_CHICKEN_STANDBY_Msk 	(0x1UL << TOP_CHICKEN_STANDBY_Pos) 	/*!< 0x00000040 */
#define 	TOP_CHICKEN_STANDBY 	TOP_CHICKEN_STANDBY_Msk
#define 	TOP_CHICKEN_I2C_TIMEOUT_Pos 	(0x10U)
#define 	TOP_CHICKEN_I2C_TIMEOUT_Msk 	(0xFFFFUL << TOP_CHICKEN_I2C_TIMEOUT_Pos) 	/*!< 0xFFFF0000 */
#define 	TOP_CHICKEN_I2C_TIMEOUT 	TOP_CHICKEN_I2C_TIMEOUT_Msk
#define SPARE_CTRL1 	(0x00000068UL) 	/*<! Spare output signals for analog core with tie high. */
#define ADC_STATUS2 	(0x0000006CUL) 	/*<! ADC comparator offset dac */
#define 	ADC_STATUS2_CMP_OFFSET_DAC_DYN_Pos 	(0x0U)
#define 	ADC_STATUS2_CMP_OFFSET_DAC_DYN_Msk 	(0xFFUL << ADC_STATUS2_CMP_OFFSET_DAC_DYN_Pos) 	/*!< 0x000000FF */
#define 	ADC_STATUS2_CMP_OFFSET_DAC_DYN 	ADC_STATUS2_CMP_OFFSET_DAC_DYN_Msk
#define 	ADC_STATUS2_CMP_CAL_DONE_DYN_Pos 	(0x8U)
#define 	ADC_STATUS2_CMP_CAL_DONE_DYN_Msk 	(0x1UL << ADC_STATUS2_CMP_CAL_DONE_DYN_Pos) 	/*!< 0x00000100 */
#define 	ADC_STATUS2_CMP_CAL_DONE_DYN 	ADC_STATUS2_CMP_CAL_DONE_DYN_Msk
#define CP_CTRL 	(0x00000070UL) 	/*<! Charge pump control */
#define 	CP_CTRL_EN_Pos 	(0x0U)
#define 	CP_CTRL_EN_Msk 	(0x1UL << CP_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	CP_CTRL_EN 	CP_CTRL_EN_Msk
#define 	CP_CTRL_CLK_EN_Pos 	(0x1U)
#define 	CP_CTRL_CLK_EN_Msk 	(0x1UL << CP_CTRL_CLK_EN_Pos) 	/*!< 0x00000002 */
#define 	CP_CTRL_CLK_EN 	CP_CTRL_CLK_EN_Msk
#define 	CP_CTRL_CFLY_Pos 	(0x2U)
#define 	CP_CTRL_CFLY_Msk 	(0x3UL << CP_CTRL_CFLY_Pos) 	/*!< 0x0000000C */
#define 	CP_CTRL_CFLY 	CP_CTRL_CFLY_Msk
#define 	CP_CTRL_MPHASE_Pos 	(0x4U)
#define 	CP_CTRL_MPHASE_Msk 	(0x1UL << CP_CTRL_MPHASE_Pos) 	/*!< 0x00000010 */
#define 	CP_CTRL_MPHASE 	CP_CTRL_MPHASE_Msk
#define 	CP_CTRL_ADJ_Pos 	(0x5U)
#define 	CP_CTRL_ADJ_Msk 	(0x3FUL << CP_CTRL_ADJ_Pos) 	/*!< 0x000007E0 */
#define 	CP_CTRL_ADJ 	CP_CTRL_ADJ_Msk
#define 	CP_CTRL_CMP_CTL_Pos 	(0xCU)
#define 	CP_CTRL_CMP_CTL_Msk 	(0x7UL << CP_CTRL_CMP_CTL_Pos) 	/*!< 0x00007000 */
#define 	CP_CTRL_CMP_CTL 	CP_CTRL_CMP_CTL_Msk
#define 	CP_CTRL_CLK_DIVIDER_Pos 	(0xFU)
#define 	CP_CTRL_CLK_DIVIDER_Msk 	(0x1FUL << CP_CTRL_CLK_DIVIDER_Pos) 	/*!< 0x000F8000 */
#define 	CP_CTRL_CLK_DIVIDER 	CP_CTRL_CLK_DIVIDER_Msk
#define 	CP_CTRL_HIZ_Pos 	(0x14U)
#define 	CP_CTRL_HIZ_Msk 	(0x1UL << CP_CTRL_HIZ_Pos) 	/*!< 0x00100000 */
#define 	CP_CTRL_HIZ 	CP_CTRL_HIZ_Msk
#define IPH_MIRR_CTRL 	(0x00000074UL) 	/*<! Iphoto Mirror Control. Used to provide currents to LIFO and GCD */
#define 	IPH_MIRR_CTRL_EN_Pos 	(0x0U)
#define 	IPH_MIRR_CTRL_EN_Msk 	(0x1UL << IPH_MIRR_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	IPH_MIRR_CTRL_EN 	IPH_MIRR_CTRL_EN_Msk
#define 	IPH_MIRR_CTRL_TBUS_IN_EN_Pos 	(0x1U)
#define 	IPH_MIRR_CTRL_TBUS_IN_EN_Msk 	(0x1UL << IPH_MIRR_CTRL_TBUS_IN_EN_Pos) 	/*!< 0x00000002 */
#define 	IPH_MIRR_CTRL_TBUS_IN_EN 	IPH_MIRR_CTRL_TBUS_IN_EN_Msk
#define 	IPH_MIRR_CTRL_CALIB_EN_Pos 	(0x2U)
#define 	IPH_MIRR_CTRL_CALIB_EN_Msk 	(0x1UL << IPH_MIRR_CTRL_CALIB_EN_Pos) 	/*!< 0x00000004 */
#define 	IPH_MIRR_CTRL_CALIB_EN 	IPH_MIRR_CTRL_CALIB_EN_Msk
#define 	IPH_MIRR_CTRL_CALIB_X10_EN_Pos 	(0x3U)
#define 	IPH_MIRR_CTRL_CALIB_X10_EN_Msk 	(0x1UL << IPH_MIRR_CTRL_CALIB_X10_EN_Pos) 	/*!< 0x00000008 */
#define 	IPH_MIRR_CTRL_CALIB_X10_EN 	IPH_MIRR_CTRL_CALIB_X10_EN_Msk
#define 	IPH_MIRR_CTRL_DFT_EN_Pos 	(0x4U)
#define 	IPH_MIRR_CTRL_DFT_EN_Msk 	(0x1UL << IPH_MIRR_CTRL_DFT_EN_Pos) 	/*!< 0x00000010 */
#define 	IPH_MIRR_CTRL_DFT_EN 	IPH_MIRR_CTRL_DFT_EN_Msk
#define 	IPH_MIRR_CTRL_DFT_SEL_Pos 	(0x5U)
#define 	IPH_MIRR_CTRL_DFT_SEL_Msk 	(0xFUL << IPH_MIRR_CTRL_DFT_SEL_Pos) 	/*!< 0x000001E0 */
#define 	IPH_MIRR_CTRL_DFT_SEL 	IPH_MIRR_CTRL_DFT_SEL_Msk
#define GCD_CTRL 	(0x00000078UL) 	/*<! Global Contrast Detection Enable and Control Signals */
#define 	GCD_CTRL_EN_Pos 	(0x0U)
#define 	GCD_CTRL_EN_Msk 	(0x1UL << GCD_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	GCD_CTRL_EN 	GCD_CTRL_EN_Msk
#define 	GCD_CTRL_ULP_EN_Pos 	(0x1U)
#define 	GCD_CTRL_ULP_EN_Msk 	(0x1UL << GCD_CTRL_ULP_EN_Pos) 	/*!< 0x00000002 */
#define 	GCD_CTRL_ULP_EN 	GCD_CTRL_ULP_EN_Msk
#define 	GCD_CTRL_PR_EN_Pos 	(0x2U)
#define 	GCD_CTRL_PR_EN_Msk 	(0x1UL << GCD_CTRL_PR_EN_Pos) 	/*!< 0x00000004 */
#define 	GCD_CTRL_PR_EN 	GCD_CTRL_PR_EN_Msk
#define 	GCD_CTRL_PR_PWR_CTL_Pos 	(0x3U)
#define 	GCD_CTRL_PR_PWR_CTL_Msk 	(0x3UL << GCD_CTRL_PR_PWR_CTL_Pos) 	/*!< 0x00000018 */
#define 	GCD_CTRL_PR_PWR_CTL 	GCD_CTRL_PR_PWR_CTL_Msk
#define 	GCD_CTRL_FE_CPD_CTL_Pos 	(0x5U)
#define 	GCD_CTRL_FE_CPD_CTL_Msk 	(0x3UL << GCD_CTRL_FE_CPD_CTL_Pos) 	/*!< 0x00000060 */
#define 	GCD_CTRL_FE_CPD_CTL 	GCD_CTRL_FE_CPD_CTL_Msk
#define 	GCD_CTRL_FE_CPR_CTL_Pos 	(0x7U)
#define 	GCD_CTRL_FE_CPR_CTL_Msk 	(0x7UL << GCD_CTRL_FE_CPR_CTL_Pos) 	/*!< 0x00000380 */
#define 	GCD_CTRL_FE_CPR_CTL 	GCD_CTRL_FE_CPR_CTL_Msk
#define 	GCD_CTRL_LPF_EN_Pos 	(0xAU)
#define 	GCD_CTRL_LPF_EN_Msk 	(0x1UL << GCD_CTRL_LPF_EN_Pos) 	/*!< 0x00000400 */
#define 	GCD_CTRL_LPF_EN 	GCD_CTRL_LPF_EN_Msk
#define 	GCD_CTRL_LPF_PWR_CTL_Pos 	(0xBU)
#define 	GCD_CTRL_LPF_PWR_CTL_Msk 	(0x1UL << GCD_CTRL_LPF_PWR_CTL_Pos) 	/*!< 0x00000800 */
#define 	GCD_CTRL_LPF_PWR_CTL 	GCD_CTRL_LPF_PWR_CTL_Msk
#define 	GCD_CTRL_LPF_CCAP_CTL_Pos 	(0xCU)
#define 	GCD_CTRL_LPF_CCAP_CTL_Msk 	(0x3UL << GCD_CTRL_LPF_CCAP_CTL_Pos) 	/*!< 0x00003000 */
#define 	GCD_CTRL_LPF_CCAP_CTL 	GCD_CTRL_LPF_CCAP_CTL_Msk
#define 	GCD_CTRL_DIFFAMP_EN_Pos 	(0xEU)
#define 	GCD_CTRL_DIFFAMP_EN_Msk 	(0x1UL << GCD_CTRL_DIFFAMP_EN_Pos) 	/*!< 0x00004000 */
#define 	GCD_CTRL_DIFFAMP_EN 	GCD_CTRL_DIFFAMP_EN_Msk
#define 	GCD_CTRL_DIFFAMP_PWR_CTL_Pos 	(0xFU)
#define 	GCD_CTRL_DIFFAMP_PWR_CTL_Msk 	(0x1UL << GCD_CTRL_DIFFAMP_PWR_CTL_Pos) 	/*!< 0x00008000 */
#define 	GCD_CTRL_DIFFAMP_PWR_CTL 	GCD_CTRL_DIFFAMP_PWR_CTL_Msk
#define 	GCD_CTRL_GAIN_CTL_Pos 	(0x10U)
#define 	GCD_CTRL_GAIN_CTL_Msk 	(0x3UL << GCD_CTRL_GAIN_CTL_Pos) 	/*!< 0x00030000 */
#define 	GCD_CTRL_GAIN_CTL 	GCD_CTRL_GAIN_CTL_Msk
#define 	GCD_CTRL_CMP_EN_Pos 	(0x12U)
#define 	GCD_CTRL_CMP_EN_Msk 	(0x1UL << GCD_CTRL_CMP_EN_Pos) 	/*!< 0x00040000 */
#define 	GCD_CTRL_CMP_EN 	GCD_CTRL_CMP_EN_Msk
#define 	GCD_CTRL_CMP_PWR_CTL_Pos 	(0x13U)
#define 	GCD_CTRL_CMP_PWR_CTL_Msk 	(0x1UL << GCD_CTRL_CMP_PWR_CTL_Pos) 	/*!< 0x00080000 */
#define 	GCD_CTRL_CMP_PWR_CTL 	GCD_CTRL_CMP_PWR_CTL_Msk
#define 	GCD_CTRL_VDAC_BUF_EN_Pos 	(0x14U)
#define 	GCD_CTRL_VDAC_BUF_EN_Msk 	(0x1UL << GCD_CTRL_VDAC_BUF_EN_Pos) 	/*!< 0x00100000 */
#define 	GCD_CTRL_VDAC_BUF_EN 	GCD_CTRL_VDAC_BUF_EN_Msk
#define 	GCD_CTRL_VDAC_BUF_PWR_CTL_Pos 	(0x15U)
#define 	GCD_CTRL_VDAC_BUF_PWR_CTL_Msk 	(0x1UL << GCD_CTRL_VDAC_BUF_PWR_CTL_Pos) 	/*!< 0x00200000 */
#define 	GCD_CTRL_VDAC_BUF_PWR_CTL 	GCD_CTRL_VDAC_BUF_PWR_CTL_Msk
#define 	GCD_CTRL_TEST_EN_Pos 	(0x16U)
#define 	GCD_CTRL_TEST_EN_Msk 	(0x1UL << GCD_CTRL_TEST_EN_Pos) 	/*!< 0x00400000 */
#define 	GCD_CTRL_TEST_EN 	GCD_CTRL_TEST_EN_Msk
#define 	GCD_CTRL_TEST_SEL_Pos 	(0x17U)
#define 	GCD_CTRL_TEST_SEL_Msk 	(0xFUL << GCD_CTRL_TEST_SEL_Pos) 	/*!< 0x07800000 */
#define 	GCD_CTRL_TEST_SEL 	GCD_CTRL_TEST_SEL_Msk
#define 	GCD_CTRL_STARTUP_RSTN_DFT_EN_Pos 	(0x1BU)
#define 	GCD_CTRL_STARTUP_RSTN_DFT_EN_Msk 	(0x1UL << GCD_CTRL_STARTUP_RSTN_DFT_EN_Pos) 	/*!< 0x08000000 */
#define 	GCD_CTRL_STARTUP_RSTN_DFT_EN 	GCD_CTRL_STARTUP_RSTN_DFT_EN_Msk
#define 	GCD_CTRL_RSTN_DFT_IN_Pos 	(0x1CU)
#define 	GCD_CTRL_RSTN_DFT_IN_Msk 	(0x1UL << GCD_CTRL_RSTN_DFT_IN_Pos) 	/*!< 0x10000000 */
#define 	GCD_CTRL_RSTN_DFT_IN 	GCD_CTRL_RSTN_DFT_IN_Msk
#define GCD_CTRL2 	(0x0000007CUL) 	/*<! Global Contrast Detection Control Signals */
#define 	GCD_CTRL2_HPF_CTL_Pos 	(0x0U)
#define 	GCD_CTRL2_HPF_CTL_Msk 	(0x7UL << GCD_CTRL2_HPF_CTL_Pos) 	/*!< 0x00000007 */
#define 	GCD_CTRL2_HPF_CTL 	GCD_CTRL2_HPF_CTL_Msk
#define 	GCD_CTRL2_DIFF_REF_CTL_Pos 	(0x3U)
#define 	GCD_CTRL2_DIFF_REF_CTL_Msk 	(0x7UL << GCD_CTRL2_DIFF_REF_CTL_Pos) 	/*!< 0x00000038 */
#define 	GCD_CTRL2_DIFF_REF_CTL 	GCD_CTRL2_DIFF_REF_CTL_Msk
#define 	GCD_CTRL2_NEG_REF_CTL_Pos 	(0x6U)
#define 	GCD_CTRL2_NEG_REF_CTL_Msk 	(0x7UL << GCD_CTRL2_NEG_REF_CTL_Pos) 	/*!< 0x000001C0 */
#define 	GCD_CTRL2_NEG_REF_CTL 	GCD_CTRL2_NEG_REF_CTL_Msk
#define 	GCD_CTRL2_POS_REF_CTL_Pos 	(0x9U)
#define 	GCD_CTRL2_POS_REF_CTL_Msk 	(0x7UL << GCD_CTRL2_POS_REF_CTL_Pos) 	/*!< 0x00000E00 */
#define 	GCD_CTRL2_POS_REF_CTL 	GCD_CTRL2_POS_REF_CTL_Msk
#define GCD_REFR_CTRL 	(0x00000080UL) 	/*<! Global Contrast Detection Refractory Duration */
#define 	GCD_REFR_CTRL_DUR_Pos 	(0x0U)
#define 	GCD_REFR_CTRL_DUR_Msk 	(0xFFFFFFFFUL << GCD_REFR_CTRL_DUR_Pos) 	/*!< 0xFFFFFFFF */
#define 	GCD_REFR_CTRL_DUR 	GCD_REFR_CTRL_DUR_Msk
#define ESP_STATUS 	(0x00000084UL) 	/*<! ESp status */
#define 	ESP_STATUS_RO_EMPTY_Pos 	(0x0U)
#define 	ESP_STATUS_RO_EMPTY_Msk 	(0x1UL << ESP_STATUS_RO_EMPTY_Pos) 	/*!< 0x00000001 */
#define 	ESP_STATUS_RO_EMPTY 	ESP_STATUS_RO_EMPTY_Msk
#define 	ESP_STATUS_RO_BUSY_Pos 	(0x1U)
#define 	ESP_STATUS_RO_BUSY_Msk 	(0x1UL << ESP_STATUS_RO_BUSY_Pos) 	/*!< 0x00000002 */
#define 	ESP_STATUS_RO_BUSY 	ESP_STATUS_RO_BUSY_Msk
#define 	ESP_STATUS_RO_DEEP_LOW_POWER_SEEN_Pos 	(0x2U)
#define 	ESP_STATUS_RO_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ESP_STATUS_RO_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00000004 */
#define 	ESP_STATUS_RO_DEEP_LOW_POWER_SEEN 	ESP_STATUS_RO_DEEP_LOW_POWER_SEEN_Msk
#define 	ESP_STATUS_NFL_EMPTY_Pos 	(0x3U)
#define 	ESP_STATUS_NFL_EMPTY_Msk 	(0x1UL << ESP_STATUS_NFL_EMPTY_Pos) 	/*!< 0x00000008 */
#define 	ESP_STATUS_NFL_EMPTY 	ESP_STATUS_NFL_EMPTY_Msk
#define 	ESP_STATUS_NFL_BUSY_Pos 	(0x4U)
#define 	ESP_STATUS_NFL_BUSY_Msk 	(0x1UL << ESP_STATUS_NFL_BUSY_Pos) 	/*!< 0x00000010 */
#define 	ESP_STATUS_NFL_BUSY 	ESP_STATUS_NFL_BUSY_Msk
#define 	ESP_STATUS_NFL_DEEP_LOW_POWER_SEEN_Pos 	(0x5U)
#define 	ESP_STATUS_NFL_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ESP_STATUS_NFL_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00000020 */
#define 	ESP_STATUS_NFL_DEEP_LOW_POWER_SEEN 	ESP_STATUS_NFL_DEEP_LOW_POWER_SEEN_Msk
#define 	ESP_STATUS_AFK_EMPTY_Pos 	(0x6U)
#define 	ESP_STATUS_AFK_EMPTY_Msk 	(0x1UL << ESP_STATUS_AFK_EMPTY_Pos) 	/*!< 0x00000040 */
#define 	ESP_STATUS_AFK_EMPTY 	ESP_STATUS_AFK_EMPTY_Msk
#define 	ESP_STATUS_AFK_BUSY_Pos 	(0x7U)
#define 	ESP_STATUS_AFK_BUSY_Msk 	(0x1UL << ESP_STATUS_AFK_BUSY_Pos) 	/*!< 0x00000080 */
#define 	ESP_STATUS_AFK_BUSY 	ESP_STATUS_AFK_BUSY_Msk
#define 	ESP_STATUS_AFK_DEEP_LOW_POWER_SEEN_Pos 	(0x8U)
#define 	ESP_STATUS_AFK_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ESP_STATUS_AFK_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00000100 */
#define 	ESP_STATUS_AFK_DEEP_LOW_POWER_SEEN 	ESP_STATUS_AFK_DEEP_LOW_POWER_SEEN_Msk
#define 	ESP_STATUS_EHC_EMPTY_Pos 	(0x9U)
#define 	ESP_STATUS_EHC_EMPTY_Msk 	(0x1UL << ESP_STATUS_EHC_EMPTY_Pos) 	/*!< 0x00000200 */
#define 	ESP_STATUS_EHC_EMPTY 	ESP_STATUS_EHC_EMPTY_Msk
#define 	ESP_STATUS_EHC_BUSY_Pos 	(0xAU)
#define 	ESP_STATUS_EHC_BUSY_Msk 	(0x1UL << ESP_STATUS_EHC_BUSY_Pos) 	/*!< 0x00000400 */
#define 	ESP_STATUS_EHC_BUSY 	ESP_STATUS_EHC_BUSY_Msk
#define 	ESP_STATUS_EHC_DEEP_LOW_POWER_SEEN_Pos 	(0xBU)
#define 	ESP_STATUS_EHC_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ESP_STATUS_EHC_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00000800 */
#define 	ESP_STATUS_EHC_DEEP_LOW_POWER_SEEN 	ESP_STATUS_EHC_DEEP_LOW_POWER_SEEN_Msk
#define 	ESP_STATUS_STC_EMPTY_Pos 	(0xCU)
#define 	ESP_STATUS_STC_EMPTY_Msk 	(0x1UL << ESP_STATUS_STC_EMPTY_Pos) 	/*!< 0x00001000 */
#define 	ESP_STATUS_STC_EMPTY 	ESP_STATUS_STC_EMPTY_Msk
#define 	ESP_STATUS_STC_BUSY_Pos 	(0xDU)
#define 	ESP_STATUS_STC_BUSY_Msk 	(0x1UL << ESP_STATUS_STC_BUSY_Pos) 	/*!< 0x00002000 */
#define 	ESP_STATUS_STC_BUSY 	ESP_STATUS_STC_BUSY_Msk
#define 	ESP_STATUS_STC_DEEP_LOW_POWER_SEEN_Pos 	(0xEU)
#define 	ESP_STATUS_STC_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ESP_STATUS_STC_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00004000 */
#define 	ESP_STATUS_STC_DEEP_LOW_POWER_SEEN 	ESP_STATUS_STC_DEEP_LOW_POWER_SEEN_Msk
#define 	ESP_STATUS_ERC_EMPTY_Pos 	(0xFU)
#define 	ESP_STATUS_ERC_EMPTY_Msk 	(0x1UL << ESP_STATUS_ERC_EMPTY_Pos) 	/*!< 0x00008000 */
#define 	ESP_STATUS_ERC_EMPTY 	ESP_STATUS_ERC_EMPTY_Msk
#define 	ESP_STATUS_ERC_BUSY_Pos 	(0x10U)
#define 	ESP_STATUS_ERC_BUSY_Msk 	(0x1UL << ESP_STATUS_ERC_BUSY_Pos) 	/*!< 0x00010000 */
#define 	ESP_STATUS_ERC_BUSY 	ESP_STATUS_ERC_BUSY_Msk
#define 	ESP_STATUS_ERC_DEEP_LOW_POWER_SEEN_Pos 	(0x11U)
#define 	ESP_STATUS_ERC_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ESP_STATUS_ERC_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00020000 */
#define 	ESP_STATUS_ERC_DEEP_LOW_POWER_SEEN 	ESP_STATUS_ERC_DEEP_LOW_POWER_SEEN_Msk
#define 	ESP_STATUS_EDF_EMPTY_Pos 	(0x12U)
#define 	ESP_STATUS_EDF_EMPTY_Msk 	(0x1UL << ESP_STATUS_EDF_EMPTY_Pos) 	/*!< 0x00040000 */
#define 	ESP_STATUS_EDF_EMPTY 	ESP_STATUS_EDF_EMPTY_Msk
#define 	ESP_STATUS_EDF_BUSY_Pos 	(0x13U)
#define 	ESP_STATUS_EDF_BUSY_Msk 	(0x1UL << ESP_STATUS_EDF_BUSY_Pos) 	/*!< 0x00080000 */
#define 	ESP_STATUS_EDF_BUSY 	ESP_STATUS_EDF_BUSY_Msk
#define 	ESP_STATUS_EDF_DEEP_LOW_POWER_SEEN_Pos 	(0x14U)
#define 	ESP_STATUS_EDF_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ESP_STATUS_EDF_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00100000 */
#define 	ESP_STATUS_EDF_DEEP_LOW_POWER_SEEN 	ESP_STATUS_EDF_DEEP_LOW_POWER_SEEN_Msk
#define 	ESP_STATUS_CPI_EMPTY_Pos 	(0x15U)
#define 	ESP_STATUS_CPI_EMPTY_Msk 	(0x1UL << ESP_STATUS_CPI_EMPTY_Pos) 	/*!< 0x00200000 */
#define 	ESP_STATUS_CPI_EMPTY 	ESP_STATUS_CPI_EMPTY_Msk
#define 	ESP_STATUS_CPI_BUSY_Pos 	(0x16U)
#define 	ESP_STATUS_CPI_BUSY_Msk 	(0x1UL << ESP_STATUS_CPI_BUSY_Pos) 	/*!< 0x00400000 */
#define 	ESP_STATUS_CPI_BUSY 	ESP_STATUS_CPI_BUSY_Msk
#define 	ESP_STATUS_MIPI_EMPTY_Pos 	(0x18U)
#define 	ESP_STATUS_MIPI_EMPTY_Msk 	(0x1UL << ESP_STATUS_MIPI_EMPTY_Pos) 	/*!< 0x01000000 */
#define 	ESP_STATUS_MIPI_EMPTY 	ESP_STATUS_MIPI_EMPTY_Msk
#define 	ESP_STATUS_MIPI_BUSY_Pos 	(0x19U)
#define 	ESP_STATUS_MIPI_BUSY_Msk 	(0x1UL << ESP_STATUS_MIPI_BUSY_Pos) 	/*!< 0x02000000 */
#define 	ESP_STATUS_MIPI_BUSY 	ESP_STATUS_MIPI_BUSY_Msk
#define QMON_CTRL 	(0x00000088UL) 	/*<! REQY Queue Monitor Control */
#define 	QMON_CTRL_EN_Pos 	(0x0U)
#define 	QMON_CTRL_EN_Msk 	(0x1UL << QMON_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	QMON_CTRL_EN 	QMON_CTRL_EN_Msk
#define 	QMON_CTRL_RSTN_Pos 	(0x1U)
#define 	QMON_CTRL_RSTN_Msk 	(0x1UL << QMON_CTRL_RSTN_Pos) 	/*!< 0x00000002 */
#define 	QMON_CTRL_RSTN 	QMON_CTRL_RSTN_Msk
#define 	QMON_CTRL_DFT_EN_Pos 	(0x2U)
#define 	QMON_CTRL_DFT_EN_Msk 	(0x1UL << QMON_CTRL_DFT_EN_Pos) 	/*!< 0x00000004 */
#define 	QMON_CTRL_DFT_EN 	QMON_CTRL_DFT_EN_Msk
#define 	QMON_CTRL_LATCH_INPUT_Pos 	(0x3U)
#define 	QMON_CTRL_LATCH_INPUT_Msk 	(0x1UL << QMON_CTRL_LATCH_INPUT_Pos) 	/*!< 0x00000008 */
#define 	QMON_CTRL_LATCH_INPUT 	QMON_CTRL_LATCH_INPUT_Msk
#define 	QMON_CTRL_INTERRUPT_EN_Pos 	(0x4U)
#define 	QMON_CTRL_INTERRUPT_EN_Msk 	(0x1UL << QMON_CTRL_INTERRUPT_EN_Pos) 	/*!< 0x00000010 */
#define 	QMON_CTRL_INTERRUPT_EN 	QMON_CTRL_INTERRUPT_EN_Msk
#define 	QMON_CTRL_CLK_PRESCALE_Pos 	(0x5U)
#define 	QMON_CTRL_CLK_PRESCALE_Msk 	(0xFUL << QMON_CTRL_CLK_PRESCALE_Pos) 	/*!< 0x000001E0 */
#define 	QMON_CTRL_CLK_PRESCALE 	QMON_CTRL_CLK_PRESCALE_Msk
#define 	QMON_CTRL_TRIP_CTL_Pos 	(0xAU)
#define 	QMON_CTRL_TRIP_CTL_Msk 	(0x1FFUL << QMON_CTRL_TRIP_CTL_Pos) 	/*!< 0x0007FC00 */
#define 	QMON_CTRL_TRIP_CTL 	QMON_CTRL_TRIP_CTL_Msk
#define QMON_STATUS 	(0x0000008CUL) 	/*<! REQY Queue Monitor Status */
#define 	QMON_STATUS_SUM_Pos 	(0x0U)
#define 	QMON_STATUS_SUM_Msk 	(0x3FFUL << QMON_STATUS_SUM_Pos) 	/*!< 0x000003FF */
#define 	QMON_STATUS_SUM 	QMON_STATUS_SUM_Msk
#define 	QMON_STATUS_TRIP_Pos 	(0xAU)
#define 	QMON_STATUS_TRIP_Msk 	(0x1UL << QMON_STATUS_TRIP_Pos) 	/*!< 0x00000400 */
#define 	QMON_STATUS_TRIP 	QMON_STATUS_TRIP_Msk
#define 	QMON_STATUS_SUM_IRQ_Pos 	(0x10U)
#define 	QMON_STATUS_SUM_IRQ_Msk 	(0x3FFUL << QMON_STATUS_SUM_IRQ_Pos) 	/*!< 0x03FF0000 */
#define 	QMON_STATUS_SUM_IRQ 	QMON_STATUS_SUM_IRQ_Msk
#define 	QMON_STATUS_TRIP_IRQ_Pos 	(0x1AU)
#define 	QMON_STATUS_TRIP_IRQ_Msk 	(0x1UL << QMON_STATUS_TRIP_IRQ_Pos) 	/*!< 0x04000000 */
#define 	QMON_STATUS_TRIP_IRQ 	QMON_STATUS_TRIP_IRQ_Msk
#define GCD_SHADOW_CTRL 	(0x00000090UL) 	/*<! Global Contrast Detector Shadow control register */
#define 	GCD_SHADOW_CTRL_TIMER_EN_Pos 	(0x0U)
#define 	GCD_SHADOW_CTRL_TIMER_EN_Msk 	(0x1UL << GCD_SHADOW_CTRL_TIMER_EN_Pos) 	/*!< 0x00000001 */
#define 	GCD_SHADOW_CTRL_TIMER_EN 	GCD_SHADOW_CTRL_TIMER_EN_Msk
#define 	GCD_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos 	(0x1U)
#define 	GCD_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk 	(0x1UL << GCD_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos) 	/*!< 0x00000002 */
#define 	GCD_SHADOW_CTRL_IRQ_SW_OVERRIDE 	GCD_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk
#define 	GCD_SHADOW_CTRL_RESET_ON_COPY_Pos 	(0x2U)
#define 	GCD_SHADOW_CTRL_RESET_ON_COPY_Msk 	(0x1UL << GCD_SHADOW_CTRL_RESET_ON_COPY_Pos) 	/*!< 0x00000004 */
#define 	GCD_SHADOW_CTRL_RESET_ON_COPY 	GCD_SHADOW_CTRL_RESET_ON_COPY_Msk
#define GCD_SHADOW_STATUS 	(0x00000094UL) 	/*<! Global Contrast Detector Shadow status register */
#define 	GCD_SHADOW_STATUS_VALID_Pos 	(0x0U)
#define 	GCD_SHADOW_STATUS_VALID_Msk 	(0x1UL << GCD_SHADOW_STATUS_VALID_Pos) 	/*!< 0x00000001 */
#define 	GCD_SHADOW_STATUS_VALID 	GCD_SHADOW_STATUS_VALID_Msk
#define 	GCD_SHADOW_STATUS_OVERRUN_Pos 	(0x1U)
#define 	GCD_SHADOW_STATUS_OVERRUN_Msk 	(0x1UL << GCD_SHADOW_STATUS_OVERRUN_Pos) 	/*!< 0x00000002 */
#define 	GCD_SHADOW_STATUS_OVERRUN 	GCD_SHADOW_STATUS_OVERRUN_Msk
#define GCD_SHADOW_TIMER_CTRL 	(0x00000098UL) 	/*<! Global Contrast Detector Shadow timer control register */
