jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	GCD_SHADOW_TIMER_CTRL_THRESHOLD_Pos 	(0x0U)
#define 	GCD_SHADOW_TIMER_CTRL_THRESHOLD_Msk 	(0xFFFFFUL << GCD_SHADOW_TIMER_CTRL_THRESHOLD_Pos) 	/*!< 0x000FFFFF */
#define 	GCD_SHADOW_TIMER_CTRL_THRESHOLD 	GCD_SHADOW_TIMER_CTRL_THRESHOLD_Msk
#define WATCHDOG_CTRL 	(0x0000009CUL) 	/*<! Watchdog Control Register */
#define 	WATCHDOG_CTRL_ENABLE_Pos 	(0x0U)
#define 	WATCHDOG_CTRL_ENABLE_Msk 	(0x1UL << WATCHDOG_CTRL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	WATCHDOG_CTRL_ENABLE 	WATCHDOG_CTRL_ENABLE_Msk
#define 	WATCHDOG_CTRL_RESET_ENABLE_Pos 	(0x1U)
#define 	WATCHDOG_CTRL_RESET_ENABLE_Msk 	(0x1UL << WATCHDOG_CTRL_RESET_ENABLE_Pos) 	/*!< 0x00000002 */
#define 	WATCHDOG_CTRL_RESET_ENABLE 	WATCHDOG_CTRL_RESET_ENABLE_Msk
#define 	WATCHDOG_CTRL_IRQ_ENABLE_Pos 	(0x2U)
#define 	WATCHDOG_CTRL_IRQ_ENABLE_Msk 	(0x1UL << WATCHDOG_CTRL_IRQ_ENABLE_Pos) 	/*!< 0x00000004 */
#define 	WATCHDOG_CTRL_IRQ_ENABLE 	WATCHDOG_CTRL_IRQ_ENABLE_Msk
#define 	WATCHDOG_CTRL_FORCE_OVERFLOW_Pos 	(0x3U)
#define 	WATCHDOG_CTRL_FORCE_OVERFLOW_Msk 	(0x1UL << WATCHDOG_CTRL_FORCE_OVERFLOW_Pos) 	/*!< 0x00000008 */
#define 	WATCHDOG_CTRL_FORCE_OVERFLOW 	WATCHDOG_CTRL_FORCE_OVERFLOW_Msk
#define WATCHDOG_THRESHOLD 	(0x000000A0UL) 	/*<! Watchdog Threshold register */
#define 	WATCHDOG_THRESHOLD_VALUE_Pos 	(0x0U)
#define 	WATCHDOG_THRESHOLD_VALUE_Msk 	(0xFFFFFFFFUL << WATCHDOG_THRESHOLD_VALUE_Pos) 	/*!< 0xFFFFFFFF */
#define 	WATCHDOG_THRESHOLD_VALUE 	WATCHDOG_THRESHOLD_VALUE_Msk
#define WATCHDOG_RELOAD 	(0x000000A4UL) 	/*<! Watchdog reload register */
#define 	WATCHDOG_RELOAD_VALUE_Pos 	(0x0U)
#define 	WATCHDOG_RELOAD_VALUE_Msk 	(0xFFFFFFFFUL << WATCHDOG_RELOAD_VALUE_Pos) 	/*!< 0xFFFFFFFF */
#define 	WATCHDOG_RELOAD_VALUE 	WATCHDOG_RELOAD_VALUE_Msk
#define PX_SCAN_CTRL 	(0x000000A8UL) 	/*<! Pixel Scan CTRL */
#define 	PX_SCAN_CTRL_BOT_EN_Pos 	(0x0U)
#define 	PX_SCAN_CTRL_BOT_EN_Msk 	(0x1UL << PX_SCAN_CTRL_BOT_EN_Pos) 	/*!< 0x00000001 */
#define 	PX_SCAN_CTRL_BOT_EN 	PX_SCAN_CTRL_BOT_EN_Msk
#define 	PX_SCAN_CTRL_TOP_EN_Pos 	(0x1U)
#define 	PX_SCAN_CTRL_TOP_EN_Msk 	(0x1UL << PX_SCAN_CTRL_TOP_EN_Pos) 	/*!< 0x00000002 */
#define 	PX_SCAN_CTRL_TOP_EN 	PX_SCAN_CTRL_TOP_EN_Msk
#define 	PX_SCAN_CTRL_LEFT_EN_Pos 	(0x2U)
#define 	PX_SCAN_CTRL_LEFT_EN_Msk 	(0x1UL << PX_SCAN_CTRL_LEFT_EN_Pos) 	/*!< 0x00000004 */
#define 	PX_SCAN_CTRL_LEFT_EN 	PX_SCAN_CTRL_LEFT_EN_Msk
#define 	PX_SCAN_CTRL_RIGHT_EN_Pos 	(0x3U)
#define 	PX_SCAN_CTRL_RIGHT_EN_Msk 	(0x1UL << PX_SCAN_CTRL_RIGHT_EN_Pos) 	/*!< 0x00000008 */
#define 	PX_SCAN_CTRL_RIGHT_EN 	PX_SCAN_CTRL_RIGHT_EN_Msk
#define 	PX_SCAN_CTRL_BOT_TRIG_FIRST_Pos 	(0x4U)
#define 	PX_SCAN_CTRL_BOT_TRIG_FIRST_Msk 	(0x1UL << PX_SCAN_CTRL_BOT_TRIG_FIRST_Pos) 	/*!< 0x00000010 */
#define 	PX_SCAN_CTRL_BOT_TRIG_FIRST 	PX_SCAN_CTRL_BOT_TRIG_FIRST_Msk
#define 	PX_SCAN_CTRL_TOP_TRIG_FIRST_Pos 	(0x5U)
#define 	PX_SCAN_CTRL_TOP_TRIG_FIRST_Msk 	(0x1UL << PX_SCAN_CTRL_TOP_TRIG_FIRST_Pos) 	/*!< 0x00000020 */
#define 	PX_SCAN_CTRL_TOP_TRIG_FIRST 	PX_SCAN_CTRL_TOP_TRIG_FIRST_Msk
#define 	PX_SCAN_CTRL_LEFT_TRIG_FIRST_Pos 	(0x6U)
#define 	PX_SCAN_CTRL_LEFT_TRIG_FIRST_Msk 	(0x1UL << PX_SCAN_CTRL_LEFT_TRIG_FIRST_Pos) 	/*!< 0x00000040 */
#define 	PX_SCAN_CTRL_LEFT_TRIG_FIRST 	PX_SCAN_CTRL_LEFT_TRIG_FIRST_Msk
#define 	PX_SCAN_CTRL_RIGHT_TRIG_FIRST_Pos 	(0x7U)
#define 	PX_SCAN_CTRL_RIGHT_TRIG_FIRST_Msk 	(0x1UL << PX_SCAN_CTRL_RIGHT_TRIG_FIRST_Pos) 	/*!< 0x00000080 */
#define 	PX_SCAN_CTRL_RIGHT_TRIG_FIRST 	PX_SCAN_CTRL_RIGHT_TRIG_FIRST_Msk
#define 	PX_SCAN_CTRL_POL_SEL_Pos 	(0x8U)
#define 	PX_SCAN_CTRL_POL_SEL_Msk 	(0x1UL << PX_SCAN_CTRL_POL_SEL_Pos) 	/*!< 0x00000100 */
#define 	PX_SCAN_CTRL_POL_SEL 	PX_SCAN_CTRL_POL_SEL_Msk
#define 	PX_SCAN_CTRL_BOT_TRIG_LAST_IRQ_EN_Pos 	(0x9U)
#define 	PX_SCAN_CTRL_BOT_TRIG_LAST_IRQ_EN_Msk 	(0x1UL << PX_SCAN_CTRL_BOT_TRIG_LAST_IRQ_EN_Pos) 	/*!< 0x00000200 */
#define 	PX_SCAN_CTRL_BOT_TRIG_LAST_IRQ_EN 	PX_SCAN_CTRL_BOT_TRIG_LAST_IRQ_EN_Msk
#define 	PX_SCAN_CTRL_TOP_TRIG_LAST_IRQ_EN_Pos 	(0xAU)
#define 	PX_SCAN_CTRL_TOP_TRIG_LAST_IRQ_EN_Msk 	(0x1UL << PX_SCAN_CTRL_TOP_TRIG_LAST_IRQ_EN_Pos) 	/*!< 0x00000400 */
#define 	PX_SCAN_CTRL_TOP_TRIG_LAST_IRQ_EN 	PX_SCAN_CTRL_TOP_TRIG_LAST_IRQ_EN_Msk
#define 	PX_SCAN_CTRL_LEFT_TRIG_LAST_IRQ_EN_Pos 	(0xBU)
#define 	PX_SCAN_CTRL_LEFT_TRIG_LAST_IRQ_EN_Msk 	(0x1UL << PX_SCAN_CTRL_LEFT_TRIG_LAST_IRQ_EN_Pos) 	/*!< 0x00000800 */
#define 	PX_SCAN_CTRL_LEFT_TRIG_LAST_IRQ_EN 	PX_SCAN_CTRL_LEFT_TRIG_LAST_IRQ_EN_Msk
#define 	PX_SCAN_CTRL_RIGHT_TRIG_LAST_IRQ_EN_Pos 	(0xCU)
#define 	PX_SCAN_CTRL_RIGHT_TRIG_LAST_IRQ_EN_Msk 	(0x1UL << PX_SCAN_CTRL_RIGHT_TRIG_LAST_IRQ_EN_Pos) 	/*!< 0x00001000 */
#define 	PX_SCAN_CTRL_RIGHT_TRIG_LAST_IRQ_EN 	PX_SCAN_CTRL_RIGHT_TRIG_LAST_IRQ_EN_Msk
#define 	PX_SCAN_CTRL_TIMER_PRESCALE_Pos 	(0x10U)
#define 	PX_SCAN_CTRL_TIMER_PRESCALE_Msk 	(0x7UL << PX_SCAN_CTRL_TIMER_PRESCALE_Pos) 	/*!< 0x00070000 */
#define 	PX_SCAN_CTRL_TIMER_PRESCALE 	PX_SCAN_CTRL_TIMER_PRESCALE_Msk
#define PX_SCAN_STATUS 	(0x000000ACUL) 	/*<! Pixel Scan STATUS */
#define 	PX_SCAN_STATUS_BOT_TRIG_LAST_Pos 	(0x0U)
#define 	PX_SCAN_STATUS_BOT_TRIG_LAST_Msk 	(0x1UL << PX_SCAN_STATUS_BOT_TRIG_LAST_Pos) 	/*!< 0x00000001 */
#define 	PX_SCAN_STATUS_BOT_TRIG_LAST 	PX_SCAN_STATUS_BOT_TRIG_LAST_Msk
#define 	PX_SCAN_STATUS_TOP_TRIG_LAST_Pos 	(0x1U)
#define 	PX_SCAN_STATUS_TOP_TRIG_LAST_Msk 	(0x1UL << PX_SCAN_STATUS_TOP_TRIG_LAST_Pos) 	/*!< 0x00000002 */
#define 	PX_SCAN_STATUS_TOP_TRIG_LAST 	PX_SCAN_STATUS_TOP_TRIG_LAST_Msk
#define 	PX_SCAN_STATUS_LEFT_TRIG_LAST_Pos 	(0x2U)
#define 	PX_SCAN_STATUS_LEFT_TRIG_LAST_Msk 	(0x1UL << PX_SCAN_STATUS_LEFT_TRIG_LAST_Pos) 	/*!< 0x00000004 */
#define 	PX_SCAN_STATUS_LEFT_TRIG_LAST 	PX_SCAN_STATUS_LEFT_TRIG_LAST_Msk
#define 	PX_SCAN_STATUS_RIGHT_TRIG_LAST_Pos 	(0x3U)
#define 	PX_SCAN_STATUS_RIGHT_TRIG_LAST_Msk 	(0x1UL << PX_SCAN_STATUS_RIGHT_TRIG_LAST_Pos) 	/*!< 0x00000008 */
#define 	PX_SCAN_STATUS_RIGHT_TRIG_LAST 	PX_SCAN_STATUS_RIGHT_TRIG_LAST_Msk
#define 	PX_SCAN_STATUS_BOT_TIMER_VALID_Pos 	(0x4U)
#define 	PX_SCAN_STATUS_BOT_TIMER_VALID_Msk 	(0x1UL << PX_SCAN_STATUS_BOT_TIMER_VALID_Pos) 	/*!< 0x00000010 */
#define 	PX_SCAN_STATUS_BOT_TIMER_VALID 	PX_SCAN_STATUS_BOT_TIMER_VALID_Msk
#define 	PX_SCAN_STATUS_TOP_TIMER_VALID_Pos 	(0x5U)
#define 	PX_SCAN_STATUS_TOP_TIMER_VALID_Msk 	(0x1UL << PX_SCAN_STATUS_TOP_TIMER_VALID_Pos) 	/*!< 0x00000020 */
#define 	PX_SCAN_STATUS_TOP_TIMER_VALID 	PX_SCAN_STATUS_TOP_TIMER_VALID_Msk
#define 	PX_SCAN_STATUS_LEFT_TIMER_VALID_Pos 	(0x6U)
#define 	PX_SCAN_STATUS_LEFT_TIMER_VALID_Msk 	(0x1UL << PX_SCAN_STATUS_LEFT_TIMER_VALID_Pos) 	/*!< 0x00000040 */
#define 	PX_SCAN_STATUS_LEFT_TIMER_VALID 	PX_SCAN_STATUS_LEFT_TIMER_VALID_Msk
#define 	PX_SCAN_STATUS_RIGHT_TIMER_VALID_Pos 	(0x7U)
#define 	PX_SCAN_STATUS_RIGHT_TIMER_VALID_Msk 	(0x1UL << PX_SCAN_STATUS_RIGHT_TIMER_VALID_Pos) 	/*!< 0x00000080 */
#define 	PX_SCAN_STATUS_RIGHT_TIMER_VALID 	PX_SCAN_STATUS_RIGHT_TIMER_VALID_Msk
#define SRAM_INITN 	(0x000000B8UL) 	/*<! initialize the memory state machine */
#define 	SRAM_INITN_AFK_Pos 	(0x0U)
#define 	SRAM_INITN_AFK_Msk 	(0x1UL << SRAM_INITN_AFK_Pos) 	/*!< 0x00000001 */
#define 	SRAM_INITN_AFK 	SRAM_INITN_AFK_Msk
#define 	SRAM_INITN_EHC_STC_Pos 	(0x1U)
#define 	SRAM_INITN_EHC_STC_Msk 	(0x1UL << SRAM_INITN_EHC_STC_Pos) 	/*!< 0x00000002 */
#define 	SRAM_INITN_EHC_STC 	SRAM_INITN_EHC_STC_Msk
#define 	SRAM_INITN_ERC_DL_Pos 	(0x2U)
#define 	SRAM_INITN_ERC_DL_Msk 	(0x1UL << SRAM_INITN_ERC_DL_Pos) 	/*!< 0x00000004 */
#define 	SRAM_INITN_ERC_DL 	SRAM_INITN_ERC_DL_Msk
#define 	SRAM_INITN_ERC_ILG_Pos 	(0x3U)
#define 	SRAM_INITN_ERC_ILG_Msk 	(0x1UL << SRAM_INITN_ERC_ILG_Pos) 	/*!< 0x00000008 */
#define 	SRAM_INITN_ERC_ILG 	SRAM_INITN_ERC_ILG_Msk
#define 	SRAM_INITN_ERC_TDROP_Pos 	(0x4U)
#define 	SRAM_INITN_ERC_TDROP_Msk 	(0x1UL << SRAM_INITN_ERC_TDROP_Pos) 	/*!< 0x00000010 */
#define 	SRAM_INITN_ERC_TDROP 	SRAM_INITN_ERC_TDROP_Msk
#define 	SRAM_INITN_MIPI_Pos 	(0x5U)
#define 	SRAM_INITN_MIPI_Msk 	(0x1UL << SRAM_INITN_MIPI_Pos) 	/*!< 0x00000020 */
#define 	SRAM_INITN_MIPI 	SRAM_INITN_MIPI_Msk
#define 	SRAM_INITN_CPI_Pos 	(0x6U)
#define 	SRAM_INITN_CPI_Msk 	(0x1UL << SRAM_INITN_CPI_Pos) 	/*!< 0x00000040 */
#define 	SRAM_INITN_CPI 	SRAM_INITN_CPI_Msk
#define 	SRAM_INITN_IMEM_Pos 	(0x7U)
#define 	SRAM_INITN_IMEM_Msk 	(0x1UL << SRAM_INITN_IMEM_Pos) 	/*!< 0x00000080 */
#define 	SRAM_INITN_IMEM 	SRAM_INITN_IMEM_Msk
#define 	SRAM_INITN_DMEM_Pos 	(0x8U)
#define 	SRAM_INITN_DMEM_Msk 	(0x1UL << SRAM_INITN_DMEM_Pos) 	/*!< 0x00000100 */
#define 	SRAM_INITN_DMEM 	SRAM_INITN_DMEM_Msk
#define 	SRAM_INITN_ROM_Pos 	(0x9U)
#define 	SRAM_INITN_ROM_Msk 	(0x1UL << SRAM_INITN_ROM_Pos) 	/*!< 0x00000200 */
#define 	SRAM_INITN_ROM 	SRAM_INITN_ROM_Msk
#define SRAM_PD0 	(0x000000BCUL) 	/*<! SRAM's Power Down Register, Enable standby mode (AFK, STC/EHC) */
#define 	SRAM_PD0_AFK_ALR_PD_Pos 	(0x0U)
#define 	SRAM_PD0_AFK_ALR_PD_Msk 	(0x1FUL << SRAM_PD0_AFK_ALR_PD_Pos) 	/*!< 0x0000001F */
#define 	SRAM_PD0_AFK_ALR_PD 	SRAM_PD0_AFK_ALR_PD_Msk
#define 	SRAM_PD0_AFK_STR0_PD_Pos 	(0x5U)
#define 	SRAM_PD0_AFK_STR0_PD_Msk 	(0x1FUL << SRAM_PD0_AFK_STR0_PD_Pos) 	/*!< 0x000003E0 */
#define 	SRAM_PD0_AFK_STR0_PD 	SRAM_PD0_AFK_STR0_PD_Msk
#define 	SRAM_PD0_AFK_STR1_PD_Pos 	(0xAU)
#define 	SRAM_PD0_AFK_STR1_PD_Msk 	(0x1FUL << SRAM_PD0_AFK_STR1_PD_Pos) 	/*!< 0x00007C00 */
#define 	SRAM_PD0_AFK_STR1_PD 	SRAM_PD0_AFK_STR1_PD_Msk
#define 	SRAM_PD0_STC0_PD_Pos 	(0xFU)
#define 	SRAM_PD0_STC0_PD_Msk 	(0x1FUL << SRAM_PD0_STC0_PD_Pos) 	/*!< 0x000F8000 */
#define 	SRAM_PD0_STC0_PD 	SRAM_PD0_STC0_PD_Msk
#define 	SRAM_PD0_STC1_PD_Pos 	(0x14U)
#define 	SRAM_PD0_STC1_PD_Msk 	(0x1FUL << SRAM_PD0_STC1_PD_Pos) 	/*!< 0x01F00000 */
#define 	SRAM_PD0_STC1_PD 	SRAM_PD0_STC1_PD_Msk
#define 	SRAM_PD0_EHC_PD_Pos 	(0x19U)
#define 	SRAM_PD0_EHC_PD_Msk 	(0x1FUL << SRAM_PD0_EHC_PD_Pos) 	/*!< 0x3E000000 */
#define 	SRAM_PD0_EHC_PD 	SRAM_PD0_EHC_PD_Msk
#define SRAM_PD1 	(0x000000C0UL) 	/*<! SRAM's Power Down Register, Enable standby mode(IMEM, DMEM, ROM, ERC, MIPI, CPI) */
#define 	SRAM_PD1_DMEM_PD_Pos 	(0x0U)
#define 	SRAM_PD1_DMEM_PD_Msk 	(0x1UL << SRAM_PD1_DMEM_PD_Pos) 	/*!< 0x00000001 */
#define 	SRAM_PD1_DMEM_PD 	SRAM_PD1_DMEM_PD_Msk
#define 	SRAM_PD1_IMEM_PD_Pos 	(0x1U)
#define 	SRAM_PD1_IMEM_PD_Msk 	(0x1UL << SRAM_PD1_IMEM_PD_Pos) 	/*!< 0x00000002 */
#define 	SRAM_PD1_IMEM_PD 	SRAM_PD1_IMEM_PD_Msk
#define 	SRAM_PD1_ROM_PD_Pos 	(0x2U)
#define 	SRAM_PD1_ROM_PD_Msk 	(0x1UL << SRAM_PD1_ROM_PD_Pos) 	/*!< 0x00000004 */
#define 	SRAM_PD1_ROM_PD 	SRAM_PD1_ROM_PD_Msk
#define 	SRAM_PD1_ERC_DL_PD_Pos 	(0x3U)
#define 	SRAM_PD1_ERC_DL_PD_Msk 	(0x1UL << SRAM_PD1_ERC_DL_PD_Pos) 	/*!< 0x00000008 */
#define 	SRAM_PD1_ERC_DL_PD 	SRAM_PD1_ERC_DL_PD_Msk
#define 	SRAM_PD1_ERC_ILG_PD_Pos 	(0x4U)
#define 	SRAM_PD1_ERC_ILG_PD_Msk 	(0x1UL << SRAM_PD1_ERC_ILG_PD_Pos) 	/*!< 0x00000010 */
#define 	SRAM_PD1_ERC_ILG_PD 	SRAM_PD1_ERC_ILG_PD_Msk
#define 	SRAM_PD1_ERC_TDROP_PD_Pos 	(0x5U)
#define 	SRAM_PD1_ERC_TDROP_PD_Msk 	(0x1UL << SRAM_PD1_ERC_TDROP_PD_Pos) 	/*!< 0x00000020 */
#define 	SRAM_PD1_ERC_TDROP_PD 	SRAM_PD1_ERC_TDROP_PD_Msk
#define 	SRAM_PD1_MIPI_PD_Pos 	(0x6U)
#define 	SRAM_PD1_MIPI_PD_Msk 	(0x1UL << SRAM_PD1_MIPI_PD_Pos) 	/*!< 0x00000040 */
#define 	SRAM_PD1_MIPI_PD 	SRAM_PD1_MIPI_PD_Msk
#define 	SRAM_PD1_CPI_PD_Pos 	(0x7U)
#define 	SRAM_PD1_CPI_PD_Msk 	(0x1UL << SRAM_PD1_CPI_PD_Pos) 	/*!< 0x00000080 */
#define 	SRAM_PD1_CPI_PD 	SRAM_PD1_CPI_PD_Msk
#define GCD_SHADOW_CNT0 	(0x000000C4UL) 	/*<! GCD shadow counters */
#define 	GCD_SHADOW_CNT0_POS0_CNT_Pos 	(0x0U)
#define 	GCD_SHADOW_CNT0_POS0_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT0_POS0_CNT_Pos) 	/*!< 0x000000FF */
#define 	GCD_SHADOW_CNT0_POS0_CNT 	GCD_SHADOW_CNT0_POS0_CNT_Msk
#define 	GCD_SHADOW_CNT0_POS1_CNT_Pos 	(0x8U)
#define 	GCD_SHADOW_CNT0_POS1_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT0_POS1_CNT_Pos) 	/*!< 0x0000FF00 */
#define 	GCD_SHADOW_CNT0_POS1_CNT 	GCD_SHADOW_CNT0_POS1_CNT_Msk
#define 	GCD_SHADOW_CNT0_POS2_CNT_Pos 	(0x10U)
#define 	GCD_SHADOW_CNT0_POS2_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT0_POS2_CNT_Pos) 	/*!< 0x00FF0000 */
#define 	GCD_SHADOW_CNT0_POS2_CNT 	GCD_SHADOW_CNT0_POS2_CNT_Msk
#define 	GCD_SHADOW_CNT0_POS3_CNT_Pos 	(0x18U)
#define 	GCD_SHADOW_CNT0_POS3_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT0_POS3_CNT_Pos) 	/*!< 0xFF000000 */
#define 	GCD_SHADOW_CNT0_POS3_CNT 	GCD_SHADOW_CNT0_POS3_CNT_Msk
#define GCD_SHADOW_CNT1 	(0x000000C8UL) 	/*<! GCD shadow counters */
#define 	GCD_SHADOW_CNT1_POS4_CNT_Pos 	(0x0U)
#define 	GCD_SHADOW_CNT1_POS4_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT1_POS4_CNT_Pos) 	/*!< 0x000000FF */
#define 	GCD_SHADOW_CNT1_POS4_CNT 	GCD_SHADOW_CNT1_POS4_CNT_Msk
#define 	GCD_SHADOW_CNT1_POS5_CNT_Pos 	(0x8U)
#define 	GCD_SHADOW_CNT1_POS5_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT1_POS5_CNT_Pos) 	/*!< 0x0000FF00 */
#define 	GCD_SHADOW_CNT1_POS5_CNT 	GCD_SHADOW_CNT1_POS5_CNT_Msk
#define 	GCD_SHADOW_CNT1_POS6_CNT_Pos 	(0x10U)
#define 	GCD_SHADOW_CNT1_POS6_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT1_POS6_CNT_Pos) 	/*!< 0x00FF0000 */
#define 	GCD_SHADOW_CNT1_POS6_CNT 	GCD_SHADOW_CNT1_POS6_CNT_Msk
#define 	GCD_SHADOW_CNT1_POS7_CNT_Pos 	(0x18U)
#define 	GCD_SHADOW_CNT1_POS7_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT1_POS7_CNT_Pos) 	/*!< 0xFF000000 */
#define 	GCD_SHADOW_CNT1_POS7_CNT 	GCD_SHADOW_CNT1_POS7_CNT_Msk
#define GCD_SHADOW_CNT2 	(0x000000CCUL) 	/*<! GCD shadow counters */
#define 	GCD_SHADOW_CNT2_POS8_CNT_Pos 	(0x0U)
#define 	GCD_SHADOW_CNT2_POS8_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT2_POS8_CNT_Pos) 	/*!< 0x000000FF */
#define 	GCD_SHADOW_CNT2_POS8_CNT 	GCD_SHADOW_CNT2_POS8_CNT_Msk
#define 	GCD_SHADOW_CNT2_NEG0_CNT_Pos 	(0x8U)
#define 	GCD_SHADOW_CNT2_NEG0_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT2_NEG0_CNT_Pos) 	/*!< 0x0000FF00 */
#define 	GCD_SHADOW_CNT2_NEG0_CNT 	GCD_SHADOW_CNT2_NEG0_CNT_Msk
#define 	GCD_SHADOW_CNT2_NEG1_CNT_Pos 	(0x10U)
#define 	GCD_SHADOW_CNT2_NEG1_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT2_NEG1_CNT_Pos) 	/*!< 0x00FF0000 */
#define 	GCD_SHADOW_CNT2_NEG1_CNT 	GCD_SHADOW_CNT2_NEG1_CNT_Msk
#define 	GCD_SHADOW_CNT2_NEG2_CNT_Pos 	(0x18U)
#define 	GCD_SHADOW_CNT2_NEG2_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT2_NEG2_CNT_Pos) 	/*!< 0xFF000000 */
#define 	GCD_SHADOW_CNT2_NEG2_CNT 	GCD_SHADOW_CNT2_NEG2_CNT_Msk
#define GCD_SHADOW_CNT3 	(0x000000D0UL) 	/*<! GCD shadow counters */
#define 	GCD_SHADOW_CNT3_NEG3_CNT_Pos 	(0x0U)
#define 	GCD_SHADOW_CNT3_NEG3_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT3_NEG3_CNT_Pos) 	/*!< 0x000000FF */
#define 	GCD_SHADOW_CNT3_NEG3_CNT 	GCD_SHADOW_CNT3_NEG3_CNT_Msk
#define 	GCD_SHADOW_CNT3_NEG4_CNT_Pos 	(0x8U)
#define 	GCD_SHADOW_CNT3_NEG4_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT3_NEG4_CNT_Pos) 	/*!< 0x0000FF00 */
#define 	GCD_SHADOW_CNT3_NEG4_CNT 	GCD_SHADOW_CNT3_NEG4_CNT_Msk
#define 	GCD_SHADOW_CNT3_NEG5_CNT_Pos 	(0x10U)
#define 	GCD_SHADOW_CNT3_NEG5_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT3_NEG5_CNT_Pos) 	/*!< 0x00FF0000 */
#define 	GCD_SHADOW_CNT3_NEG5_CNT 	GCD_SHADOW_CNT3_NEG5_CNT_Msk
#define 	GCD_SHADOW_CNT3_NEG6_CNT_Pos 	(0x18U)
#define 	GCD_SHADOW_CNT3_NEG6_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT3_NEG6_CNT_Pos) 	/*!< 0xFF000000 */
#define 	GCD_SHADOW_CNT3_NEG6_CNT 	GCD_SHADOW_CNT3_NEG6_CNT_Msk
#define GCD_SHADOW_CNT4 	(0x000000D4UL) 	/*<! GCD shadow counters */
#define 	GCD_SHADOW_CNT4_NEG7_CNT_Pos 	(0x0U)
#define 	GCD_SHADOW_CNT4_NEG7_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT4_NEG7_CNT_Pos) 	/*!< 0x000000FF */
#define 	GCD_SHADOW_CNT4_NEG7_CNT 	GCD_SHADOW_CNT4_NEG7_CNT_Msk
#define 	GCD_SHADOW_CNT4_NEG8_CNT_Pos 	(0x8U)
#define 	GCD_SHADOW_CNT4_NEG8_CNT_Msk 	(0xFFUL << GCD_SHADOW_CNT4_NEG8_CNT_Pos) 	/*!< 0x0000FF00 */
#define 	GCD_SHADOW_CNT4_NEG8_CNT 	GCD_SHADOW_CNT4_NEG8_CNT_Msk
#define BGR_SHADOW_CTRL 	(0x000000D8UL) 	/*<! Test row background rate control. */
#define 	BGR_SHADOW_CTRL_TIMER_EN_Pos 	(0x0U)
#define 	BGR_SHADOW_CTRL_TIMER_EN_Msk 	(0x1UL << BGR_SHADOW_CTRL_TIMER_EN_Pos) 	/*!< 0x00000001 */
#define 	BGR_SHADOW_CTRL_TIMER_EN 	BGR_SHADOW_CTRL_TIMER_EN_Msk
#define 	BGR_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos 	(0x1U)
#define 	BGR_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk 	(0x1UL << BGR_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos) 	/*!< 0x00000002 */
#define 	BGR_SHADOW_CTRL_IRQ_SW_OVERRIDE 	BGR_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk
#define 	BGR_SHADOW_CTRL_RESET_ON_COPY_Pos 	(0x2U)
#define 	BGR_SHADOW_CTRL_RESET_ON_COPY_Msk 	(0x1UL << BGR_SHADOW_CTRL_RESET_ON_COPY_Pos) 	/*!< 0x00000004 */
#define 	BGR_SHADOW_CTRL_RESET_ON_COPY 	BGR_SHADOW_CTRL_RESET_ON_COPY_Msk
#define 	BGR_SHADOW_CTRL_EN_Pos 	(0x3U)
#define 	BGR_SHADOW_CTRL_EN_Msk 	(0x1UL << BGR_SHADOW_CTRL_EN_Pos) 	/*!< 0x00000008 */
#define 	BGR_SHADOW_CTRL_EN 	BGR_SHADOW_CTRL_EN_Msk
#define BGR_SHADOW_STATUS 	(0x000000DCUL) 	/*<! Test row background rate status. */
#define 	BGR_SHADOW_STATUS_VALID_Pos 	(0x0U)
#define 	BGR_SHADOW_STATUS_VALID_Msk 	(0x1UL << BGR_SHADOW_STATUS_VALID_Pos) 	/*!< 0x00000001 */
#define 	BGR_SHADOW_STATUS_VALID 	BGR_SHADOW_STATUS_VALID_Msk
#define 	BGR_SHADOW_STATUS_OVERRUN_Pos 	(0x1U)
#define 	BGR_SHADOW_STATUS_OVERRUN_Msk 	(0x1UL << BGR_SHADOW_STATUS_OVERRUN_Pos) 	/*!< 0x00000002 */
#define 	BGR_SHADOW_STATUS_OVERRUN 	BGR_SHADOW_STATUS_OVERRUN_Msk
#define BGR_SHADOW_TIMER_CTRL 	(0x000000E0UL) 	/*<! Test row background rate timer. */
#define 	BGR_SHADOW_TIMER_CTRL_THRESHOLD_Pos 	(0x0U)
#define 	BGR_SHADOW_TIMER_CTRL_THRESHOLD_Msk 	(0xFFFFFUL << BGR_SHADOW_TIMER_CTRL_THRESHOLD_Pos) 	/*!< 0x000FFFFF */
#define 	BGR_SHADOW_TIMER_CTRL_THRESHOLD 	BGR_SHADOW_TIMER_CTRL_THRESHOLD_Msk
#define BGR_SHADOW_CNT 	(0x000000E4UL) 	/*<! Test row background rate event counter within bgr_shadow_timer_threshold. */
#define 	BGR_SHADOW_CNT_POS_Pos 	(0x0U)
#define 	BGR_SHADOW_CNT_POS_Msk 	(0xFFFFUL << BGR_SHADOW_CNT_POS_Pos) 	/*!< 0x0000FFFF */
#define 	BGR_SHADOW_CNT_POS 	BGR_SHADOW_CNT_POS_Msk
#define 	BGR_SHADOW_CNT_NEG_Pos 	(0x10U)
#define 	BGR_SHADOW_CNT_NEG_Msk 	(0xFFFFUL << BGR_SHADOW_CNT_NEG_Pos) 	/*!< 0xFFFF0000 */
#define 	BGR_SHADOW_CNT_NEG 	BGR_SHADOW_CNT_NEG_Msk
#define REF_CLK_CTRL 	(0x00000200UL) 	/*<! ref_clk control */
#define 	REF_CLK_CTRL_EN_Pos 	(0x0U)
#define 	REF_CLK_CTRL_EN_Msk 	(0x1UL << REF_CLK_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	REF_CLK_CTRL_EN 	REF_CLK_CTRL_EN_Msk
#define 	REF_CLK_CTRL_SWITCH_Pos 	(0x1U)
#define 	REF_CLK_CTRL_SWITCH_Msk 	(0x1UL << REF_CLK_CTRL_SWITCH_Pos) 	/*!< 0x00000002 */
#define 	REF_CLK_CTRL_SWITCH 	REF_CLK_CTRL_SWITCH_Msk
#define 	REF_CLK_CTRL_DIV_Pos 	(0x2U)
#define 	REF_CLK_CTRL_DIV_Msk 	(0xFUL << REF_CLK_CTRL_DIV_Pos) 	/*!< 0x0000003C */
#define 	REF_CLK_CTRL_DIV 	REF_CLK_CTRL_DIV_Msk
#define SYS_CLK_CTRL 	(0x00000204UL) 	/*<! sys_clk control */
#define 	SYS_CLK_CTRL_EN_Pos 	(0x0U)
#define 	SYS_CLK_CTRL_EN_Msk 	(0x1UL << SYS_CLK_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	SYS_CLK_CTRL_EN 	SYS_CLK_CTRL_EN_Msk
#define 	SYS_CLK_CTRL_SWITCH_Pos 	(0x1U)
#define 	SYS_CLK_CTRL_SWITCH_Msk 	(0x1UL << SYS_CLK_CTRL_SWITCH_Pos) 	/*!< 0x00000002 */
#define 	SYS_CLK_CTRL_SWITCH 	SYS_CLK_CTRL_SWITCH_Msk
#define 	SYS_CLK_CTRL_PHY_OFF_COUNT_Pos 	(0x2U)
#define 	SYS_CLK_CTRL_PHY_OFF_COUNT_Msk 	(0x3FUL << SYS_CLK_CTRL_PHY_OFF_COUNT_Pos) 	/*!< 0x000000FC */
#define 	SYS_CLK_CTRL_PHY_OFF_COUNT 	SYS_CLK_CTRL_PHY_OFF_COUNT_Msk
#define 	SYS_CLK_CTRL_PHY_ON_COUNT_Pos 	(0x8U)
#define 	SYS_CLK_CTRL_PHY_ON_COUNT_Msk 	(0x3FUL << SYS_CLK_CTRL_PHY_ON_COUNT_Pos) 	/*!< 0x00003F00 */
#define 	SYS_CLK_CTRL_PHY_ON_COUNT 	SYS_CLK_CTRL_PHY_ON_COUNT_Msk
#define 	SYS_CLK_CTRL_PHY_DIV2_Pos 	(0xEU)
#define 	SYS_CLK_CTRL_PHY_DIV2_Msk 	(0x1UL << SYS_CLK_CTRL_PHY_DIV2_Pos) 	/*!< 0x00004000 */
#define 	SYS_CLK_CTRL_PHY_DIV2 	SYS_CLK_CTRL_PHY_DIV2_Msk
#define 	SYS_CLK_CTRL_AUTO_MODE_Pos 	(0xFU)
#define 	SYS_CLK_CTRL_AUTO_MODE_Msk 	(0x1UL << SYS_CLK_CTRL_AUTO_MODE_Pos) 	/*!< 0x00008000 */
#define 	SYS_CLK_CTRL_AUTO_MODE 	SYS_CLK_CTRL_AUTO_MODE_Msk
#define CPU_SS_CLK_CTRL 	(0x00000208UL) 	/*<! cpu_ss_clk control */
#define 	CPU_SS_CLK_CTRL_EN_Pos 	(0x0U)
#define 	CPU_SS_CLK_CTRL_EN_Msk 	(0x1UL << CPU_SS_CLK_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	CPU_SS_CLK_CTRL_EN 	CPU_SS_CLK_CTRL_EN_Msk
#define 	CPU_SS_CLK_CTRL_SWITCH_Pos 	(0x1U)
#define 	CPU_SS_CLK_CTRL_SWITCH_Msk 	(0x1UL << CPU_SS_CLK_CTRL_SWITCH_Pos) 	/*!< 0x00000002 */
#define 	CPU_SS_CLK_CTRL_SWITCH 	CPU_SS_CLK_CTRL_SWITCH_Msk
#define 	CPU_SS_CLK_CTRL_DIV_Pos 	(0x2U)
#define 	CPU_SS_CLK_CTRL_DIV_Msk 	(0xFFUL << CPU_SS_CLK_CTRL_DIV_Pos) 	/*!< 0x000003FC */
#define 	CPU_SS_CLK_CTRL_DIV 	CPU_SS_CLK_CTRL_DIV_Msk
#define RTC_CLK_CTRL 	(0x0000020CUL) 	/*<! rtc_clk control */
#define 	RTC_CLK_CTRL_EN_Pos 	(0x0U)
#define 	RTC_CLK_CTRL_EN_Msk 	(0x1UL << RTC_CLK_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	RTC_CLK_CTRL_EN 	RTC_CLK_CTRL_EN_Msk
#define 	RTC_CLK_CTRL_DIV_Pos 	(0x1U)
#define 	RTC_CLK_CTRL_DIV_Msk 	(0xFFUL << RTC_CLK_CTRL_DIV_Pos) 	/*!< 0x000001FE */
#define 	RTC_CLK_CTRL_DIV 	RTC_CLK_CTRL_DIV_Msk
#define EVT_ICN_CLK_CTRL 	(0x00000210UL) 	/*<! evt_icn_clk control */
#define 	EVT_ICN_CLK_CTRL_EN_Pos 	(0x0U)
#define 	EVT_ICN_CLK_CTRL_EN_Msk 	(0x1UL << EVT_ICN_CLK_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	EVT_ICN_CLK_CTRL_EN 	EVT_ICN_CLK_CTRL_EN_Msk
#define 	EVT_ICN_CLK_CTRL_SWITCH_Pos 	(0x1U)
#define 	EVT_ICN_CLK_CTRL_SWITCH_Msk 	(0x1UL << EVT_ICN_CLK_CTRL_SWITCH_Pos) 	/*!< 0x00000002 */
#define 	EVT_ICN_CLK_CTRL_SWITCH 	EVT_ICN_CLK_CTRL_SWITCH_Msk
#define 	EVT_ICN_CLK_CTRL_DIV_Pos 	(0x2U)
#define 	EVT_ICN_CLK_CTRL_DIV_Msk 	(0xFFUL << EVT_ICN_CLK_CTRL_DIV_Pos) 	/*!< 0x000003FC */
#define 	EVT_ICN_CLK_CTRL_DIV 	EVT_ICN_CLK_CTRL_DIV_Msk
#define 	EVT_ICN_CLK_CTRL_ESP_EN_Pos 	(0xAU)
#define 	EVT_ICN_CLK_CTRL_ESP_EN_Msk 	(0x1UL << EVT_ICN_CLK_CTRL_ESP_EN_Pos) 	/*!< 0x00000400 */
#define 	EVT_ICN_CLK_CTRL_ESP_EN 	EVT_ICN_CLK_CTRL_ESP_EN_Msk
#define 	EVT_ICN_CLK_CTRL_RO_EN_Pos 	(0xBU)
#define 	EVT_ICN_CLK_CTRL_RO_EN_Msk 	(0x1UL << EVT_ICN_CLK_CTRL_RO_EN_Pos) 	/*!< 0x00000800 */
#define 	EVT_ICN_CLK_CTRL_RO_EN 	EVT_ICN_CLK_CTRL_RO_EN_Msk
#define PLL_CTRL 	(0x00000214UL) 	/*<! pll control */
#define 	PLL_CTRL_PL_ENABLE_Pos 	(0x0U)
#define 	PLL_CTRL_PL_ENABLE_Msk 	(0x1UL << PLL_CTRL_PL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	PLL_CTRL_PL_ENABLE 	PLL_CTRL_PL_ENABLE_Msk
#define 	PLL_CTRL_PL_NDIV_Pos 	(0x1U)
#define 	PLL_CTRL_PL_NDIV_Msk 	(0xFFUL << PLL_CTRL_PL_NDIV_Pos) 	/*!< 0x000001FE */
#define 	PLL_CTRL_PL_NDIV 	PLL_CTRL_PL_NDIV_Msk
#define 	PLL_CTRL_PL_ODF_Pos 	(0x9U)
#define 	PLL_CTRL_PL_ODF_Msk 	(0xFUL << PLL_CTRL_PL_ODF_Pos) 	/*!< 0x00001E00 */
#define 	PLL_CTRL_PL_ODF 	PLL_CTRL_PL_ODF_Msk
#define 	PLL_CTRL_PL_STRB_Pos 	(0xDU)
#define 	PLL_CTRL_PL_STRB_Msk 	(0x1UL << PLL_CTRL_PL_STRB_Pos) 	/*!< 0x00002000 */
#define 	PLL_CTRL_PL_STRB 	PLL_CTRL_PL_STRB_Msk
#define 	PLL_CTRL_PL_STRB_BYPASS_Pos 	(0xEU)
#define 	PLL_CTRL_PL_STRB_BYPASS_Msk 	(0x1UL << PLL_CTRL_PL_STRB_BYPASS_Pos) 	/*!< 0x00004000 */
#define 	PLL_CTRL_PL_STRB_BYPASS 	PLL_CTRL_PL_STRB_BYPASS_Msk
#define 	PLL_CTRL_PL_LOCKP_Pos 	(0xFU)
#define 	PLL_CTRL_PL_LOCKP_Msk 	(0x1UL << PLL_CTRL_PL_LOCKP_Pos) 	/*!< 0x00008000 */
#define 	PLL_CTRL_PL_LOCKP 	PLL_CTRL_PL_LOCKP_Msk
#define 	PLL_CTRL_PL_LOCKP_DELAYED_Pos 	(0x10U)
#define 	PLL_CTRL_PL_LOCKP_DELAYED_Msk 	(0x1UL << PLL_CTRL_PL_LOCKP_DELAYED_Pos) 	/*!< 0x00010000 */
#define 	PLL_CTRL_PL_LOCKP_DELAYED 	PLL_CTRL_PL_LOCKP_DELAYED_Msk
#define PLL_SSCG_CTRL 	(0x00000218UL) 	/*<! pll sscg mode control */
#define 	PLL_SSCG_CTRL_PL_Pos 	(0x0U)
#define 	PLL_SSCG_CTRL_PL_Msk 	(0x1UL << PLL_SSCG_CTRL_PL_Pos) 	/*!< 0x00000001 */
#define 	PLL_SSCG_CTRL_PL 	PLL_SSCG_CTRL_PL_Msk
#define 	PLL_SSCG_CTRL_PL_MOD_PERIOD_Pos 	(0x1U)
#define 	PLL_SSCG_CTRL_PL_MOD_PERIOD_Msk 	(0x1FFFUL << PLL_SSCG_CTRL_PL_MOD_PERIOD_Pos) 	/*!< 0x00003FFE */
#define 	PLL_SSCG_CTRL_PL_MOD_PERIOD 	PLL_SSCG_CTRL_PL_MOD_PERIOD_Msk
#define 	PLL_SSCG_CTRL_PL_INC_STEP_Pos 	(0xEU)
#define 	PLL_SSCG_CTRL_PL_INC_STEP_Msk 	(0x7FFFUL << PLL_SSCG_CTRL_PL_INC_STEP_Pos) 	/*!< 0x1FFFC000 */
#define 	PLL_SSCG_CTRL_PL_INC_STEP 	PLL_SSCG_CTRL_PL_INC_STEP_Msk
#define 	PLL_SSCG_CTRL_PL_SPREAD_Pos 	(0x1DU)
#define 	PLL_SSCG_CTRL_PL_SPREAD_Msk 	(0x1UL << PLL_SSCG_CTRL_PL_SPREAD_Pos) 	/*!< 0x20000000 */
#define 	PLL_SSCG_CTRL_PL_SPREAD 	PLL_SSCG_CTRL_PL_SPREAD_Msk
#define PLL_FRAC_CTRL 	(0x0000021CUL) 	/*<! pll fractional mode control */
#define 	PLL_FRAC_CTRL_PL_Pos 	(0x0U)
