jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	PLL_FRAC_CTRL_PL_Msk 	(0x1UL << PLL_FRAC_CTRL_PL_Pos) 	/*!< 0x00000001 */
#define 	PLL_FRAC_CTRL_PL 	PLL_FRAC_CTRL_PL_Msk
#define 	PLL_FRAC_CTRL_PL_INPUT_Pos 	(0x1U)
#define 	PLL_FRAC_CTRL_PL_INPUT_Msk 	(0xFFFFUL << PLL_FRAC_CTRL_PL_INPUT_Pos) 	/*!< 0x0001FFFE */
#define 	PLL_FRAC_CTRL_PL_INPUT 	PLL_FRAC_CTRL_PL_INPUT_Msk
#define 	PLL_FRAC_CTRL_PL_DITHER_DISABLE_Pos 	(0x11U)
#define 	PLL_FRAC_CTRL_PL_DITHER_DISABLE_Msk 	(0x3UL << PLL_FRAC_CTRL_PL_DITHER_DISABLE_Pos) 	/*!< 0x00060000 */
#define 	PLL_FRAC_CTRL_PL_DITHER_DISABLE 	PLL_FRAC_CTRL_PL_DITHER_DISABLE_Msk
#define ROI_WIN_X0 	(0x00000400UL) 	/*<! Horizontal coordinate for ROI window number 0 */
#define 	ROI_WIN_X0_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X0_START_X_Msk 	(0x1FFUL << ROI_WIN_X0_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X0_START_X 	ROI_WIN_X0_START_X_Msk
#define 	ROI_WIN_X0_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X0_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X0_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X0_END_P1_X 	ROI_WIN_X0_END_P1_X_Msk
#define ROI_WIN_Y0 	(0x00000404UL) 	/*<! Vertical coordinate for ROI window number 0 */
#define 	ROI_WIN_Y0_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y0_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y0_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y0_START_Y 	ROI_WIN_Y0_START_Y_Msk
#define 	ROI_WIN_Y0_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y0_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y0_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y0_END_P1_Y 	ROI_WIN_Y0_END_P1_Y_Msk
#define ROI_WIN_X1 	(0x00000408UL) 	/*<! Horizontal coordinate for ROI window number 1 */
#define 	ROI_WIN_X1_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X1_START_X_Msk 	(0x1FFUL << ROI_WIN_X1_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X1_START_X 	ROI_WIN_X1_START_X_Msk
#define 	ROI_WIN_X1_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X1_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X1_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X1_END_P1_X 	ROI_WIN_X1_END_P1_X_Msk
#define ROI_WIN_Y1 	(0x0000040CUL) 	/*<! Vertical coordinate for ROI window number 1 */
#define 	ROI_WIN_Y1_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y1_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y1_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y1_START_Y 	ROI_WIN_Y1_START_Y_Msk
#define 	ROI_WIN_Y1_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y1_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y1_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y1_END_P1_Y 	ROI_WIN_Y1_END_P1_Y_Msk
#define ROI_WIN_X2 	(0x00000410UL) 	/*<! Horizontal coordinate for ROI window number 2 */
#define 	ROI_WIN_X2_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X2_START_X_Msk 	(0x1FFUL << ROI_WIN_X2_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X2_START_X 	ROI_WIN_X2_START_X_Msk
#define 	ROI_WIN_X2_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X2_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X2_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X2_END_P1_X 	ROI_WIN_X2_END_P1_X_Msk
#define ROI_WIN_Y2 	(0x00000414UL) 	/*<! Vertical coordinate for ROI window number 2 */
#define 	ROI_WIN_Y2_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y2_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y2_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y2_START_Y 	ROI_WIN_Y2_START_Y_Msk
#define 	ROI_WIN_Y2_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y2_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y2_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y2_END_P1_Y 	ROI_WIN_Y2_END_P1_Y_Msk
#define ROI_WIN_X3 	(0x00000418UL) 	/*<! Horizontal coordinate for ROI window number 3 */
#define 	ROI_WIN_X3_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X3_START_X_Msk 	(0x1FFUL << ROI_WIN_X3_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X3_START_X 	ROI_WIN_X3_START_X_Msk
#define 	ROI_WIN_X3_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X3_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X3_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X3_END_P1_X 	ROI_WIN_X3_END_P1_X_Msk
#define ROI_WIN_Y3 	(0x0000041CUL) 	/*<! Vertical coordinate for ROI window number 3 */
#define 	ROI_WIN_Y3_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y3_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y3_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y3_START_Y 	ROI_WIN_Y3_START_Y_Msk
#define 	ROI_WIN_Y3_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y3_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y3_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y3_END_P1_Y 	ROI_WIN_Y3_END_P1_Y_Msk
#define ROI_WIN_X4 	(0x00000420UL) 	/*<! Horizontal coordinate for ROI window number 4 */
#define 	ROI_WIN_X4_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X4_START_X_Msk 	(0x1FFUL << ROI_WIN_X4_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X4_START_X 	ROI_WIN_X4_START_X_Msk
#define 	ROI_WIN_X4_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X4_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X4_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X4_END_P1_X 	ROI_WIN_X4_END_P1_X_Msk
#define ROI_WIN_Y4 	(0x00000424UL) 	/*<! Vertical coordinate for ROI window number 4 */
#define 	ROI_WIN_Y4_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y4_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y4_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y4_START_Y 	ROI_WIN_Y4_START_Y_Msk
#define 	ROI_WIN_Y4_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y4_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y4_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y4_END_P1_Y 	ROI_WIN_Y4_END_P1_Y_Msk
#define ROI_WIN_X5 	(0x00000428UL) 	/*<! Horizontal coordinate for ROI window number 5 */
#define 	ROI_WIN_X5_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X5_START_X_Msk 	(0x1FFUL << ROI_WIN_X5_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X5_START_X 	ROI_WIN_X5_START_X_Msk
#define 	ROI_WIN_X5_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X5_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X5_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X5_END_P1_X 	ROI_WIN_X5_END_P1_X_Msk
#define ROI_WIN_Y5 	(0x0000042CUL) 	/*<! Vertical coordinate for ROI window number 5 */
#define 	ROI_WIN_Y5_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y5_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y5_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y5_START_Y 	ROI_WIN_Y5_START_Y_Msk
#define 	ROI_WIN_Y5_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y5_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y5_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y5_END_P1_Y 	ROI_WIN_Y5_END_P1_Y_Msk
#define ROI_WIN_X6 	(0x00000430UL) 	/*<! Horizontal coordinate for ROI window number 6 */
#define 	ROI_WIN_X6_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X6_START_X_Msk 	(0x1FFUL << ROI_WIN_X6_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X6_START_X 	ROI_WIN_X6_START_X_Msk
#define 	ROI_WIN_X6_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X6_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X6_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X6_END_P1_X 	ROI_WIN_X6_END_P1_X_Msk
#define ROI_WIN_Y6 	(0x00000434UL) 	/*<! Vertical coordinate for ROI window number 6 */
#define 	ROI_WIN_Y6_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y6_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y6_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y6_START_Y 	ROI_WIN_Y6_START_Y_Msk
#define 	ROI_WIN_Y6_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y6_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y6_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y6_END_P1_Y 	ROI_WIN_Y6_END_P1_Y_Msk
#define ROI_WIN_X7 	(0x00000438UL) 	/*<! Horizontal coordinate for ROI window number 7 */
#define 	ROI_WIN_X7_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X7_START_X_Msk 	(0x1FFUL << ROI_WIN_X7_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X7_START_X 	ROI_WIN_X7_START_X_Msk
#define 	ROI_WIN_X7_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X7_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X7_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X7_END_P1_X 	ROI_WIN_X7_END_P1_X_Msk
#define ROI_WIN_Y7 	(0x0000043CUL) 	/*<! Vertical coordinate for ROI window number 7 */
#define 	ROI_WIN_Y7_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y7_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y7_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y7_START_Y 	ROI_WIN_Y7_START_Y_Msk
#define 	ROI_WIN_Y7_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y7_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y7_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y7_END_P1_Y 	ROI_WIN_Y7_END_P1_Y_Msk
#define ROI_WIN_X8 	(0x00000440UL) 	/*<! Horizontal coordinate for ROI window number 8 */
#define 	ROI_WIN_X8_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X8_START_X_Msk 	(0x1FFUL << ROI_WIN_X8_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X8_START_X 	ROI_WIN_X8_START_X_Msk
#define 	ROI_WIN_X8_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X8_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X8_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X8_END_P1_X 	ROI_WIN_X8_END_P1_X_Msk
#define ROI_WIN_Y8 	(0x00000444UL) 	/*<! Vertical coordinate for ROI window number 8 */
#define 	ROI_WIN_Y8_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y8_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y8_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y8_START_Y 	ROI_WIN_Y8_START_Y_Msk
#define 	ROI_WIN_Y8_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y8_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y8_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y8_END_P1_Y 	ROI_WIN_Y8_END_P1_Y_Msk
#define ROI_WIN_X9 	(0x00000448UL) 	/*<! Horizontal coordinate for ROI window number 9 */
#define 	ROI_WIN_X9_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X9_START_X_Msk 	(0x1FFUL << ROI_WIN_X9_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X9_START_X 	ROI_WIN_X9_START_X_Msk
#define 	ROI_WIN_X9_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X9_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X9_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X9_END_P1_X 	ROI_WIN_X9_END_P1_X_Msk
#define ROI_WIN_Y9 	(0x0000044CUL) 	/*<! Vertical coordinate for ROI window number 9 */
#define 	ROI_WIN_Y9_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y9_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y9_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y9_START_Y 	ROI_WIN_Y9_START_Y_Msk
#define 	ROI_WIN_Y9_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y9_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y9_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y9_END_P1_Y 	ROI_WIN_Y9_END_P1_Y_Msk
#define ROI_WIN_X10 	(0x00000450UL) 	/*<! Horizontal coordinate for ROI window number 10 */
#define 	ROI_WIN_X10_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X10_START_X_Msk 	(0x1FFUL << ROI_WIN_X10_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X10_START_X 	ROI_WIN_X10_START_X_Msk
#define 	ROI_WIN_X10_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X10_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X10_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X10_END_P1_X 	ROI_WIN_X10_END_P1_X_Msk
#define ROI_WIN_Y10 	(0x00000454UL) 	/*<! Vertical coordinate for ROI window number 10 */
#define 	ROI_WIN_Y10_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y10_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y10_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y10_START_Y 	ROI_WIN_Y10_START_Y_Msk
#define 	ROI_WIN_Y10_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y10_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y10_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y10_END_P1_Y 	ROI_WIN_Y10_END_P1_Y_Msk
#define ROI_WIN_X11 	(0x00000458UL) 	/*<! Horizontal coordinate for ROI window number 11 */
#define 	ROI_WIN_X11_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X11_START_X_Msk 	(0x1FFUL << ROI_WIN_X11_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X11_START_X 	ROI_WIN_X11_START_X_Msk
#define 	ROI_WIN_X11_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X11_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X11_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X11_END_P1_X 	ROI_WIN_X11_END_P1_X_Msk
#define ROI_WIN_Y11 	(0x0000045CUL) 	/*<! Vertical coordinate for ROI window number 11 */
#define 	ROI_WIN_Y11_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y11_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y11_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y11_START_Y 	ROI_WIN_Y11_START_Y_Msk
#define 	ROI_WIN_Y11_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y11_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y11_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y11_END_P1_Y 	ROI_WIN_Y11_END_P1_Y_Msk
#define ROI_WIN_X12 	(0x00000460UL) 	/*<! Horizontal coordinate for ROI window number 12 */
#define 	ROI_WIN_X12_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X12_START_X_Msk 	(0x1FFUL << ROI_WIN_X12_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X12_START_X 	ROI_WIN_X12_START_X_Msk
#define 	ROI_WIN_X12_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X12_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X12_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X12_END_P1_X 	ROI_WIN_X12_END_P1_X_Msk
#define ROI_WIN_Y12 	(0x00000464UL) 	/*<! Vertical coordinate for ROI window number 12 */
#define 	ROI_WIN_Y12_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y12_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y12_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y12_START_Y 	ROI_WIN_Y12_START_Y_Msk
#define 	ROI_WIN_Y12_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y12_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y12_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y12_END_P1_Y 	ROI_WIN_Y12_END_P1_Y_Msk
#define ROI_WIN_X13 	(0x00000468UL) 	/*<! Horizontal coordinate for ROI window number 13 */
#define 	ROI_WIN_X13_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X13_START_X_Msk 	(0x1FFUL << ROI_WIN_X13_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X13_START_X 	ROI_WIN_X13_START_X_Msk
#define 	ROI_WIN_X13_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X13_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X13_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X13_END_P1_X 	ROI_WIN_X13_END_P1_X_Msk
#define ROI_WIN_Y13 	(0x0000046CUL) 	/*<! Vertical coordinate for ROI window number 13 */
#define 	ROI_WIN_Y13_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y13_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y13_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y13_START_Y 	ROI_WIN_Y13_START_Y_Msk
#define 	ROI_WIN_Y13_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y13_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y13_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y13_END_P1_Y 	ROI_WIN_Y13_END_P1_Y_Msk
#define ROI_WIN_X14 	(0x00000470UL) 	/*<! Horizontal coordinate for ROI window number 14 */
#define 	ROI_WIN_X14_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X14_START_X_Msk 	(0x1FFUL << ROI_WIN_X14_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X14_START_X 	ROI_WIN_X14_START_X_Msk
#define 	ROI_WIN_X14_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X14_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X14_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X14_END_P1_X 	ROI_WIN_X14_END_P1_X_Msk
#define ROI_WIN_Y14 	(0x00000474UL) 	/*<! Vertical coordinate for ROI window number 14 */
#define 	ROI_WIN_Y14_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y14_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y14_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y14_START_Y 	ROI_WIN_Y14_START_Y_Msk
#define 	ROI_WIN_Y14_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y14_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y14_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y14_END_P1_Y 	ROI_WIN_Y14_END_P1_Y_Msk
#define ROI_WIN_X15 	(0x00000478UL) 	/*<! Horizontal coordinate for ROI window number 15 */
#define 	ROI_WIN_X15_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X15_START_X_Msk 	(0x1FFUL << ROI_WIN_X15_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X15_START_X 	ROI_WIN_X15_START_X_Msk
#define 	ROI_WIN_X15_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X15_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X15_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X15_END_P1_X 	ROI_WIN_X15_END_P1_X_Msk
#define ROI_WIN_Y15 	(0x0000047CUL) 	/*<! Vertical coordinate for ROI window number 15 */
#define 	ROI_WIN_Y15_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y15_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y15_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y15_START_Y 	ROI_WIN_Y15_START_Y_Msk
#define 	ROI_WIN_Y15_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y15_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y15_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y15_END_P1_Y 	ROI_WIN_Y15_END_P1_Y_Msk
#define ROI_WIN_X16 	(0x00000480UL) 	/*<! Horizontal coordinate for ROI window number 16 */
#define 	ROI_WIN_X16_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X16_START_X_Msk 	(0x1FFUL << ROI_WIN_X16_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X16_START_X 	ROI_WIN_X16_START_X_Msk
#define 	ROI_WIN_X16_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X16_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X16_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X16_END_P1_X 	ROI_WIN_X16_END_P1_X_Msk
#define ROI_WIN_Y16 	(0x00000484UL) 	/*<! Vertical coordinate for ROI window number 16 */
#define 	ROI_WIN_Y16_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y16_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y16_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y16_START_Y 	ROI_WIN_Y16_START_Y_Msk
#define 	ROI_WIN_Y16_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y16_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y16_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y16_END_P1_Y 	ROI_WIN_Y16_END_P1_Y_Msk
#define ROI_WIN_X17 	(0x00000488UL) 	/*<! Horizontal coordinate for ROI window number 17 */
#define 	ROI_WIN_X17_START_X_Pos 	(0x0U)
#define 	ROI_WIN_X17_START_X_Msk 	(0x1FFUL << ROI_WIN_X17_START_X_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_X17_START_X 	ROI_WIN_X17_START_X_Msk
#define 	ROI_WIN_X17_END_P1_X_Pos 	(0x10U)
#define 	ROI_WIN_X17_END_P1_X_Msk 	(0x1FFUL << ROI_WIN_X17_END_P1_X_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_X17_END_P1_X 	ROI_WIN_X17_END_P1_X_Msk
#define ROI_WIN_Y17 	(0x0000048CUL) 	/*<! Vertical coordinate for ROI window number 17 */
#define 	ROI_WIN_Y17_START_Y_Pos 	(0x0U)
#define 	ROI_WIN_Y17_START_Y_Msk 	(0x1FFUL << ROI_WIN_Y17_START_Y_Pos) 	/*!< 0x000001FF */
#define 	ROI_WIN_Y17_START_Y 	ROI_WIN_Y17_START_Y_Msk
#define 	ROI_WIN_Y17_END_P1_Y_Pos 	(0x10U)
#define 	ROI_WIN_Y17_END_P1_Y_Msk 	(0x1FFUL << ROI_WIN_Y17_END_P1_Y_Pos) 	/*!< 0x01FF0000 */
#define 	ROI_WIN_Y17_END_P1_Y 	ROI_WIN_Y17_END_P1_Y_Msk
#define IO_CTRL0 	(0x00000600UL) 	/*<! Input Output PAD, Control registers 0 */
#define 	IO_CTRL0_MODE0_EN_Pos 	(0x0U)
#define 	IO_CTRL0_MODE0_EN_Msk 	(0x1UL << IO_CTRL0_MODE0_EN_Pos) 	/*!< 0x00000001 */
#define 	IO_CTRL0_MODE0_EN 	IO_CTRL0_MODE0_EN_Msk
#define 	IO_CTRL0_MODE0_PUN_Pos 	(0x1U)
#define 	IO_CTRL0_MODE0_PUN_Msk 	(0x1UL << IO_CTRL0_MODE0_PUN_Pos) 	/*!< 0x00000002 */
#define 	IO_CTRL0_MODE0_PUN 	IO_CTRL0_MODE0_PUN_Msk
#define 	IO_CTRL0_MODE0_PDN_Pos 	(0x2U)
#define 	IO_CTRL0_MODE0_PDN_Msk 	(0x1UL << IO_CTRL0_MODE0_PDN_Pos) 	/*!< 0x00000004 */
#define 	IO_CTRL0_MODE0_PDN 	IO_CTRL0_MODE0_PDN_Msk
#define 	IO_CTRL0_MODE0_DRIVE_Pos 	(0x3U)
#define 	IO_CTRL0_MODE0_DRIVE_Msk 	(0x1UL << IO_CTRL0_MODE0_DRIVE_Pos) 	/*!< 0x00000008 */
#define 	IO_CTRL0_MODE0_DRIVE 	IO_CTRL0_MODE0_DRIVE_Msk
#define 	IO_CTRL0_MODE0_ENZI_Pos 	(0x4U)
#define 	IO_CTRL0_MODE0_ENZI_Msk 	(0x1UL << IO_CTRL0_MODE0_ENZI_Pos) 	/*!< 0x00000010 */
#define 	IO_CTRL0_MODE0_ENZI 	IO_CTRL0_MODE0_ENZI_Msk
#define 	IO_CTRL0_MODE1_EN_Pos 	(0x5U)
#define 	IO_CTRL0_MODE1_EN_Msk 	(0x1UL << IO_CTRL0_MODE1_EN_Pos) 	/*!< 0x00000020 */
#define 	IO_CTRL0_MODE1_EN 	IO_CTRL0_MODE1_EN_Msk
#define 	IO_CTRL0_MODE1_PUN_Pos 	(0x6U)
#define 	IO_CTRL0_MODE1_PUN_Msk 	(0x1UL << IO_CTRL0_MODE1_PUN_Pos) 	/*!< 0x00000040 */
#define 	IO_CTRL0_MODE1_PUN 	IO_CTRL0_MODE1_PUN_Msk
#define 	IO_CTRL0_MODE1_PDN_Pos 	(0x7U)
#define 	IO_CTRL0_MODE1_PDN_Msk 	(0x1UL << IO_CTRL0_MODE1_PDN_Pos) 	/*!< 0x00000080 */
#define 	IO_CTRL0_MODE1_PDN 	IO_CTRL0_MODE1_PDN_Msk
#define 	IO_CTRL0_MODE1_DRIVE_Pos 	(0x8U)
#define 	IO_CTRL0_MODE1_DRIVE_Msk 	(0x1UL << IO_CTRL0_MODE1_DRIVE_Pos) 	/*!< 0x00000100 */
#define 	IO_CTRL0_MODE1_DRIVE 	IO_CTRL0_MODE1_DRIVE_Msk
#define 	IO_CTRL0_MODE1_ENZI_Pos 	(0x9U)
#define 	IO_CTRL0_MODE1_ENZI_Msk 	(0x1UL << IO_CTRL0_MODE1_ENZI_Pos) 	/*!< 0x00000200 */
#define 	IO_CTRL0_MODE1_ENZI 	IO_CTRL0_MODE1_ENZI_Msk
#define 	IO_CTRL0_MIPIMODE_EN_Pos 	(0xAU)
#define 	IO_CTRL0_MIPIMODE_EN_Msk 	(0x1UL << IO_CTRL0_MIPIMODE_EN_Pos) 	/*!< 0x00000400 */
#define 	IO_CTRL0_MIPIMODE_EN 	IO_CTRL0_MIPIMODE_EN_Msk
#define 	IO_CTRL0_MIPIMODE_PUN_Pos 	(0xBU)
#define 	IO_CTRL0_MIPIMODE_PUN_Msk 	(0x1UL << IO_CTRL0_MIPIMODE_PUN_Pos) 	/*!< 0x00000800 */
#define 	IO_CTRL0_MIPIMODE_PUN 	IO_CTRL0_MIPIMODE_PUN_Msk
#define 	IO_CTRL0_MIPIMODE_PDN_Pos 	(0xCU)
#define 	IO_CTRL0_MIPIMODE_PDN_Msk 	(0x1UL << IO_CTRL0_MIPIMODE_PDN_Pos) 	/*!< 0x00001000 */
#define 	IO_CTRL0_MIPIMODE_PDN 	IO_CTRL0_MIPIMODE_PDN_Msk
#define 	IO_CTRL0_MIPIMODE_DRIVE_Pos 	(0xDU)
#define 	IO_CTRL0_MIPIMODE_DRIVE_Msk 	(0x1UL << IO_CTRL0_MIPIMODE_DRIVE_Pos) 	/*!< 0x00002000 */
#define 	IO_CTRL0_MIPIMODE_DRIVE 	IO_CTRL0_MIPIMODE_DRIVE_Msk
#define 	IO_CTRL0_MIPIMODE_ENZI_Pos 	(0xEU)
#define 	IO_CTRL0_MIPIMODE_ENZI_Msk 	(0x1UL << IO_CTRL0_MIPIMODE_ENZI_Pos) 	/*!< 0x00004000 */
#define 	IO_CTRL0_MIPIMODE_ENZI 	IO_CTRL0_MIPIMODE_ENZI_Msk
#define 	IO_CTRL0_HISTOMODE_EN_Pos 	(0xFU)
#define 	IO_CTRL0_HISTOMODE_EN_Msk 	(0x1UL << IO_CTRL0_HISTOMODE_EN_Pos) 	/*!< 0x00008000 */
#define 	IO_CTRL0_HISTOMODE_EN 	IO_CTRL0_HISTOMODE_EN_Msk
#define 	IO_CTRL0_HISTOMODE_PUN_Pos 	(0x10U)
#define 	IO_CTRL0_HISTOMODE_PUN_Msk 	(0x1UL << IO_CTRL0_HISTOMODE_PUN_Pos) 	/*!< 0x00010000 */
#define 	IO_CTRL0_HISTOMODE_PUN 	IO_CTRL0_HISTOMODE_PUN_Msk
#define 	IO_CTRL0_HISTOMODE_PDN_Pos 	(0x11U)
#define 	IO_CTRL0_HISTOMODE_PDN_Msk 	(0x1UL << IO_CTRL0_HISTOMODE_PDN_Pos) 	/*!< 0x00020000 */
#define 	IO_CTRL0_HISTOMODE_PDN 	IO_CTRL0_HISTOMODE_PDN_Msk
#define 	IO_CTRL0_HISTOMODE_DRIVE_Pos 	(0x12U)
#define 	IO_CTRL0_HISTOMODE_DRIVE_Msk 	(0x1UL << IO_CTRL0_HISTOMODE_DRIVE_Pos) 	/*!< 0x00040000 */
#define 	IO_CTRL0_HISTOMODE_DRIVE 	IO_CTRL0_HISTOMODE_DRIVE_Msk
#define 	IO_CTRL0_HISTOMODE_ENZI_Pos 	(0x13U)
#define 	IO_CTRL0_HISTOMODE_ENZI_Msk 	(0x1UL << IO_CTRL0_HISTOMODE_ENZI_Pos) 	/*!< 0x00080000 */
#define 	IO_CTRL0_HISTOMODE_ENZI 	IO_CTRL0_HISTOMODE_ENZI_Msk
#define 	IO_CTRL0_ROMMODE_EN_Pos 	(0x14U)
#define 	IO_CTRL0_ROMMODE_EN_Msk 	(0x1UL << IO_CTRL0_ROMMODE_EN_Pos) 	/*!< 0x00100000 */
#define 	IO_CTRL0_ROMMODE_EN 	IO_CTRL0_ROMMODE_EN_Msk
#define 	IO_CTRL0_ROMMODE_PUN_Pos 	(0x15U)
#define 	IO_CTRL0_ROMMODE_PUN_Msk 	(0x1UL << IO_CTRL0_ROMMODE_PUN_Pos) 	/*!< 0x00200000 */
#define 	IO_CTRL0_ROMMODE_PUN 	IO_CTRL0_ROMMODE_PUN_Msk
#define 	IO_CTRL0_ROMMODE_PDN_Pos 	(0x16U)
#define 	IO_CTRL0_ROMMODE_PDN_Msk 	(0x1UL << IO_CTRL0_ROMMODE_PDN_Pos) 	/*!< 0x00400000 */
#define 	IO_CTRL0_ROMMODE_PDN 	IO_CTRL0_ROMMODE_PDN_Msk
#define 	IO_CTRL0_ROMMODE_DRIVE_Pos 	(0x17U)
#define 	IO_CTRL0_ROMMODE_DRIVE_Msk 	(0x1UL << IO_CTRL0_ROMMODE_DRIVE_Pos) 	/*!< 0x00800000 */
#define 	IO_CTRL0_ROMMODE_DRIVE 	IO_CTRL0_ROMMODE_DRIVE_Msk
#define 	IO_CTRL0_ROMMODE_ENZI_Pos 	(0x18U)
#define 	IO_CTRL0_ROMMODE_ENZI_Msk 	(0x1UL << IO_CTRL0_ROMMODE_ENZI_Pos) 	/*!< 0x01000000 */
#define 	IO_CTRL0_ROMMODE_ENZI 	IO_CTRL0_ROMMODE_ENZI_Msk
#define 	IO_CTRL0_CLKI_EN_Pos 	(0x19U)
#define 	IO_CTRL0_CLKI_EN_Msk 	(0x1UL << IO_CTRL0_CLKI_EN_Pos) 	/*!< 0x02000000 */
#define 	IO_CTRL0_CLKI_EN 	IO_CTRL0_CLKI_EN_Msk
#define 	IO_CTRL0_CLKI_PUN_Pos 	(0x1AU)
#define 	IO_CTRL0_CLKI_PUN_Msk 	(0x1UL << IO_CTRL0_CLKI_PUN_Pos) 	/*!< 0x04000000 */
#define 	IO_CTRL0_CLKI_PUN 	IO_CTRL0_CLKI_PUN_Msk
#define 	IO_CTRL0_CLKI_PDN_Pos 	(0x1BU)
#define 	IO_CTRL0_CLKI_PDN_Msk 	(0x1UL << IO_CTRL0_CLKI_PDN_Pos) 	/*!< 0x08000000 */
#define 	IO_CTRL0_CLKI_PDN 	IO_CTRL0_CLKI_PDN_Msk
#define 	IO_CTRL0_CLKI_DRIVE_Pos 	(0x1CU)
#define 	IO_CTRL0_CLKI_DRIVE_Msk 	(0x1UL << IO_CTRL0_CLKI_DRIVE_Pos) 	/*!< 0x10000000 */
#define 	IO_CTRL0_CLKI_DRIVE 	IO_CTRL0_CLKI_DRIVE_Msk
#define 	IO_CTRL0_CLKI_ENZI_Pos 	(0x1DU)
#define 	IO_CTRL0_CLKI_ENZI_Msk 	(0x1UL << IO_CTRL0_CLKI_ENZI_Pos) 	/*!< 0x20000000 */
#define 	IO_CTRL0_CLKI_ENZI 	IO_CTRL0_CLKI_ENZI_Msk
#define 	IO_CTRL0_MIPIMODE_ZI_Pos 	(0x1EU)
#define 	IO_CTRL0_MIPIMODE_ZI_Msk 	(0x1UL << IO_CTRL0_MIPIMODE_ZI_Pos) 	/*!< 0x40000000 */
#define 	IO_CTRL0_MIPIMODE_ZI 	IO_CTRL0_MIPIMODE_ZI_Msk
#define 	IO_CTRL0_HISTOMODE_ZI_Pos 	(0x1FU)
#define 	IO_CTRL0_HISTOMODE_ZI_Msk 	(0x1UL << IO_CTRL0_HISTOMODE_ZI_Pos) 	/*!< 0x80000000 */
#define 	IO_CTRL0_HISTOMODE_ZI 	IO_CTRL0_HISTOMODE_ZI_Msk
#define IO_CTRL1 	(0x00000604UL) 	/*<! Input Output PAD, Control registers 1 */
#define 	IO_CTRL1_RSTN_EN_Pos 	(0x0U)
#define 	IO_CTRL1_RSTN_EN_Msk 	(0x1UL << IO_CTRL1_RSTN_EN_Pos) 	/*!< 0x00000001 */
#define 	IO_CTRL1_RSTN_EN 	IO_CTRL1_RSTN_EN_Msk
#define 	IO_CTRL1_RSTN_PUN_Pos 	(0x1U)
#define 	IO_CTRL1_RSTN_PUN_Msk 	(0x1UL << IO_CTRL1_RSTN_PUN_Pos) 	/*!< 0x00000002 */
#define 	IO_CTRL1_RSTN_PUN 	IO_CTRL1_RSTN_PUN_Msk
#define 	IO_CTRL1_RSTN_PDN_Pos 	(0x2U)
#define 	IO_CTRL1_RSTN_PDN_Msk 	(0x1UL << IO_CTRL1_RSTN_PDN_Pos) 	/*!< 0x00000004 */
#define 	IO_CTRL1_RSTN_PDN 	IO_CTRL1_RSTN_PDN_Msk
#define 	IO_CTRL1_RSTN_DRIVE_Pos 	(0x3U)
