jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	IO_CTRL1_RSTN_DRIVE_Msk 	(0x1UL << IO_CTRL1_RSTN_DRIVE_Pos) 	/*!< 0x00000008 */
#define 	IO_CTRL1_RSTN_DRIVE 	IO_CTRL1_RSTN_DRIVE_Msk
#define 	IO_CTRL1_RSTN_ENZI_Pos 	(0x4U)
#define 	IO_CTRL1_RSTN_ENZI_Msk 	(0x1UL << IO_CTRL1_RSTN_ENZI_Pos) 	/*!< 0x00000010 */
#define 	IO_CTRL1_RSTN_ENZI 	IO_CTRL1_RSTN_ENZI_Msk
#define 	IO_CTRL1_SPICLK_EN_Pos 	(0x5U)
#define 	IO_CTRL1_SPICLK_EN_Msk 	(0x1UL << IO_CTRL1_SPICLK_EN_Pos) 	/*!< 0x00000020 */
#define 	IO_CTRL1_SPICLK_EN 	IO_CTRL1_SPICLK_EN_Msk
#define 	IO_CTRL1_SPICLK_PUN_Pos 	(0x6U)
#define 	IO_CTRL1_SPICLK_PUN_Msk 	(0x1UL << IO_CTRL1_SPICLK_PUN_Pos) 	/*!< 0x00000040 */
#define 	IO_CTRL1_SPICLK_PUN 	IO_CTRL1_SPICLK_PUN_Msk
#define 	IO_CTRL1_SPICLK_PDN_Pos 	(0x7U)
#define 	IO_CTRL1_SPICLK_PDN_Msk 	(0x1UL << IO_CTRL1_SPICLK_PDN_Pos) 	/*!< 0x00000080 */
#define 	IO_CTRL1_SPICLK_PDN 	IO_CTRL1_SPICLK_PDN_Msk
#define 	IO_CTRL1_SPICLK_DRIVE_Pos 	(0x8U)
#define 	IO_CTRL1_SPICLK_DRIVE_Msk 	(0x1UL << IO_CTRL1_SPICLK_DRIVE_Pos) 	/*!< 0x00000100 */
#define 	IO_CTRL1_SPICLK_DRIVE 	IO_CTRL1_SPICLK_DRIVE_Msk
#define 	IO_CTRL1_SPICLK_ENZI_Pos 	(0x9U)
#define 	IO_CTRL1_SPICLK_ENZI_Msk 	(0x1UL << IO_CTRL1_SPICLK_ENZI_Pos) 	/*!< 0x00000200 */
#define 	IO_CTRL1_SPICLK_ENZI 	IO_CTRL1_SPICLK_ENZI_Msk
#define 	IO_CTRL1_SPIMOSI_EN_Pos 	(0xAU)
#define 	IO_CTRL1_SPIMOSI_EN_Msk 	(0x1UL << IO_CTRL1_SPIMOSI_EN_Pos) 	/*!< 0x00000400 */
#define 	IO_CTRL1_SPIMOSI_EN 	IO_CTRL1_SPIMOSI_EN_Msk
#define 	IO_CTRL1_SPIMOSI_PUN_Pos 	(0xBU)
#define 	IO_CTRL1_SPIMOSI_PUN_Msk 	(0x1UL << IO_CTRL1_SPIMOSI_PUN_Pos) 	/*!< 0x00000800 */
#define 	IO_CTRL1_SPIMOSI_PUN 	IO_CTRL1_SPIMOSI_PUN_Msk
#define 	IO_CTRL1_SPIMOSI_PDN_Pos 	(0xCU)
#define 	IO_CTRL1_SPIMOSI_PDN_Msk 	(0x1UL << IO_CTRL1_SPIMOSI_PDN_Pos) 	/*!< 0x00001000 */
#define 	IO_CTRL1_SPIMOSI_PDN 	IO_CTRL1_SPIMOSI_PDN_Msk
#define 	IO_CTRL1_SPIMOSI_DRIVE_Pos 	(0xDU)
#define 	IO_CTRL1_SPIMOSI_DRIVE_Msk 	(0x1UL << IO_CTRL1_SPIMOSI_DRIVE_Pos) 	/*!< 0x00002000 */
#define 	IO_CTRL1_SPIMOSI_DRIVE 	IO_CTRL1_SPIMOSI_DRIVE_Msk
#define 	IO_CTRL1_SPIMOSI_ENZI_Pos 	(0xEU)
#define 	IO_CTRL1_SPIMOSI_ENZI_Msk 	(0x1UL << IO_CTRL1_SPIMOSI_ENZI_Pos) 	/*!< 0x00004000 */
#define 	IO_CTRL1_SPIMOSI_ENZI 	IO_CTRL1_SPIMOSI_ENZI_Msk
#define 	IO_CTRL1_SPIMISO_EN_Pos 	(0xFU)
#define 	IO_CTRL1_SPIMISO_EN_Msk 	(0x1UL << IO_CTRL1_SPIMISO_EN_Pos) 	/*!< 0x00008000 */
#define 	IO_CTRL1_SPIMISO_EN 	IO_CTRL1_SPIMISO_EN_Msk
#define 	IO_CTRL1_SPIMISO_PUN_Pos 	(0x10U)
#define 	IO_CTRL1_SPIMISO_PUN_Msk 	(0x1UL << IO_CTRL1_SPIMISO_PUN_Pos) 	/*!< 0x00010000 */
#define 	IO_CTRL1_SPIMISO_PUN 	IO_CTRL1_SPIMISO_PUN_Msk
#define 	IO_CTRL1_SPIMISO_PDN_Pos 	(0x11U)
#define 	IO_CTRL1_SPIMISO_PDN_Msk 	(0x1UL << IO_CTRL1_SPIMISO_PDN_Pos) 	/*!< 0x00020000 */
#define 	IO_CTRL1_SPIMISO_PDN 	IO_CTRL1_SPIMISO_PDN_Msk
#define 	IO_CTRL1_SPIMISO_DRIVE_Pos 	(0x12U)
#define 	IO_CTRL1_SPIMISO_DRIVE_Msk 	(0x1UL << IO_CTRL1_SPIMISO_DRIVE_Pos) 	/*!< 0x00040000 */
#define 	IO_CTRL1_SPIMISO_DRIVE 	IO_CTRL1_SPIMISO_DRIVE_Msk
#define 	IO_CTRL1_SPIMISO_ENZI_Pos 	(0x13U)
#define 	IO_CTRL1_SPIMISO_ENZI_Msk 	(0x1UL << IO_CTRL1_SPIMISO_ENZI_Pos) 	/*!< 0x00080000 */
#define 	IO_CTRL1_SPIMISO_ENZI 	IO_CTRL1_SPIMISO_ENZI_Msk
#define 	IO_CTRL1_SPICSN_EN_Pos 	(0x14U)
#define 	IO_CTRL1_SPICSN_EN_Msk 	(0x1UL << IO_CTRL1_SPICSN_EN_Pos) 	/*!< 0x00100000 */
#define 	IO_CTRL1_SPICSN_EN 	IO_CTRL1_SPICSN_EN_Msk
#define 	IO_CTRL1_SPICSN_PUN_Pos 	(0x15U)
#define 	IO_CTRL1_SPICSN_PUN_Msk 	(0x1UL << IO_CTRL1_SPICSN_PUN_Pos) 	/*!< 0x00200000 */
#define 	IO_CTRL1_SPICSN_PUN 	IO_CTRL1_SPICSN_PUN_Msk
#define 	IO_CTRL1_SPICSN_PDN_Pos 	(0x16U)
#define 	IO_CTRL1_SPICSN_PDN_Msk 	(0x1UL << IO_CTRL1_SPICSN_PDN_Pos) 	/*!< 0x00400000 */
#define 	IO_CTRL1_SPICSN_PDN 	IO_CTRL1_SPICSN_PDN_Msk
#define 	IO_CTRL1_SPICSN_DRIVE_Pos 	(0x17U)
#define 	IO_CTRL1_SPICSN_DRIVE_Msk 	(0x1UL << IO_CTRL1_SPICSN_DRIVE_Pos) 	/*!< 0x00800000 */
#define 	IO_CTRL1_SPICSN_DRIVE 	IO_CTRL1_SPICSN_DRIVE_Msk
#define 	IO_CTRL1_SPICSN_ENZI_Pos 	(0x18U)
#define 	IO_CTRL1_SPICSN_ENZI_Msk 	(0x1UL << IO_CTRL1_SPICSN_ENZI_Pos) 	/*!< 0x01000000 */
#define 	IO_CTRL1_SPICSN_ENZI 	IO_CTRL1_SPICSN_ENZI_Msk
#define 	IO_CTRL1_I2CADDR_EN_Pos 	(0x19U)
#define 	IO_CTRL1_I2CADDR_EN_Msk 	(0x1UL << IO_CTRL1_I2CADDR_EN_Pos) 	/*!< 0x02000000 */
#define 	IO_CTRL1_I2CADDR_EN 	IO_CTRL1_I2CADDR_EN_Msk
#define 	IO_CTRL1_I2CADDR_PUN_Pos 	(0x1AU)
#define 	IO_CTRL1_I2CADDR_PUN_Msk 	(0x1UL << IO_CTRL1_I2CADDR_PUN_Pos) 	/*!< 0x04000000 */
#define 	IO_CTRL1_I2CADDR_PUN 	IO_CTRL1_I2CADDR_PUN_Msk
#define 	IO_CTRL1_I2CADDR_PDN_Pos 	(0x1BU)
#define 	IO_CTRL1_I2CADDR_PDN_Msk 	(0x1UL << IO_CTRL1_I2CADDR_PDN_Pos) 	/*!< 0x08000000 */
#define 	IO_CTRL1_I2CADDR_PDN 	IO_CTRL1_I2CADDR_PDN_Msk
#define 	IO_CTRL1_I2CADDR_DRIVE_Pos 	(0x1CU)
#define 	IO_CTRL1_I2CADDR_DRIVE_Msk 	(0x1UL << IO_CTRL1_I2CADDR_DRIVE_Pos) 	/*!< 0x10000000 */
#define 	IO_CTRL1_I2CADDR_DRIVE 	IO_CTRL1_I2CADDR_DRIVE_Msk
#define 	IO_CTRL1_I2CADDR_ENZI_Pos 	(0x1DU)
#define 	IO_CTRL1_I2CADDR_ENZI_Msk 	(0x1UL << IO_CTRL1_I2CADDR_ENZI_Pos) 	/*!< 0x20000000 */
#define 	IO_CTRL1_I2CADDR_ENZI 	IO_CTRL1_I2CADDR_ENZI_Msk
#define IO_CTRL2 	(0x00000608UL) 	/*<! Input Output PAD, Control registers 2 */
#define 	IO_CTRL2_SYNC_EN_Pos 	(0x0U)
#define 	IO_CTRL2_SYNC_EN_Msk 	(0x1UL << IO_CTRL2_SYNC_EN_Pos) 	/*!< 0x00000001 */
#define 	IO_CTRL2_SYNC_EN 	IO_CTRL2_SYNC_EN_Msk
#define 	IO_CTRL2_SYNC_PUN_Pos 	(0x1U)
#define 	IO_CTRL2_SYNC_PUN_Msk 	(0x1UL << IO_CTRL2_SYNC_PUN_Pos) 	/*!< 0x00000002 */
#define 	IO_CTRL2_SYNC_PUN 	IO_CTRL2_SYNC_PUN_Msk
#define 	IO_CTRL2_SYNC_PDN_Pos 	(0x2U)
#define 	IO_CTRL2_SYNC_PDN_Msk 	(0x1UL << IO_CTRL2_SYNC_PDN_Pos) 	/*!< 0x00000004 */
#define 	IO_CTRL2_SYNC_PDN 	IO_CTRL2_SYNC_PDN_Msk
#define 	IO_CTRL2_SYNC_DRIVE_Pos 	(0x3U)
#define 	IO_CTRL2_SYNC_DRIVE_Msk 	(0x1UL << IO_CTRL2_SYNC_DRIVE_Pos) 	/*!< 0x00000008 */
#define 	IO_CTRL2_SYNC_DRIVE 	IO_CTRL2_SYNC_DRIVE_Msk
#define 	IO_CTRL2_SYNC_ENZI_Pos 	(0x4U)
#define 	IO_CTRL2_SYNC_ENZI_Msk 	(0x1UL << IO_CTRL2_SYNC_ENZI_Pos) 	/*!< 0x00000010 */
#define 	IO_CTRL2_SYNC_ENZI 	IO_CTRL2_SYNC_ENZI_Msk
#define 	IO_CTRL2_PXRSTN_EN_Pos 	(0x5U)
#define 	IO_CTRL2_PXRSTN_EN_Msk 	(0x1UL << IO_CTRL2_PXRSTN_EN_Pos) 	/*!< 0x00000020 */
#define 	IO_CTRL2_PXRSTN_EN 	IO_CTRL2_PXRSTN_EN_Msk
#define 	IO_CTRL2_PXRSTN_PUN_Pos 	(0x6U)
#define 	IO_CTRL2_PXRSTN_PUN_Msk 	(0x1UL << IO_CTRL2_PXRSTN_PUN_Pos) 	/*!< 0x00000040 */
#define 	IO_CTRL2_PXRSTN_PUN 	IO_CTRL2_PXRSTN_PUN_Msk
#define 	IO_CTRL2_PXRSTN_PDN_Pos 	(0x7U)
#define 	IO_CTRL2_PXRSTN_PDN_Msk 	(0x1UL << IO_CTRL2_PXRSTN_PDN_Pos) 	/*!< 0x00000080 */
#define 	IO_CTRL2_PXRSTN_PDN 	IO_CTRL2_PXRSTN_PDN_Msk
#define 	IO_CTRL2_PXRSTN_DRIVE_Pos 	(0x8U)
#define 	IO_CTRL2_PXRSTN_DRIVE_Msk 	(0x1UL << IO_CTRL2_PXRSTN_DRIVE_Pos) 	/*!< 0x00000100 */
#define 	IO_CTRL2_PXRSTN_DRIVE 	IO_CTRL2_PXRSTN_DRIVE_Msk
#define 	IO_CTRL2_PXRSTN_ENZI_Pos 	(0x9U)
#define 	IO_CTRL2_PXRSTN_ENZI_Msk 	(0x1UL << IO_CTRL2_PXRSTN_ENZI_Pos) 	/*!< 0x00000200 */
#define 	IO_CTRL2_PXRSTN_ENZI 	IO_CTRL2_PXRSTN_ENZI_Msk
#define 	IO_CTRL2_EXTTRIG_EN_Pos 	(0xAU)
#define 	IO_CTRL2_EXTTRIG_EN_Msk 	(0x1UL << IO_CTRL2_EXTTRIG_EN_Pos) 	/*!< 0x00000400 */
#define 	IO_CTRL2_EXTTRIG_EN 	IO_CTRL2_EXTTRIG_EN_Msk
#define 	IO_CTRL2_EXTTRIG_PUN_Pos 	(0xBU)
#define 	IO_CTRL2_EXTTRIG_PUN_Msk 	(0x1UL << IO_CTRL2_EXTTRIG_PUN_Pos) 	/*!< 0x00000800 */
#define 	IO_CTRL2_EXTTRIG_PUN 	IO_CTRL2_EXTTRIG_PUN_Msk
#define 	IO_CTRL2_EXTTRIG_PDN_Pos 	(0xCU)
#define 	IO_CTRL2_EXTTRIG_PDN_Msk 	(0x1UL << IO_CTRL2_EXTTRIG_PDN_Pos) 	/*!< 0x00001000 */
#define 	IO_CTRL2_EXTTRIG_PDN 	IO_CTRL2_EXTTRIG_PDN_Msk
#define 	IO_CTRL2_EXTTRIG_DRIVE_Pos 	(0xDU)
#define 	IO_CTRL2_EXTTRIG_DRIVE_Msk 	(0x1UL << IO_CTRL2_EXTTRIG_DRIVE_Pos) 	/*!< 0x00002000 */
#define 	IO_CTRL2_EXTTRIG_DRIVE 	IO_CTRL2_EXTTRIG_DRIVE_Msk
#define 	IO_CTRL2_EXTTRIG_ENZI_Pos 	(0xEU)
#define 	IO_CTRL2_EXTTRIG_ENZI_Msk 	(0x1UL << IO_CTRL2_EXTTRIG_ENZI_Pos) 	/*!< 0x00004000 */
#define 	IO_CTRL2_EXTTRIG_ENZI 	IO_CTRL2_EXTTRIG_ENZI_Msk
#define 	IO_CTRL2_DGPIO_EN_Pos 	(0xFU)
#define 	IO_CTRL2_DGPIO_EN_Msk 	(0x1UL << IO_CTRL2_DGPIO_EN_Pos) 	/*!< 0x00008000 */
#define 	IO_CTRL2_DGPIO_EN 	IO_CTRL2_DGPIO_EN_Msk
#define 	IO_CTRL2_DGPIO_PUN_Pos 	(0x10U)
#define 	IO_CTRL2_DGPIO_PUN_Msk 	(0x1UL << IO_CTRL2_DGPIO_PUN_Pos) 	/*!< 0x00010000 */
#define 	IO_CTRL2_DGPIO_PUN 	IO_CTRL2_DGPIO_PUN_Msk
#define 	IO_CTRL2_DGPIO_PDN_Pos 	(0x11U)
#define 	IO_CTRL2_DGPIO_PDN_Msk 	(0x1UL << IO_CTRL2_DGPIO_PDN_Pos) 	/*!< 0x00020000 */
#define 	IO_CTRL2_DGPIO_PDN 	IO_CTRL2_DGPIO_PDN_Msk
#define 	IO_CTRL2_DGPIO_DRIVE_Pos 	(0x12U)
#define 	IO_CTRL2_DGPIO_DRIVE_Msk 	(0x1UL << IO_CTRL2_DGPIO_DRIVE_Pos) 	/*!< 0x00040000 */
#define 	IO_CTRL2_DGPIO_DRIVE 	IO_CTRL2_DGPIO_DRIVE_Msk
#define 	IO_CTRL2_DGPIO_ENZI_Pos 	(0x13U)
#define 	IO_CTRL2_DGPIO_ENZI_Msk 	(0x1UL << IO_CTRL2_DGPIO_ENZI_Pos) 	/*!< 0x00080000 */
#define 	IO_CTRL2_DGPIO_ENZI 	IO_CTRL2_DGPIO_ENZI_Msk
#define 	IO_CTRL2_PIXCLK_EN_Pos 	(0x14U)
#define 	IO_CTRL2_PIXCLK_EN_Msk 	(0x1UL << IO_CTRL2_PIXCLK_EN_Pos) 	/*!< 0x00100000 */
#define 	IO_CTRL2_PIXCLK_EN 	IO_CTRL2_PIXCLK_EN_Msk
#define 	IO_CTRL2_PIXCLK_PUN_Pos 	(0x15U)
#define 	IO_CTRL2_PIXCLK_PUN_Msk 	(0x1UL << IO_CTRL2_PIXCLK_PUN_Pos) 	/*!< 0x00200000 */
#define 	IO_CTRL2_PIXCLK_PUN 	IO_CTRL2_PIXCLK_PUN_Msk
#define 	IO_CTRL2_PIXCLK_PDN_Pos 	(0x16U)
#define 	IO_CTRL2_PIXCLK_PDN_Msk 	(0x1UL << IO_CTRL2_PIXCLK_PDN_Pos) 	/*!< 0x00400000 */
#define 	IO_CTRL2_PIXCLK_PDN 	IO_CTRL2_PIXCLK_PDN_Msk
#define 	IO_CTRL2_PIXCLK_DRIVE_Pos 	(0x17U)
#define 	IO_CTRL2_PIXCLK_DRIVE_Msk 	(0x1UL << IO_CTRL2_PIXCLK_DRIVE_Pos) 	/*!< 0x00800000 */
#define 	IO_CTRL2_PIXCLK_DRIVE 	IO_CTRL2_PIXCLK_DRIVE_Msk
#define 	IO_CTRL2_PIXCLK_ENZI_Pos 	(0x18U)
#define 	IO_CTRL2_PIXCLK_ENZI_Msk 	(0x1UL << IO_CTRL2_PIXCLK_ENZI_Pos) 	/*!< 0x01000000 */
#define 	IO_CTRL2_PIXCLK_ENZI 	IO_CTRL2_PIXCLK_ENZI_Msk
#define 	IO_CTRL2_HSYNC_EN_Pos 	(0x19U)
#define 	IO_CTRL2_HSYNC_EN_Msk 	(0x1UL << IO_CTRL2_HSYNC_EN_Pos) 	/*!< 0x02000000 */
#define 	IO_CTRL2_HSYNC_EN 	IO_CTRL2_HSYNC_EN_Msk
#define 	IO_CTRL2_HSYNC_PUN_Pos 	(0x1AU)
#define 	IO_CTRL2_HSYNC_PUN_Msk 	(0x1UL << IO_CTRL2_HSYNC_PUN_Pos) 	/*!< 0x04000000 */
#define 	IO_CTRL2_HSYNC_PUN 	IO_CTRL2_HSYNC_PUN_Msk
#define 	IO_CTRL2_HSYNC_PDN_Pos 	(0x1BU)
#define 	IO_CTRL2_HSYNC_PDN_Msk 	(0x1UL << IO_CTRL2_HSYNC_PDN_Pos) 	/*!< 0x08000000 */
#define 	IO_CTRL2_HSYNC_PDN 	IO_CTRL2_HSYNC_PDN_Msk
#define 	IO_CTRL2_HSYNC_DRIVE_Pos 	(0x1CU)
#define 	IO_CTRL2_HSYNC_DRIVE_Msk 	(0x1UL << IO_CTRL2_HSYNC_DRIVE_Pos) 	/*!< 0x10000000 */
#define 	IO_CTRL2_HSYNC_DRIVE 	IO_CTRL2_HSYNC_DRIVE_Msk
#define 	IO_CTRL2_HSYNC_ENZI_Pos 	(0x1DU)
#define 	IO_CTRL2_HSYNC_ENZI_Msk 	(0x1UL << IO_CTRL2_HSYNC_ENZI_Pos) 	/*!< 0x20000000 */
#define 	IO_CTRL2_HSYNC_ENZI 	IO_CTRL2_HSYNC_ENZI_Msk
#define IO_CTRL3 	(0x0000060CUL) 	/*<! Input Output PAD, Control registers 3 */
#define 	IO_CTRL3_VSYNC_EN_Pos 	(0x0U)
#define 	IO_CTRL3_VSYNC_EN_Msk 	(0x1UL << IO_CTRL3_VSYNC_EN_Pos) 	/*!< 0x00000001 */
#define 	IO_CTRL3_VSYNC_EN 	IO_CTRL3_VSYNC_EN_Msk
#define 	IO_CTRL3_VSYNC_PUN_Pos 	(0x1U)
#define 	IO_CTRL3_VSYNC_PUN_Msk 	(0x1UL << IO_CTRL3_VSYNC_PUN_Pos) 	/*!< 0x00000002 */
#define 	IO_CTRL3_VSYNC_PUN 	IO_CTRL3_VSYNC_PUN_Msk
#define 	IO_CTRL3_VSYNC_PDN_Pos 	(0x2U)
#define 	IO_CTRL3_VSYNC_PDN_Msk 	(0x1UL << IO_CTRL3_VSYNC_PDN_Pos) 	/*!< 0x00000004 */
#define 	IO_CTRL3_VSYNC_PDN 	IO_CTRL3_VSYNC_PDN_Msk
#define 	IO_CTRL3_VSYNC_DRIVE_Pos 	(0x3U)
#define 	IO_CTRL3_VSYNC_DRIVE_Msk 	(0x1UL << IO_CTRL3_VSYNC_DRIVE_Pos) 	/*!< 0x00000008 */
#define 	IO_CTRL3_VSYNC_DRIVE 	IO_CTRL3_VSYNC_DRIVE_Msk
#define 	IO_CTRL3_VSYNC_ENZI_Pos 	(0x4U)
#define 	IO_CTRL3_VSYNC_ENZI_Msk 	(0x1UL << IO_CTRL3_VSYNC_ENZI_Pos) 	/*!< 0x00000010 */
#define 	IO_CTRL3_VSYNC_ENZI 	IO_CTRL3_VSYNC_ENZI_Msk
#define 	IO_CTRL3_D0_EN_Pos 	(0x5U)
#define 	IO_CTRL3_D0_EN_Msk 	(0x1UL << IO_CTRL3_D0_EN_Pos) 	/*!< 0x00000020 */
#define 	IO_CTRL3_D0_EN 	IO_CTRL3_D0_EN_Msk
#define 	IO_CTRL3_D0_PUN_Pos 	(0x6U)
#define 	IO_CTRL3_D0_PUN_Msk 	(0x1UL << IO_CTRL3_D0_PUN_Pos) 	/*!< 0x00000040 */
#define 	IO_CTRL3_D0_PUN 	IO_CTRL3_D0_PUN_Msk
#define 	IO_CTRL3_D0_PDN_Pos 	(0x7U)
#define 	IO_CTRL3_D0_PDN_Msk 	(0x1UL << IO_CTRL3_D0_PDN_Pos) 	/*!< 0x00000080 */
#define 	IO_CTRL3_D0_PDN 	IO_CTRL3_D0_PDN_Msk
#define 	IO_CTRL3_D0_DRIVE_Pos 	(0x8U)
#define 	IO_CTRL3_D0_DRIVE_Msk 	(0x1UL << IO_CTRL3_D0_DRIVE_Pos) 	/*!< 0x00000100 */
#define 	IO_CTRL3_D0_DRIVE 	IO_CTRL3_D0_DRIVE_Msk
#define 	IO_CTRL3_D0_ENZI_Pos 	(0x9U)
#define 	IO_CTRL3_D0_ENZI_Msk 	(0x1UL << IO_CTRL3_D0_ENZI_Pos) 	/*!< 0x00000200 */
#define 	IO_CTRL3_D0_ENZI 	IO_CTRL3_D0_ENZI_Msk
#define 	IO_CTRL3_D1_EN_Pos 	(0xAU)
#define 	IO_CTRL3_D1_EN_Msk 	(0x1UL << IO_CTRL3_D1_EN_Pos) 	/*!< 0x00000400 */
#define 	IO_CTRL3_D1_EN 	IO_CTRL3_D1_EN_Msk
#define 	IO_CTRL3_D1_PUN_Pos 	(0xBU)
#define 	IO_CTRL3_D1_PUN_Msk 	(0x1UL << IO_CTRL3_D1_PUN_Pos) 	/*!< 0x00000800 */
#define 	IO_CTRL3_D1_PUN 	IO_CTRL3_D1_PUN_Msk
#define 	IO_CTRL3_D1_PDN_Pos 	(0xCU)
#define 	IO_CTRL3_D1_PDN_Msk 	(0x1UL << IO_CTRL3_D1_PDN_Pos) 	/*!< 0x00001000 */
#define 	IO_CTRL3_D1_PDN 	IO_CTRL3_D1_PDN_Msk
#define 	IO_CTRL3_D1_DRIVE_Pos 	(0xDU)
#define 	IO_CTRL3_D1_DRIVE_Msk 	(0x1UL << IO_CTRL3_D1_DRIVE_Pos) 	/*!< 0x00002000 */
#define 	IO_CTRL3_D1_DRIVE 	IO_CTRL3_D1_DRIVE_Msk
#define 	IO_CTRL3_D1_ENZI_Pos 	(0xEU)
#define 	IO_CTRL3_D1_ENZI_Msk 	(0x1UL << IO_CTRL3_D1_ENZI_Pos) 	/*!< 0x00004000 */
#define 	IO_CTRL3_D1_ENZI 	IO_CTRL3_D1_ENZI_Msk
#define 	IO_CTRL3_D2_EN_Pos 	(0xFU)
#define 	IO_CTRL3_D2_EN_Msk 	(0x1UL << IO_CTRL3_D2_EN_Pos) 	/*!< 0x00008000 */
#define 	IO_CTRL3_D2_EN 	IO_CTRL3_D2_EN_Msk
#define 	IO_CTRL3_D2_PUN_Pos 	(0x10U)
#define 	IO_CTRL3_D2_PUN_Msk 	(0x1UL << IO_CTRL3_D2_PUN_Pos) 	/*!< 0x00010000 */
#define 	IO_CTRL3_D2_PUN 	IO_CTRL3_D2_PUN_Msk
#define 	IO_CTRL3_D2_PDN_Pos 	(0x11U)
#define 	IO_CTRL3_D2_PDN_Msk 	(0x1UL << IO_CTRL3_D2_PDN_Pos) 	/*!< 0x00020000 */
#define 	IO_CTRL3_D2_PDN 	IO_CTRL3_D2_PDN_Msk
#define 	IO_CTRL3_D2_DRIVE_Pos 	(0x12U)
#define 	IO_CTRL3_D2_DRIVE_Msk 	(0x1UL << IO_CTRL3_D2_DRIVE_Pos) 	/*!< 0x00040000 */
#define 	IO_CTRL3_D2_DRIVE 	IO_CTRL3_D2_DRIVE_Msk
#define 	IO_CTRL3_D2_ENZI_Pos 	(0x13U)
#define 	IO_CTRL3_D2_ENZI_Msk 	(0x1UL << IO_CTRL3_D2_ENZI_Pos) 	/*!< 0x00080000 */
#define 	IO_CTRL3_D2_ENZI 	IO_CTRL3_D2_ENZI_Msk
#define 	IO_CTRL3_D3_EN_Pos 	(0x14U)
#define 	IO_CTRL3_D3_EN_Msk 	(0x1UL << IO_CTRL3_D3_EN_Pos) 	/*!< 0x00100000 */
#define 	IO_CTRL3_D3_EN 	IO_CTRL3_D3_EN_Msk
#define 	IO_CTRL3_D3_PUN_Pos 	(0x15U)
#define 	IO_CTRL3_D3_PUN_Msk 	(0x1UL << IO_CTRL3_D3_PUN_Pos) 	/*!< 0x00200000 */
#define 	IO_CTRL3_D3_PUN 	IO_CTRL3_D3_PUN_Msk
#define 	IO_CTRL3_D3_PDN_Pos 	(0x16U)
#define 	IO_CTRL3_D3_PDN_Msk 	(0x1UL << IO_CTRL3_D3_PDN_Pos) 	/*!< 0x00400000 */
#define 	IO_CTRL3_D3_PDN 	IO_CTRL3_D3_PDN_Msk
#define 	IO_CTRL3_D3_DRIVE_Pos 	(0x17U)
#define 	IO_CTRL3_D3_DRIVE_Msk 	(0x1UL << IO_CTRL3_D3_DRIVE_Pos) 	/*!< 0x00800000 */
#define 	IO_CTRL3_D3_DRIVE 	IO_CTRL3_D3_DRIVE_Msk
#define 	IO_CTRL3_D3_ENZI_Pos 	(0x18U)
#define 	IO_CTRL3_D3_ENZI_Msk 	(0x1UL << IO_CTRL3_D3_ENZI_Pos) 	/*!< 0x01000000 */
#define 	IO_CTRL3_D3_ENZI 	IO_CTRL3_D3_ENZI_Msk
#define 	IO_CTRL3_D4_EN_Pos 	(0x19U)
#define 	IO_CTRL3_D4_EN_Msk 	(0x1UL << IO_CTRL3_D4_EN_Pos) 	/*!< 0x02000000 */
#define 	IO_CTRL3_D4_EN 	IO_CTRL3_D4_EN_Msk
#define 	IO_CTRL3_D4_PUN_Pos 	(0x1AU)
#define 	IO_CTRL3_D4_PUN_Msk 	(0x1UL << IO_CTRL3_D4_PUN_Pos) 	/*!< 0x04000000 */
#define 	IO_CTRL3_D4_PUN 	IO_CTRL3_D4_PUN_Msk
#define 	IO_CTRL3_D4_PDN_Pos 	(0x1BU)
#define 	IO_CTRL3_D4_PDN_Msk 	(0x1UL << IO_CTRL3_D4_PDN_Pos) 	/*!< 0x08000000 */
#define 	IO_CTRL3_D4_PDN 	IO_CTRL3_D4_PDN_Msk
#define 	IO_CTRL3_D4_DRIVE_Pos 	(0x1CU)
#define 	IO_CTRL3_D4_DRIVE_Msk 	(0x1UL << IO_CTRL3_D4_DRIVE_Pos) 	/*!< 0x10000000 */
#define 	IO_CTRL3_D4_DRIVE 	IO_CTRL3_D4_DRIVE_Msk
#define 	IO_CTRL3_D4_ENZI_Pos 	(0x1DU)
#define 	IO_CTRL3_D4_ENZI_Msk 	(0x1UL << IO_CTRL3_D4_ENZI_Pos) 	/*!< 0x20000000 */
#define 	IO_CTRL3_D4_ENZI 	IO_CTRL3_D4_ENZI_Msk
#define IO_CTRL4 	(0x00000610UL) 	/*<! Input Output PAD, Control registers 4 */
#define 	IO_CTRL4_D5_EN_Pos 	(0x0U)
#define 	IO_CTRL4_D5_EN_Msk 	(0x1UL << IO_CTRL4_D5_EN_Pos) 	/*!< 0x00000001 */
#define 	IO_CTRL4_D5_EN 	IO_CTRL4_D5_EN_Msk
#define 	IO_CTRL4_D5_PUN_Pos 	(0x1U)
#define 	IO_CTRL4_D5_PUN_Msk 	(0x1UL << IO_CTRL4_D5_PUN_Pos) 	/*!< 0x00000002 */
#define 	IO_CTRL4_D5_PUN 	IO_CTRL4_D5_PUN_Msk
#define 	IO_CTRL4_D5_PDN_Pos 	(0x2U)
#define 	IO_CTRL4_D5_PDN_Msk 	(0x1UL << IO_CTRL4_D5_PDN_Pos) 	/*!< 0x00000004 */
#define 	IO_CTRL4_D5_PDN 	IO_CTRL4_D5_PDN_Msk
#define 	IO_CTRL4_D5_DRIVE_Pos 	(0x3U)
#define 	IO_CTRL4_D5_DRIVE_Msk 	(0x1UL << IO_CTRL4_D5_DRIVE_Pos) 	/*!< 0x00000008 */
#define 	IO_CTRL4_D5_DRIVE 	IO_CTRL4_D5_DRIVE_Msk
#define 	IO_CTRL4_D5_ENZI_Pos 	(0x4U)
#define 	IO_CTRL4_D5_ENZI_Msk 	(0x1UL << IO_CTRL4_D5_ENZI_Pos) 	/*!< 0x00000010 */
#define 	IO_CTRL4_D5_ENZI 	IO_CTRL4_D5_ENZI_Msk
#define 	IO_CTRL4_D6_EN_Pos 	(0x5U)
#define 	IO_CTRL4_D6_EN_Msk 	(0x1UL << IO_CTRL4_D6_EN_Pos) 	/*!< 0x00000020 */
#define 	IO_CTRL4_D6_EN 	IO_CTRL4_D6_EN_Msk
#define 	IO_CTRL4_D6_PUN_Pos 	(0x6U)
#define 	IO_CTRL4_D6_PUN_Msk 	(0x1UL << IO_CTRL4_D6_PUN_Pos) 	/*!< 0x00000040 */
#define 	IO_CTRL4_D6_PUN 	IO_CTRL4_D6_PUN_Msk
#define 	IO_CTRL4_D6_PDN_Pos 	(0x7U)
#define 	IO_CTRL4_D6_PDN_Msk 	(0x1UL << IO_CTRL4_D6_PDN_Pos) 	/*!< 0x00000080 */
#define 	IO_CTRL4_D6_PDN 	IO_CTRL4_D6_PDN_Msk
#define 	IO_CTRL4_D6_DRIVE_Pos 	(0x8U)
#define 	IO_CTRL4_D6_DRIVE_Msk 	(0x1UL << IO_CTRL4_D6_DRIVE_Pos) 	/*!< 0x00000100 */
#define 	IO_CTRL4_D6_DRIVE 	IO_CTRL4_D6_DRIVE_Msk
#define 	IO_CTRL4_D6_ENZI_Pos 	(0x9U)
#define 	IO_CTRL4_D6_ENZI_Msk 	(0x1UL << IO_CTRL4_D6_ENZI_Pos) 	/*!< 0x00000200 */
#define 	IO_CTRL4_D6_ENZI 	IO_CTRL4_D6_ENZI_Msk
#define 	IO_CTRL4_D7_EN_Pos 	(0xAU)
#define 	IO_CTRL4_D7_EN_Msk 	(0x1UL << IO_CTRL4_D7_EN_Pos) 	/*!< 0x00000400 */
#define 	IO_CTRL4_D7_EN 	IO_CTRL4_D7_EN_Msk
#define 	IO_CTRL4_D7_PUN_Pos 	(0xBU)
#define 	IO_CTRL4_D7_PUN_Msk 	(0x1UL << IO_CTRL4_D7_PUN_Pos) 	/*!< 0x00000800 */
#define 	IO_CTRL4_D7_PUN 	IO_CTRL4_D7_PUN_Msk
#define 	IO_CTRL4_D7_PDN_Pos 	(0xCU)
#define 	IO_CTRL4_D7_PDN_Msk 	(0x1UL << IO_CTRL4_D7_PDN_Pos) 	/*!< 0x00001000 */
#define 	IO_CTRL4_D7_PDN 	IO_CTRL4_D7_PDN_Msk
#define 	IO_CTRL4_D7_DRIVE_Pos 	(0xDU)
#define 	IO_CTRL4_D7_DRIVE_Msk 	(0x1UL << IO_CTRL4_D7_DRIVE_Pos) 	/*!< 0x00002000 */
#define 	IO_CTRL4_D7_DRIVE 	IO_CTRL4_D7_DRIVE_Msk
#define 	IO_CTRL4_D7_ENZI_Pos 	(0xEU)
#define 	IO_CTRL4_D7_ENZI_Msk 	(0x1UL << IO_CTRL4_D7_ENZI_Pos) 	/*!< 0x00004000 */
#define 	IO_CTRL4_D7_ENZI 	IO_CTRL4_D7_ENZI_Msk
#define 	IO_CTRL4_AGPIO0_EN_Pos 	(0xFU)
#define 	IO_CTRL4_AGPIO0_EN_Msk 	(0x1UL << IO_CTRL4_AGPIO0_EN_Pos) 	/*!< 0x00008000 */
#define 	IO_CTRL4_AGPIO0_EN 	IO_CTRL4_AGPIO0_EN_Msk
#define 	IO_CTRL4_AGPIO0_PUN_Pos 	(0x10U)
#define 	IO_CTRL4_AGPIO0_PUN_Msk 	(0x1UL << IO_CTRL4_AGPIO0_PUN_Pos) 	/*!< 0x00010000 */
#define 	IO_CTRL4_AGPIO0_PUN 	IO_CTRL4_AGPIO0_PUN_Msk
#define 	IO_CTRL4_AGPIO0_PDN_Pos 	(0x11U)
#define 	IO_CTRL4_AGPIO0_PDN_Msk 	(0x1UL << IO_CTRL4_AGPIO0_PDN_Pos) 	/*!< 0x00020000 */
#define 	IO_CTRL4_AGPIO0_PDN 	IO_CTRL4_AGPIO0_PDN_Msk
#define 	IO_CTRL4_AGPIO0_DRIVE_Pos 	(0x12U)
#define 	IO_CTRL4_AGPIO0_DRIVE_Msk 	(0x1UL << IO_CTRL4_AGPIO0_DRIVE_Pos) 	/*!< 0x00040000 */
#define 	IO_CTRL4_AGPIO0_DRIVE 	IO_CTRL4_AGPIO0_DRIVE_Msk
#define 	IO_CTRL4_AGPIO0_ENZI_Pos 	(0x13U)
#define 	IO_CTRL4_AGPIO0_ENZI_Msk 	(0x1UL << IO_CTRL4_AGPIO0_ENZI_Pos) 	/*!< 0x00080000 */
#define 	IO_CTRL4_AGPIO0_ENZI 	IO_CTRL4_AGPIO0_ENZI_Msk
#define 	IO_CTRL4_AGPIO1_EN_Pos 	(0x14U)
#define 	IO_CTRL4_AGPIO1_EN_Msk 	(0x1UL << IO_CTRL4_AGPIO1_EN_Pos) 	/*!< 0x00100000 */
#define 	IO_CTRL4_AGPIO1_EN 	IO_CTRL4_AGPIO1_EN_Msk
#define 	IO_CTRL4_AGPIO1_PUN_Pos 	(0x15U)
#define 	IO_CTRL4_AGPIO1_PUN_Msk 	(0x1UL << IO_CTRL4_AGPIO1_PUN_Pos) 	/*!< 0x00200000 */
#define 	IO_CTRL4_AGPIO1_PUN 	IO_CTRL4_AGPIO1_PUN_Msk
#define 	IO_CTRL4_AGPIO1_PDN_Pos 	(0x16U)
#define 	IO_CTRL4_AGPIO1_PDN_Msk 	(0x1UL << IO_CTRL4_AGPIO1_PDN_Pos) 	/*!< 0x00400000 */
#define 	IO_CTRL4_AGPIO1_PDN 	IO_CTRL4_AGPIO1_PDN_Msk
#define 	IO_CTRL4_AGPIO1_DRIVE_Pos 	(0x17U)
#define 	IO_CTRL4_AGPIO1_DRIVE_Msk 	(0x1UL << IO_CTRL4_AGPIO1_DRIVE_Pos) 	/*!< 0x00800000 */
#define 	IO_CTRL4_AGPIO1_DRIVE 	IO_CTRL4_AGPIO1_DRIVE_Msk
#define 	IO_CTRL4_AGPIO1_ENZI_Pos 	(0x18U)
#define 	IO_CTRL4_AGPIO1_ENZI_Msk 	(0x1UL << IO_CTRL4_AGPIO1_ENZI_Pos) 	/*!< 0x01000000 */
#define 	IO_CTRL4_AGPIO1_ENZI 	IO_CTRL4_AGPIO1_ENZI_Msk
#define IO_CTRL5 	(0x00000614UL) 	/*<! Input Output PAD, Control registers 5 */
#define 	IO_CTRL5_SCL_I2COUTE_Pos 	(0x0U)
#define 	IO_CTRL5_SCL_I2COUTE_Msk 	(0x1UL << IO_CTRL5_SCL_I2COUTE_Pos) 	/*!< 0x00000001 */
#define 	IO_CTRL5_SCL_I2COUTE 	IO_CTRL5_SCL_I2COUTE_Msk
#define 	IO_CTRL5_SCL_LOADSEL_Pos 	(0x1U)
#define 	IO_CTRL5_SCL_LOADSEL_Msk 	(0x1UL << IO_CTRL5_SCL_LOADSEL_Pos) 	/*!< 0x00000002 */
#define 	IO_CTRL5_SCL_LOADSEL 	IO_CTRL5_SCL_LOADSEL_Msk
#define 	IO_CTRL5_SCL_DRIVE_Pos 	(0x2U)
#define 	IO_CTRL5_SCL_DRIVE_Msk 	(0x7UL << IO_CTRL5_SCL_DRIVE_Pos) 	/*!< 0x0000001C */
#define 	IO_CTRL5_SCL_DRIVE 	IO_CTRL5_SCL_DRIVE_Msk
#define 	IO_CTRL5_SCL_BUSMODE_Pos 	(0x5U)
#define 	IO_CTRL5_SCL_BUSMODE_Msk 	(0x1UL << IO_CTRL5_SCL_BUSMODE_Pos) 	/*!< 0x00000020 */
#define 	IO_CTRL5_SCL_BUSMODE 	IO_CTRL5_SCL_BUSMODE_Msk
#define 	IO_CTRL5_SCL_DELAYRX_Pos 	(0x6U)
#define 	IO_CTRL5_SCL_DELAYRX_Msk 	(0x1UL << IO_CTRL5_SCL_DELAYRX_Pos) 	/*!< 0x00000040 */
#define 	IO_CTRL5_SCL_DELAYRX 	IO_CTRL5_SCL_DELAYRX_Msk
#define 	IO_CTRL5_SCL_FMFE_Pos 	(0x7U)
#define 	IO_CTRL5_SCL_FMFE_Msk 	(0x1UL << IO_CTRL5_SCL_FMFE_Pos) 	/*!< 0x00000080 */
#define 	IO_CTRL5_SCL_FMFE 	IO_CTRL5_SCL_FMFE_Msk
#define 	IO_CTRL5_SCL_I2CINE_Pos 	(0x8U)
#define 	IO_CTRL5_SCL_I2CINE_Msk 	(0x1UL << IO_CTRL5_SCL_I2CINE_Pos) 	/*!< 0x00000100 */
#define 	IO_CTRL5_SCL_I2CINE 	IO_CTRL5_SCL_I2CINE_Msk
#define 	IO_CTRL5_SDA_I2COUTE_Pos 	(0x9U)
#define 	IO_CTRL5_SDA_I2COUTE_Msk 	(0x1UL << IO_CTRL5_SDA_I2COUTE_Pos) 	/*!< 0x00000200 */
#define 	IO_CTRL5_SDA_I2COUTE 	IO_CTRL5_SDA_I2COUTE_Msk
#define 	IO_CTRL5_SDA_LOADSEL_Pos 	(0xAU)
#define 	IO_CTRL5_SDA_LOADSEL_Msk 	(0x1UL << IO_CTRL5_SDA_LOADSEL_Pos) 	/*!< 0x00000400 */
#define 	IO_CTRL5_SDA_LOADSEL 	IO_CTRL5_SDA_LOADSEL_Msk
#define 	IO_CTRL5_SDA_DRIVE_Pos 	(0xBU)
#define 	IO_CTRL5_SDA_DRIVE_Msk 	(0x7UL << IO_CTRL5_SDA_DRIVE_Pos) 	/*!< 0x00003800 */
#define 	IO_CTRL5_SDA_DRIVE 	IO_CTRL5_SDA_DRIVE_Msk
#define 	IO_CTRL5_SDA_BUSMODE_Pos 	(0xEU)
#define 	IO_CTRL5_SDA_BUSMODE_Msk 	(0x1UL << IO_CTRL5_SDA_BUSMODE_Pos) 	/*!< 0x00004000 */
#define 	IO_CTRL5_SDA_BUSMODE 	IO_CTRL5_SDA_BUSMODE_Msk
#define 	IO_CTRL5_SDA_DELAYRX_Pos 	(0xFU)
#define 	IO_CTRL5_SDA_DELAYRX_Msk 	(0x1UL << IO_CTRL5_SDA_DELAYRX_Pos) 	/*!< 0x00008000 */
#define 	IO_CTRL5_SDA_DELAYRX 	IO_CTRL5_SDA_DELAYRX_Msk
#define 	IO_CTRL5_SDA_FMFE_Pos 	(0x10U)
#define 	IO_CTRL5_SDA_FMFE_Msk 	(0x1UL << IO_CTRL5_SDA_FMFE_Pos) 	/*!< 0x00010000 */
#define 	IO_CTRL5_SDA_FMFE 	IO_CTRL5_SDA_FMFE_Msk
#define 	IO_CTRL5_SDA_I2CINE_Pos 	(0x11U)
#define 	IO_CTRL5_SDA_I2CINE_Msk 	(0x1UL << IO_CTRL5_SDA_I2CINE_Pos) 	/*!< 0x00020000 */
#define 	IO_CTRL5_SDA_I2CINE 	IO_CTRL5_SDA_I2CINE_Msk
#define 	IO_CTRL5_AGPIO_TA_Pos 	(0x12U)
#define 	IO_CTRL5_AGPIO_TA_Msk 	(0x1UL << IO_CTRL5_AGPIO_TA_Pos) 	/*!< 0x00040000 */
#define 	IO_CTRL5_AGPIO_TA 	IO_CTRL5_AGPIO_TA_Msk
#define 	IO_CTRL5_AGPIO_TEN_Pos 	(0x13U)
#define 	IO_CTRL5_AGPIO_TEN_Msk 	(0x1UL << IO_CTRL5_AGPIO_TEN_Pos) 	/*!< 0x00080000 */
#define 	IO_CTRL5_AGPIO_TEN 	IO_CTRL5_AGPIO_TEN_Msk
#define 	IO_CTRL5_AGPIO_TM_Pos 	(0x14U)
#define 	IO_CTRL5_AGPIO_TM_Msk 	(0x1UL << IO_CTRL5_AGPIO_TM_Pos) 	/*!< 0x00100000 */
#define 	IO_CTRL5_AGPIO_TM 	IO_CTRL5_AGPIO_TM_Msk
#define GPO_PX_INIT_CTRL0 	(0x00000800UL) 	/*<! GPO_PX_INIT configuration setting_0. */
#define 	GPO_PX_INIT_CTRL0_ENABLE_Pos 	(0x0U)
#define 	GPO_PX_INIT_CTRL0_ENABLE_Msk 	(0x1UL << GPO_PX_INIT_CTRL0_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	GPO_PX_INIT_CTRL0_ENABLE 	GPO_PX_INIT_CTRL0_ENABLE_Msk
#define 	GPO_PX_INIT_CTRL0_PERIOD_Pos 	(0x1U)
#define 	GPO_PX_INIT_CTRL0_PERIOD_Msk 	(0xFFFFFUL << GPO_PX_INIT_CTRL0_PERIOD_Pos) 	/*!< 0x001FFFFE */
#define 	GPO_PX_INIT_CTRL0_PERIOD 	GPO_PX_INIT_CTRL0_PERIOD_Msk
#define 	GPO_PX_INIT_CTRL0_POL_Pos 	(0x15U)
