jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	GPO_PX_INIT_CTRL0_POL_Msk 	(0x1UL << GPO_PX_INIT_CTRL0_POL_Pos) 	/*!< 0x00200000 */
#define 	GPO_PX_INIT_CTRL0_POL 	GPO_PX_INIT_CTRL0_POL_Msk
#define GPO_PX_INIT_CTRL1 	(0x00000804UL) 	/*<! GPO_PX_INIT configuration setting_1. */
#define 	GPO_PX_INIT_CTRL1_DELAY1_Pos 	(0x0U)
#define 	GPO_PX_INIT_CTRL1_DELAY1_Msk 	(0xFFFFFUL << GPO_PX_INIT_CTRL1_DELAY1_Pos) 	/*!< 0x000FFFFF */
#define 	GPO_PX_INIT_CTRL1_DELAY1 	GPO_PX_INIT_CTRL1_DELAY1_Msk
#define GPO_PX_INIT_CTRL2 	(0x00000808UL) 	/*<! GPO_PX_INIT configuration setting_2. */
#define 	GPO_PX_INIT_CTRL2_DELAY2_Pos 	(0x0U)
#define 	GPO_PX_INIT_CTRL2_DELAY2_Msk 	(0xFFFFFUL << GPO_PX_INIT_CTRL2_DELAY2_Pos) 	/*!< 0x000FFFFF */
#define 	GPO_PX_INIT_CTRL2_DELAY2 	GPO_PX_INIT_CTRL2_DELAY2_Msk
#define GPO_PX_RST_AMP_CTRL0 	(0x0000080CUL) 	/*<! GPO_PX_RST_AMP configuration setting_0. */
#define 	GPO_PX_RST_AMP_CTRL0_ENABLE_Pos 	(0x0U)
#define 	GPO_PX_RST_AMP_CTRL0_ENABLE_Msk 	(0x1UL << GPO_PX_RST_AMP_CTRL0_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	GPO_PX_RST_AMP_CTRL0_ENABLE 	GPO_PX_RST_AMP_CTRL0_ENABLE_Msk
#define 	GPO_PX_RST_AMP_CTRL0_PERIOD_Pos 	(0x1U)
#define 	GPO_PX_RST_AMP_CTRL0_PERIOD_Msk 	(0xFFFFUL << GPO_PX_RST_AMP_CTRL0_PERIOD_Pos) 	/*!< 0x0001FFFE */
#define 	GPO_PX_RST_AMP_CTRL0_PERIOD 	GPO_PX_RST_AMP_CTRL0_PERIOD_Msk
#define 	GPO_PX_RST_AMP_CTRL0_POL_Pos 	(0x11U)
#define 	GPO_PX_RST_AMP_CTRL0_POL_Msk 	(0x1UL << GPO_PX_RST_AMP_CTRL0_POL_Pos) 	/*!< 0x00020000 */
#define 	GPO_PX_RST_AMP_CTRL0_POL 	GPO_PX_RST_AMP_CTRL0_POL_Msk
#define GPO_PX_RST_AMP_CTRL1 	(0x00000810UL) 	/*<! GPO_PX_RST_AMP configuration setting_1. */
#define 	GPO_PX_RST_AMP_CTRL1_DELAY1_Pos 	(0x0U)
#define 	GPO_PX_RST_AMP_CTRL1_DELAY1_Msk 	(0xFFFFUL << GPO_PX_RST_AMP_CTRL1_DELAY1_Pos) 	/*!< 0x0000FFFF */
#define 	GPO_PX_RST_AMP_CTRL1_DELAY1 	GPO_PX_RST_AMP_CTRL1_DELAY1_Msk
#define 	GPO_PX_RST_AMP_CTRL1_DELAY2_Pos 	(0x10U)
#define 	GPO_PX_RST_AMP_CTRL1_DELAY2_Msk 	(0xFFFFUL << GPO_PX_RST_AMP_CTRL1_DELAY2_Pos) 	/*!< 0xFFFF0000 */
#define 	GPO_PX_RST_AMP_CTRL1_DELAY2 	GPO_PX_RST_AMP_CTRL1_DELAY2_Msk
#define GPO_PX_RST_CMP_CTRL0 	(0x00000814UL) 	/*<! GPO_PX_RST_CMP configuration setting_0. */
#define 	GPO_PX_RST_CMP_CTRL0_ENABLE_Pos 	(0x0U)
#define 	GPO_PX_RST_CMP_CTRL0_ENABLE_Msk 	(0x1UL << GPO_PX_RST_CMP_CTRL0_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	GPO_PX_RST_CMP_CTRL0_ENABLE 	GPO_PX_RST_CMP_CTRL0_ENABLE_Msk
#define 	GPO_PX_RST_CMP_CTRL0_PERIOD_Pos 	(0x1U)
#define 	GPO_PX_RST_CMP_CTRL0_PERIOD_Msk 	(0xFFFFUL << GPO_PX_RST_CMP_CTRL0_PERIOD_Pos) 	/*!< 0x0001FFFE */
#define 	GPO_PX_RST_CMP_CTRL0_PERIOD 	GPO_PX_RST_CMP_CTRL0_PERIOD_Msk
#define 	GPO_PX_RST_CMP_CTRL0_POL_Pos 	(0x11U)
#define 	GPO_PX_RST_CMP_CTRL0_POL_Msk 	(0x1UL << GPO_PX_RST_CMP_CTRL0_POL_Pos) 	/*!< 0x00020000 */
#define 	GPO_PX_RST_CMP_CTRL0_POL 	GPO_PX_RST_CMP_CTRL0_POL_Msk
#define GPO_PX_RST_CMP_CTRL1 	(0x00000818UL) 	/*<! GPO_PX_RST_CMP configuration setting_1. */
#define 	GPO_PX_RST_CMP_CTRL1_DELAY1_Pos 	(0x0U)
#define 	GPO_PX_RST_CMP_CTRL1_DELAY1_Msk 	(0xFFFFUL << GPO_PX_RST_CMP_CTRL1_DELAY1_Pos) 	/*!< 0x0000FFFF */
#define 	GPO_PX_RST_CMP_CTRL1_DELAY1 	GPO_PX_RST_CMP_CTRL1_DELAY1_Msk
#define 	GPO_PX_RST_CMP_CTRL1_DELAY2_Pos 	(0x10U)
#define 	GPO_PX_RST_CMP_CTRL1_DELAY2_Msk 	(0xFFFFUL << GPO_PX_RST_CMP_CTRL1_DELAY2_Pos) 	/*!< 0xFFFF0000 */
#define 	GPO_PX_RST_CMP_CTRL1_DELAY2 	GPO_PX_RST_CMP_CTRL1_DELAY2_Msk
#define GPO_PX_RST_BIAS_CTRL0 	(0x0000081CUL) 	/*<! GPO_PX_RST_BIAS configuration setting_0. */
#define 	GPO_PX_RST_BIAS_CTRL0_ENABLE_Pos 	(0x0U)
#define 	GPO_PX_RST_BIAS_CTRL0_ENABLE_Msk 	(0x1UL << GPO_PX_RST_BIAS_CTRL0_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	GPO_PX_RST_BIAS_CTRL0_ENABLE 	GPO_PX_RST_BIAS_CTRL0_ENABLE_Msk
#define 	GPO_PX_RST_BIAS_CTRL0_PERIOD_Pos 	(0x1U)
#define 	GPO_PX_RST_BIAS_CTRL0_PERIOD_Msk 	(0xFFFFUL << GPO_PX_RST_BIAS_CTRL0_PERIOD_Pos) 	/*!< 0x0001FFFE */
#define 	GPO_PX_RST_BIAS_CTRL0_PERIOD 	GPO_PX_RST_BIAS_CTRL0_PERIOD_Msk
#define 	GPO_PX_RST_BIAS_CTRL0_POL_Pos 	(0x11U)
#define 	GPO_PX_RST_BIAS_CTRL0_POL_Msk 	(0x1UL << GPO_PX_RST_BIAS_CTRL0_POL_Pos) 	/*!< 0x00020000 */
#define 	GPO_PX_RST_BIAS_CTRL0_POL 	GPO_PX_RST_BIAS_CTRL0_POL_Msk
#define GPO_PX_RST_BIAS_CTRL1 	(0x00000820UL) 	/*<! GPO_PX_RST_BIAS configuration setting_1. */
#define 	GPO_PX_RST_BIAS_CTRL1_DELAY1_Pos 	(0x0U)
#define 	GPO_PX_RST_BIAS_CTRL1_DELAY1_Msk 	(0xFFFFUL << GPO_PX_RST_BIAS_CTRL1_DELAY1_Pos) 	/*!< 0x0000FFFF */
#define 	GPO_PX_RST_BIAS_CTRL1_DELAY1 	GPO_PX_RST_BIAS_CTRL1_DELAY1_Msk
#define 	GPO_PX_RST_BIAS_CTRL1_DELAY2_Pos 	(0x10U)
#define 	GPO_PX_RST_BIAS_CTRL1_DELAY2_Msk 	(0xFFFFUL << GPO_PX_RST_BIAS_CTRL1_DELAY2_Pos) 	/*!< 0xFFFF0000 */
#define 	GPO_PX_RST_BIAS_CTRL1_DELAY2 	GPO_PX_RST_BIAS_CTRL1_DELAY2_Msk
#define GPO_PX_ACT_CTRL0 	(0x00000824UL) 	/*<! GPO_PX_ACT configuration setting_0. */
#define 	GPO_PX_ACT_CTRL0_ENABLE_Pos 	(0x0U)
#define 	GPO_PX_ACT_CTRL0_ENABLE_Msk 	(0x1UL << GPO_PX_ACT_CTRL0_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	GPO_PX_ACT_CTRL0_ENABLE 	GPO_PX_ACT_CTRL0_ENABLE_Msk
#define 	GPO_PX_ACT_CTRL0_PERIOD_Pos 	(0x1U)
#define 	GPO_PX_ACT_CTRL0_PERIOD_Msk 	(0xFFFFUL << GPO_PX_ACT_CTRL0_PERIOD_Pos) 	/*!< 0x0001FFFE */
#define 	GPO_PX_ACT_CTRL0_PERIOD 	GPO_PX_ACT_CTRL0_PERIOD_Msk
#define 	GPO_PX_ACT_CTRL0_POL_Pos 	(0x11U)
#define 	GPO_PX_ACT_CTRL0_POL_Msk 	(0x1UL << GPO_PX_ACT_CTRL0_POL_Pos) 	/*!< 0x00020000 */
#define 	GPO_PX_ACT_CTRL0_POL 	GPO_PX_ACT_CTRL0_POL_Msk
#define GPO_PX_ACT_CTRL1 	(0x00000828UL) 	/*<! GPO_PX_ACT configuration setting_1. */
#define 	GPO_PX_ACT_CTRL1_DELAY1_Pos 	(0x0U)
#define 	GPO_PX_ACT_CTRL1_DELAY1_Msk 	(0xFFFFUL << GPO_PX_ACT_CTRL1_DELAY1_Pos) 	/*!< 0x0000FFFF */
#define 	GPO_PX_ACT_CTRL1_DELAY1 	GPO_PX_ACT_CTRL1_DELAY1_Msk
#define 	GPO_PX_ACT_CTRL1_DELAY2_Pos 	(0x10U)
#define 	GPO_PX_ACT_CTRL1_DELAY2_Msk 	(0xFFFFUL << GPO_PX_ACT_CTRL1_DELAY2_Pos) 	/*!< 0xFFFF0000 */
#define 	GPO_PX_ACT_CTRL1_DELAY2 	GPO_PX_ACT_CTRL1_DELAY2_Msk
#define GPO_PX_TRG_CTRL0 	(0x0000082CUL) 	/*<! GPO_PX_TRG configuration setting_0. */
#define 	GPO_PX_TRG_CTRL0_ENABLE_Pos 	(0x0U)
#define 	GPO_PX_TRG_CTRL0_ENABLE_Msk 	(0x1UL << GPO_PX_TRG_CTRL0_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	GPO_PX_TRG_CTRL0_ENABLE 	GPO_PX_TRG_CTRL0_ENABLE_Msk
#define 	GPO_PX_TRG_CTRL0_PERIOD_Pos 	(0x1U)
#define 	GPO_PX_TRG_CTRL0_PERIOD_Msk 	(0xFFFFUL << GPO_PX_TRG_CTRL0_PERIOD_Pos) 	/*!< 0x0001FFFE */
#define 	GPO_PX_TRG_CTRL0_PERIOD 	GPO_PX_TRG_CTRL0_PERIOD_Msk
#define 	GPO_PX_TRG_CTRL0_POL_Pos 	(0x11U)
#define 	GPO_PX_TRG_CTRL0_POL_Msk 	(0x1UL << GPO_PX_TRG_CTRL0_POL_Pos) 	/*!< 0x00020000 */
#define 	GPO_PX_TRG_CTRL0_POL 	GPO_PX_TRG_CTRL0_POL_Msk
#define GPO_PX_TRG_CTRL1 	(0x00000830UL) 	/*<! GPO_PX_TRG configuration setting_1. */
#define 	GPO_PX_TRG_CTRL1_DELAY1_Pos 	(0x0U)
#define 	GPO_PX_TRG_CTRL1_DELAY1_Msk 	(0xFFFFUL << GPO_PX_TRG_CTRL1_DELAY1_Pos) 	/*!< 0x0000FFFF */
#define 	GPO_PX_TRG_CTRL1_DELAY1 	GPO_PX_TRG_CTRL1_DELAY1_Msk
#define 	GPO_PX_TRG_CTRL1_DELAY2_Pos 	(0x10U)
#define 	GPO_PX_TRG_CTRL1_DELAY2_Msk 	(0xFFFFUL << GPO_PX_TRG_CTRL1_DELAY2_Pos) 	/*!< 0xFFFF0000 */
#define 	GPO_PX_TRG_CTRL1_DELAY2 	GPO_PX_TRG_CTRL1_DELAY2_Msk
#define GPO_PX_MASK_B_CTRL0 	(0x00000834UL) 	/*<! GPO_PX_MASK configuration setting_0. */
#define 	GPO_PX_MASK_B_CTRL0_ENABLE_Pos 	(0x0U)
#define 	GPO_PX_MASK_B_CTRL0_ENABLE_Msk 	(0x1UL << GPO_PX_MASK_B_CTRL0_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	GPO_PX_MASK_B_CTRL0_ENABLE 	GPO_PX_MASK_B_CTRL0_ENABLE_Msk
#define 	GPO_PX_MASK_B_CTRL0_PERIOD_Pos 	(0x1U)
#define 	GPO_PX_MASK_B_CTRL0_PERIOD_Msk 	(0xFFFFUL << GPO_PX_MASK_B_CTRL0_PERIOD_Pos) 	/*!< 0x0001FFFE */
#define 	GPO_PX_MASK_B_CTRL0_PERIOD 	GPO_PX_MASK_B_CTRL0_PERIOD_Msk
#define 	GPO_PX_MASK_B_CTRL0_POL_Pos 	(0x11U)
#define 	GPO_PX_MASK_B_CTRL0_POL_Msk 	(0x1UL << GPO_PX_MASK_B_CTRL0_POL_Pos) 	/*!< 0x00020000 */
#define 	GPO_PX_MASK_B_CTRL0_POL 	GPO_PX_MASK_B_CTRL0_POL_Msk
#define GPO_PX_MASK_B_CTRL1 	(0x00000838UL) 	/*<! GPO_PX_MASK configuration setting_1. */
#define 	GPO_PX_MASK_B_CTRL1_DELAY1_Pos 	(0x0U)
#define 	GPO_PX_MASK_B_CTRL1_DELAY1_Msk 	(0xFFFFUL << GPO_PX_MASK_B_CTRL1_DELAY1_Pos) 	/*!< 0x0000FFFF */
#define 	GPO_PX_MASK_B_CTRL1_DELAY1 	GPO_PX_MASK_B_CTRL1_DELAY1_Msk
#define 	GPO_PX_MASK_B_CTRL1_DELAY2_Pos 	(0x10U)
#define 	GPO_PX_MASK_B_CTRL1_DELAY2_Msk 	(0xFFFFUL << GPO_PX_MASK_B_CTRL1_DELAY2_Pos) 	/*!< 0xFFFF0000 */
#define 	GPO_PX_MASK_B_CTRL1_DELAY2 	GPO_PX_MASK_B_CTRL1_DELAY2_Msk
#define GPO_GLOBAL_CTRL 	(0x0000083CUL) 	/*<! Enable all GPOs, test latch pixel starts working. */
#define 	GPO_GLOBAL_CTRL_ENABLE_Pos 	(0x0U)
#define 	GPO_GLOBAL_CTRL_ENABLE_Msk 	(0x1UL << GPO_GLOBAL_CTRL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	GPO_GLOBAL_CTRL_ENABLE 	GPO_GLOBAL_CTRL_ENABLE_Msk

