jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * BIAS: Bias generators Register Map
 * ------------------------------------------------------ */

#define BIAS_BIAS_PR_HV0 	(0x00001000UL) 	/*<! 'bias_pr_hv config bank0' */
#define 	BIAS_PR_HV0_CTL_Pos 	(0x0U)
#define 	BIAS_PR_HV0_CTL_Msk 	(0x7FUL << BIAS_PR_HV0_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_PR_HV0_CTL 	BIAS_PR_HV0_CTL_Msk
#define 	BIAS_PR_HV0_BUF_STG_Pos 	(0x10U)
#define 	BIAS_PR_HV0_BUF_STG_Msk 	(0x3UL << BIAS_PR_HV0_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_PR_HV0_BUF_STG 	BIAS_PR_HV0_BUF_STG_Msk
#define 	BIAS_PR_HV0_EN_Pos 	(0x18U)
#define 	BIAS_PR_HV0_EN_Msk 	(0x1UL << BIAS_PR_HV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_PR_HV0_EN 	BIAS_PR_HV0_EN_Msk
#define 	BIAS_PR_HV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_PR_HV0_PULL_SEL_Msk 	(0x1UL << BIAS_PR_HV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_PR_HV0_PULL_SEL 	BIAS_PR_HV0_PULL_SEL_Msk
#define 	BIAS_PR_HV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_PR_HV0_SINGLE_Msk 	(0x1UL << BIAS_PR_HV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_PR_HV0_SINGLE 	BIAS_PR_HV0_SINGLE_Msk
#define BIAS_BIAS_FO_HV0 	(0x00001004UL) 	/*<! 'bias_fo_hv config bank0' */
#define 	BIAS_FO_HV0_CTL_Pos 	(0x0U)
#define 	BIAS_FO_HV0_CTL_Msk 	(0x7FUL << BIAS_FO_HV0_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_FO_HV0_CTL 	BIAS_FO_HV0_CTL_Msk
#define 	BIAS_FO_HV0_BUF_STG_Pos 	(0x10U)
#define 	BIAS_FO_HV0_BUF_STG_Msk 	(0x3UL << BIAS_FO_HV0_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_FO_HV0_BUF_STG 	BIAS_FO_HV0_BUF_STG_Msk
#define 	BIAS_FO_HV0_EN_Pos 	(0x18U)
#define 	BIAS_FO_HV0_EN_Msk 	(0x1UL << BIAS_FO_HV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_FO_HV0_EN 	BIAS_FO_HV0_EN_Msk
#define 	BIAS_FO_HV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_FO_HV0_PULL_SEL_Msk 	(0x1UL << BIAS_FO_HV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_FO_HV0_PULL_SEL 	BIAS_FO_HV0_PULL_SEL_Msk
#define 	BIAS_FO_HV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_FO_HV0_SINGLE_Msk 	(0x1UL << BIAS_FO_HV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_FO_HV0_SINGLE 	BIAS_FO_HV0_SINGLE_Msk
#define BIAS_BIAS_FES_HV0 	(0x00001008UL) 	/*<! 'bias_fes_hv config bank0' */
#define 	BIAS_FES_HV0_CTL_Pos 	(0x0U)
#define 	BIAS_FES_HV0_CTL_Msk 	(0x7FUL << BIAS_FES_HV0_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_FES_HV0_CTL 	BIAS_FES_HV0_CTL_Msk
#define 	BIAS_FES_HV0_BUF_STG_Pos 	(0x10U)
#define 	BIAS_FES_HV0_BUF_STG_Msk 	(0x3UL << BIAS_FES_HV0_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_FES_HV0_BUF_STG 	BIAS_FES_HV0_BUF_STG_Msk
#define 	BIAS_FES_HV0_EN_Pos 	(0x18U)
#define 	BIAS_FES_HV0_EN_Msk 	(0x1UL << BIAS_FES_HV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_FES_HV0_EN 	BIAS_FES_HV0_EN_Msk
#define 	BIAS_FES_HV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_FES_HV0_PULL_SEL_Msk 	(0x1UL << BIAS_FES_HV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_FES_HV0_PULL_SEL 	BIAS_FES_HV0_PULL_SEL_Msk
#define 	BIAS_FES_HV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_FES_HV0_SINGLE_Msk 	(0x1UL << BIAS_FES_HV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_FES_HV0_SINGLE 	BIAS_FES_HV0_SINGLE_Msk
#define BIAS_BIAS_PR_HV1 	(0x0000100CUL) 	/*<! 'bias_pr_hv config bank1' */
#define 	BIAS_PR_HV1_CTL_Pos 	(0x0U)
#define 	BIAS_PR_HV1_CTL_Msk 	(0x7FUL << BIAS_PR_HV1_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_PR_HV1_CTL 	BIAS_PR_HV1_CTL_Msk
#define 	BIAS_PR_HV1_BUF_STG_Pos 	(0x10U)
#define 	BIAS_PR_HV1_BUF_STG_Msk 	(0x3UL << BIAS_PR_HV1_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_PR_HV1_BUF_STG 	BIAS_PR_HV1_BUF_STG_Msk
#define 	BIAS_PR_HV1_EN_Pos 	(0x18U)
#define 	BIAS_PR_HV1_EN_Msk 	(0x1UL << BIAS_PR_HV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_PR_HV1_EN 	BIAS_PR_HV1_EN_Msk
#define 	BIAS_PR_HV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_PR_HV1_PULL_SEL_Msk 	(0x1UL << BIAS_PR_HV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_PR_HV1_PULL_SEL 	BIAS_PR_HV1_PULL_SEL_Msk
#define 	BIAS_PR_HV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_PR_HV1_SINGLE_Msk 	(0x1UL << BIAS_PR_HV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_PR_HV1_SINGLE 	BIAS_PR_HV1_SINGLE_Msk
#define BIAS_BIAS_FO_HV1 	(0x00001010UL) 	/*<! 'bias_fo_hv config bank1' */
#define 	BIAS_FO_HV1_CTL_Pos 	(0x0U)
#define 	BIAS_FO_HV1_CTL_Msk 	(0x7FUL << BIAS_FO_HV1_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_FO_HV1_CTL 	BIAS_FO_HV1_CTL_Msk
#define 	BIAS_FO_HV1_BUF_STG_Pos 	(0x10U)
#define 	BIAS_FO_HV1_BUF_STG_Msk 	(0x3UL << BIAS_FO_HV1_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_FO_HV1_BUF_STG 	BIAS_FO_HV1_BUF_STG_Msk
#define 	BIAS_FO_HV1_EN_Pos 	(0x18U)
#define 	BIAS_FO_HV1_EN_Msk 	(0x1UL << BIAS_FO_HV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_FO_HV1_EN 	BIAS_FO_HV1_EN_Msk
#define 	BIAS_FO_HV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_FO_HV1_PULL_SEL_Msk 	(0x1UL << BIAS_FO_HV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_FO_HV1_PULL_SEL 	BIAS_FO_HV1_PULL_SEL_Msk
#define 	BIAS_FO_HV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_FO_HV1_SINGLE_Msk 	(0x1UL << BIAS_FO_HV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_FO_HV1_SINGLE 	BIAS_FO_HV1_SINGLE_Msk
#define BIAS_BIAS_FES_HV1 	(0x00001014UL) 	/*<! 'bias_fes_hv config bank1' */
#define 	BIAS_FES_HV1_CTL_Pos 	(0x0U)
#define 	BIAS_FES_HV1_CTL_Msk 	(0x7FUL << BIAS_FES_HV1_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_FES_HV1_CTL 	BIAS_FES_HV1_CTL_Msk
#define 	BIAS_FES_HV1_BUF_STG_Pos 	(0x10U)
#define 	BIAS_FES_HV1_BUF_STG_Msk 	(0x3UL << BIAS_FES_HV1_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_FES_HV1_BUF_STG 	BIAS_FES_HV1_BUF_STG_Msk
#define 	BIAS_FES_HV1_EN_Pos 	(0x18U)
#define 	BIAS_FES_HV1_EN_Msk 	(0x1UL << BIAS_FES_HV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_FES_HV1_EN 	BIAS_FES_HV1_EN_Msk
#define 	BIAS_FES_HV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_FES_HV1_PULL_SEL_Msk 	(0x1UL << BIAS_FES_HV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_FES_HV1_PULL_SEL 	BIAS_FES_HV1_PULL_SEL_Msk
#define 	BIAS_FES_HV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_FES_HV1_SINGLE_Msk 	(0x1UL << BIAS_FES_HV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_FES_HV1_SINGLE 	BIAS_FES_HV1_SINGLE_Msk
#define BIAS_BIAS_HPF_LV0 	(0x00001100UL) 	/*<! 'bias_hpf_lv config bank0' */
#define 	BIAS_HPF_LV0_CTL_Pos 	(0x0U)
#define 	BIAS_HPF_LV0_CTL_Msk 	(0x7FUL << BIAS_HPF_LV0_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_HPF_LV0_CTL 	BIAS_HPF_LV0_CTL_Msk
#define 	BIAS_HPF_LV0_BUF_STG_Pos 	(0x10U)
#define 	BIAS_HPF_LV0_BUF_STG_Msk 	(0x3UL << BIAS_HPF_LV0_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_HPF_LV0_BUF_STG 	BIAS_HPF_LV0_BUF_STG_Msk
#define 	BIAS_HPF_LV0_EN_Pos 	(0x18U)
#define 	BIAS_HPF_LV0_EN_Msk 	(0x1UL << BIAS_HPF_LV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_HPF_LV0_EN 	BIAS_HPF_LV0_EN_Msk
#define 	BIAS_HPF_LV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_HPF_LV0_PULL_SEL_Msk 	(0x1UL << BIAS_HPF_LV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_HPF_LV0_PULL_SEL 	BIAS_HPF_LV0_PULL_SEL_Msk
#define 	BIAS_HPF_LV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_HPF_LV0_SINGLE_Msk 	(0x1UL << BIAS_HPF_LV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_HPF_LV0_SINGLE 	BIAS_HPF_LV0_SINGLE_Msk
#define BIAS_BIAS_DIFF_ON_LV0 	(0x00001104UL) 	/*<! 'bias_diff_on_lv config bank0' */
#define 	BIAS_DIFF_ON_LV0_CTL_Pos 	(0x0U)
#define 	BIAS_DIFF_ON_LV0_CTL_Msk 	(0x7FUL << BIAS_DIFF_ON_LV0_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_DIFF_ON_LV0_CTL 	BIAS_DIFF_ON_LV0_CTL_Msk
#define 	BIAS_DIFF_ON_LV0_BUF_STG_Pos 	(0x10U)
#define 	BIAS_DIFF_ON_LV0_BUF_STG_Msk 	(0x3UL << BIAS_DIFF_ON_LV0_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_DIFF_ON_LV0_BUF_STG 	BIAS_DIFF_ON_LV0_BUF_STG_Msk
#define 	BIAS_DIFF_ON_LV0_IBTYPE_SEL_Pos 	(0x13U)
#define 	BIAS_DIFF_ON_LV0_IBTYPE_SEL_Msk 	(0x1UL << BIAS_DIFF_ON_LV0_IBTYPE_SEL_Pos) 	/*!< 0x00080000 */
#define 	BIAS_DIFF_ON_LV0_IBTYPE_SEL 	BIAS_DIFF_ON_LV0_IBTYPE_SEL_Msk
#define 	BIAS_DIFF_ON_LV0_EN_Pos 	(0x18U)
#define 	BIAS_DIFF_ON_LV0_EN_Msk 	(0x1UL << BIAS_DIFF_ON_LV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_DIFF_ON_LV0_EN 	BIAS_DIFF_ON_LV0_EN_Msk
#define 	BIAS_DIFF_ON_LV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_DIFF_ON_LV0_PULL_SEL_Msk 	(0x1UL << BIAS_DIFF_ON_LV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_DIFF_ON_LV0_PULL_SEL 	BIAS_DIFF_ON_LV0_PULL_SEL_Msk
#define 	BIAS_DIFF_ON_LV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_DIFF_ON_LV0_SINGLE_Msk 	(0x1UL << BIAS_DIFF_ON_LV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_DIFF_ON_LV0_SINGLE 	BIAS_DIFF_ON_LV0_SINGLE_Msk
#define BIAS_BIAS_DIFF_LV0 	(0x00001108UL) 	/*<! 'bias_diff_lv config bank0' */
#define 	BIAS_DIFF_LV0_CTL_Pos 	(0x0U)
#define 	BIAS_DIFF_LV0_CTL_Msk 	(0x7FUL << BIAS_DIFF_LV0_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_DIFF_LV0_CTL 	BIAS_DIFF_LV0_CTL_Msk
#define 	BIAS_DIFF_LV0_BUF_STG_Pos 	(0x10U)
#define 	BIAS_DIFF_LV0_BUF_STG_Msk 	(0x3UL << BIAS_DIFF_LV0_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_DIFF_LV0_BUF_STG 	BIAS_DIFF_LV0_BUF_STG_Msk
#define 	BIAS_DIFF_LV0_EN_Pos 	(0x18U)
#define 	BIAS_DIFF_LV0_EN_Msk 	(0x1UL << BIAS_DIFF_LV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_DIFF_LV0_EN 	BIAS_DIFF_LV0_EN_Msk
#define 	BIAS_DIFF_LV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_DIFF_LV0_PULL_SEL_Msk 	(0x1UL << BIAS_DIFF_LV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_DIFF_LV0_PULL_SEL 	BIAS_DIFF_LV0_PULL_SEL_Msk
#define 	BIAS_DIFF_LV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_DIFF_LV0_SINGLE_Msk 	(0x1UL << BIAS_DIFF_LV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_DIFF_LV0_SINGLE 	BIAS_DIFF_LV0_SINGLE_Msk
#define BIAS_BIAS_DIFF_OFF_LV0 	(0x0000110CUL) 	/*<! 'bias_diff_off_lv config bank0 */
#define 	BIAS_DIFF_OFF_LV0_CTL_Pos 	(0x0U)
#define 	BIAS_DIFF_OFF_LV0_CTL_Msk 	(0x7FUL << BIAS_DIFF_OFF_LV0_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_DIFF_OFF_LV0_CTL 	BIAS_DIFF_OFF_LV0_CTL_Msk
#define 	BIAS_DIFF_OFF_LV0_BUF_STG_Pos 	(0x10U)
#define 	BIAS_DIFF_OFF_LV0_BUF_STG_Msk 	(0x3UL << BIAS_DIFF_OFF_LV0_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_DIFF_OFF_LV0_BUF_STG 	BIAS_DIFF_OFF_LV0_BUF_STG_Msk
#define 	BIAS_DIFF_OFF_LV0_IBTYPE_SEL_Pos 	(0x13U)
#define 	BIAS_DIFF_OFF_LV0_IBTYPE_SEL_Msk 	(0x1UL << BIAS_DIFF_OFF_LV0_IBTYPE_SEL_Pos) 	/*!< 0x00080000 */
#define 	BIAS_DIFF_OFF_LV0_IBTYPE_SEL 	BIAS_DIFF_OFF_LV0_IBTYPE_SEL_Msk
#define 	BIAS_DIFF_OFF_LV0_EN_Pos 	(0x18U)
#define 	BIAS_DIFF_OFF_LV0_EN_Msk 	(0x1UL << BIAS_DIFF_OFF_LV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_DIFF_OFF_LV0_EN 	BIAS_DIFF_OFF_LV0_EN_Msk
#define 	BIAS_DIFF_OFF_LV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_DIFF_OFF_LV0_PULL_SEL_Msk 	(0x1UL << BIAS_DIFF_OFF_LV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_DIFF_OFF_LV0_PULL_SEL 	BIAS_DIFF_OFF_LV0_PULL_SEL_Msk
#define 	BIAS_DIFF_OFF_LV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_DIFF_OFF_LV0_SINGLE_Msk 	(0x1UL << BIAS_DIFF_OFF_LV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_DIFF_OFF_LV0_SINGLE 	BIAS_DIFF_OFF_LV0_SINGLE_Msk
#define BIAS_BIAS_INV_LV0 	(0x00001110UL) 	/*<! 'bias_inv_lv config bank0' */
#define 	BIAS_INV_LV0_CTL_Pos 	(0x0U)
#define 	BIAS_INV_LV0_CTL_Msk 	(0x7FUL << BIAS_INV_LV0_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_INV_LV0_CTL 	BIAS_INV_LV0_CTL_Msk
#define 	BIAS_INV_LV0_BUF_STG_Pos 	(0x10U)
#define 	BIAS_INV_LV0_BUF_STG_Msk 	(0x3UL << BIAS_INV_LV0_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_INV_LV0_BUF_STG 	BIAS_INV_LV0_BUF_STG_Msk
#define 	BIAS_INV_LV0_EN_Pos 	(0x18U)
#define 	BIAS_INV_LV0_EN_Msk 	(0x1UL << BIAS_INV_LV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_INV_LV0_EN 	BIAS_INV_LV0_EN_Msk
#define 	BIAS_INV_LV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_INV_LV0_PULL_SEL_Msk 	(0x1UL << BIAS_INV_LV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_INV_LV0_PULL_SEL 	BIAS_INV_LV0_PULL_SEL_Msk
#define 	BIAS_INV_LV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_INV_LV0_SINGLE_Msk 	(0x1UL << BIAS_INV_LV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_INV_LV0_SINGLE 	BIAS_INV_LV0_SINGLE_Msk
#define BIAS_BIAS_REFR_LV0 	(0x00001114UL) 	/*<! 'bias_refr_lv config bank0' */
#define 	BIAS_REFR_LV0_CTL_Pos 	(0x0U)
#define 	BIAS_REFR_LV0_CTL_Msk 	(0x7FUL << BIAS_REFR_LV0_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_REFR_LV0_CTL 	BIAS_REFR_LV0_CTL_Msk
#define 	BIAS_REFR_LV0_BUF_STG_Pos 	(0x10U)
#define 	BIAS_REFR_LV0_BUF_STG_Msk 	(0x3UL << BIAS_REFR_LV0_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_REFR_LV0_BUF_STG 	BIAS_REFR_LV0_BUF_STG_Msk
#define 	BIAS_REFR_LV0_RANGE_SEL_Pos 	(0x13U)
#define 	BIAS_REFR_LV0_RANGE_SEL_Msk 	(0x1UL << BIAS_REFR_LV0_RANGE_SEL_Pos) 	/*!< 0x00080000 */
#define 	BIAS_REFR_LV0_RANGE_SEL 	BIAS_REFR_LV0_RANGE_SEL_Msk
#define 	BIAS_REFR_LV0_DC_TRIM_BIT_Pos 	(0x14U)
#define 	BIAS_REFR_LV0_DC_TRIM_BIT_Msk 	(0x1UL << BIAS_REFR_LV0_DC_TRIM_BIT_Pos) 	/*!< 0x00100000 */
#define 	BIAS_REFR_LV0_DC_TRIM_BIT 	BIAS_REFR_LV0_DC_TRIM_BIT_Msk
#define 	BIAS_REFR_LV0_EN_Pos 	(0x18U)
#define 	BIAS_REFR_LV0_EN_Msk 	(0x1UL << BIAS_REFR_LV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_REFR_LV0_EN 	BIAS_REFR_LV0_EN_Msk
#define 	BIAS_REFR_LV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_REFR_LV0_PULL_SEL_Msk 	(0x1UL << BIAS_REFR_LV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_REFR_LV0_PULL_SEL 	BIAS_REFR_LV0_PULL_SEL_Msk
#define 	BIAS_REFR_LV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_REFR_LV0_SINGLE_Msk 	(0x1UL << BIAS_REFR_LV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_REFR_LV0_SINGLE 	BIAS_REFR_LV0_SINGLE_Msk
#define BIAS_BIAS_INVP_LV0 	(0x00001118UL) 	/*<! 'bias_invp_lv config bank0' */
#define 	BIAS_INVP_LV0_CTL_Pos 	(0x0U)
#define 	BIAS_INVP_LV0_CTL_Msk 	(0x7FUL << BIAS_INVP_LV0_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_INVP_LV0_CTL 	BIAS_INVP_LV0_CTL_Msk
#define 	BIAS_INVP_LV0_BUF_STG_Pos 	(0x10U)
#define 	BIAS_INVP_LV0_BUF_STG_Msk 	(0x3UL << BIAS_INVP_LV0_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_INVP_LV0_BUF_STG 	BIAS_INVP_LV0_BUF_STG_Msk
#define 	BIAS_INVP_LV0_EN_Pos 	(0x18U)
#define 	BIAS_INVP_LV0_EN_Msk 	(0x1UL << BIAS_INVP_LV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_INVP_LV0_EN 	BIAS_INVP_LV0_EN_Msk
#define 	BIAS_INVP_LV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_INVP_LV0_PULL_SEL_Msk 	(0x1UL << BIAS_INVP_LV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_INVP_LV0_PULL_SEL 	BIAS_INVP_LV0_PULL_SEL_Msk
#define 	BIAS_INVP_LV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_INVP_LV0_SINGLE_Msk 	(0x1UL << BIAS_INVP_LV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_INVP_LV0_SINGLE 	BIAS_INVP_LV0_SINGLE_Msk
#define BIAS_BIAS_REQ_PU_LV0 	(0x0000111CUL) 	/*<! 'bias_req_pu_lv config bank0' */
#define 	BIAS_REQ_PU_LV0_CTL_Pos 	(0x0U)
#define 	BIAS_REQ_PU_LV0_CTL_Msk 	(0xFFUL << BIAS_REQ_PU_LV0_CTL_Pos) 	/*!< 0x000000FF */
#define 	BIAS_REQ_PU_LV0_CTL 	BIAS_REQ_PU_LV0_CTL_Msk
#define 	BIAS_REQ_PU_LV0_EN_Pos 	(0x18U)
#define 	BIAS_REQ_PU_LV0_EN_Msk 	(0x1UL << BIAS_REQ_PU_LV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_REQ_PU_LV0_EN 	BIAS_REQ_PU_LV0_EN_Msk
#define 	BIAS_REQ_PU_LV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_REQ_PU_LV0_PULL_SEL_Msk 	(0x1UL << BIAS_REQ_PU_LV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_REQ_PU_LV0_PULL_SEL 	BIAS_REQ_PU_LV0_PULL_SEL_Msk
#define 	BIAS_REQ_PU_LV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_REQ_PU_LV0_SINGLE_Msk 	(0x1UL << BIAS_REQ_PU_LV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_REQ_PU_LV0_SINGLE 	BIAS_REQ_PU_LV0_SINGLE_Msk
#define BIAS_BIAS_SM_PDY_LV0 	(0x00001120UL) 	/*<! 'bias_sm_pdy_lv config bank0' */
#define 	BIAS_SM_PDY_LV0_CTL_Pos 	(0x0U)
#define 	BIAS_SM_PDY_LV0_CTL_Msk 	(0xFFUL << BIAS_SM_PDY_LV0_CTL_Pos) 	/*!< 0x000000FF */
#define 	BIAS_SM_PDY_LV0_CTL 	BIAS_SM_PDY_LV0_CTL_Msk
#define 	BIAS_SM_PDY_LV0_EN_Pos 	(0x18U)
#define 	BIAS_SM_PDY_LV0_EN_Msk 	(0x1UL << BIAS_SM_PDY_LV0_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_SM_PDY_LV0_EN 	BIAS_SM_PDY_LV0_EN_Msk
#define 	BIAS_SM_PDY_LV0_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_SM_PDY_LV0_PULL_SEL_Msk 	(0x1UL << BIAS_SM_PDY_LV0_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_SM_PDY_LV0_PULL_SEL 	BIAS_SM_PDY_LV0_PULL_SEL_Msk
#define 	BIAS_SM_PDY_LV0_SINGLE_Pos 	(0x1CU)
#define 	BIAS_SM_PDY_LV0_SINGLE_Msk 	(0x1UL << BIAS_SM_PDY_LV0_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_SM_PDY_LV0_SINGLE 	BIAS_SM_PDY_LV0_SINGLE_Msk
#define BIAS_BIAS_HPF_LV1 	(0x00001124UL) 	/*<! 'bias_hpf_lv config bank1' */
#define 	BIAS_HPF_LV1_CTL_Pos 	(0x0U)
#define 	BIAS_HPF_LV1_CTL_Msk 	(0x7FUL << BIAS_HPF_LV1_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_HPF_LV1_CTL 	BIAS_HPF_LV1_CTL_Msk
#define 	BIAS_HPF_LV1_BUF_STG_Pos 	(0x10U)
#define 	BIAS_HPF_LV1_BUF_STG_Msk 	(0x3UL << BIAS_HPF_LV1_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_HPF_LV1_BUF_STG 	BIAS_HPF_LV1_BUF_STG_Msk
#define 	BIAS_HPF_LV1_EN_Pos 	(0x18U)
#define 	BIAS_HPF_LV1_EN_Msk 	(0x1UL << BIAS_HPF_LV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_HPF_LV1_EN 	BIAS_HPF_LV1_EN_Msk
#define 	BIAS_HPF_LV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_HPF_LV1_PULL_SEL_Msk 	(0x1UL << BIAS_HPF_LV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_HPF_LV1_PULL_SEL 	BIAS_HPF_LV1_PULL_SEL_Msk
#define 	BIAS_HPF_LV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_HPF_LV1_SINGLE_Msk 	(0x1UL << BIAS_HPF_LV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_HPF_LV1_SINGLE 	BIAS_HPF_LV1_SINGLE_Msk
#define BIAS_BIAS_DIFF_ON_LV1 	(0x00001128UL) 	/*<! 'bias_diff_on_lv config bank1' */
#define 	BIAS_DIFF_ON_LV1_CTL_Pos 	(0x0U)
#define 	BIAS_DIFF_ON_LV1_CTL_Msk 	(0x7FUL << BIAS_DIFF_ON_LV1_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_DIFF_ON_LV1_CTL 	BIAS_DIFF_ON_LV1_CTL_Msk
#define 	BIAS_DIFF_ON_LV1_BUF_STG_Pos 	(0x10U)
#define 	BIAS_DIFF_ON_LV1_BUF_STG_Msk 	(0x3UL << BIAS_DIFF_ON_LV1_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_DIFF_ON_LV1_BUF_STG 	BIAS_DIFF_ON_LV1_BUF_STG_Msk
#define 	BIAS_DIFF_ON_LV1_IBTYPE_SEL_Pos 	(0x13U)
#define 	BIAS_DIFF_ON_LV1_IBTYPE_SEL_Msk 	(0x1UL << BIAS_DIFF_ON_LV1_IBTYPE_SEL_Pos) 	/*!< 0x00080000 */
#define 	BIAS_DIFF_ON_LV1_IBTYPE_SEL 	BIAS_DIFF_ON_LV1_IBTYPE_SEL_Msk
#define 	BIAS_DIFF_ON_LV1_EN_Pos 	(0x18U)
#define 	BIAS_DIFF_ON_LV1_EN_Msk 	(0x1UL << BIAS_DIFF_ON_LV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_DIFF_ON_LV1_EN 	BIAS_DIFF_ON_LV1_EN_Msk
#define 	BIAS_DIFF_ON_LV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_DIFF_ON_LV1_PULL_SEL_Msk 	(0x1UL << BIAS_DIFF_ON_LV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_DIFF_ON_LV1_PULL_SEL 	BIAS_DIFF_ON_LV1_PULL_SEL_Msk
#define 	BIAS_DIFF_ON_LV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_DIFF_ON_LV1_SINGLE_Msk 	(0x1UL << BIAS_DIFF_ON_LV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_DIFF_ON_LV1_SINGLE 	BIAS_DIFF_ON_LV1_SINGLE_Msk
#define BIAS_BIAS_DIFF_LV1 	(0x0000112CUL) 	/*<! 'bias_diff_lv config bank1' */
#define 	BIAS_DIFF_LV1_CTL_Pos 	(0x0U)
#define 	BIAS_DIFF_LV1_CTL_Msk 	(0x7FUL << BIAS_DIFF_LV1_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_DIFF_LV1_CTL 	BIAS_DIFF_LV1_CTL_Msk
#define 	BIAS_DIFF_LV1_BUF_STG_Pos 	(0x10U)
#define 	BIAS_DIFF_LV1_BUF_STG_Msk 	(0x3UL << BIAS_DIFF_LV1_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_DIFF_LV1_BUF_STG 	BIAS_DIFF_LV1_BUF_STG_Msk
#define 	BIAS_DIFF_LV1_EN_Pos 	(0x18U)
#define 	BIAS_DIFF_LV1_EN_Msk 	(0x1UL << BIAS_DIFF_LV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_DIFF_LV1_EN 	BIAS_DIFF_LV1_EN_Msk
#define 	BIAS_DIFF_LV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_DIFF_LV1_PULL_SEL_Msk 	(0x1UL << BIAS_DIFF_LV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_DIFF_LV1_PULL_SEL 	BIAS_DIFF_LV1_PULL_SEL_Msk
#define 	BIAS_DIFF_LV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_DIFF_LV1_SINGLE_Msk 	(0x1UL << BIAS_DIFF_LV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_DIFF_LV1_SINGLE 	BIAS_DIFF_LV1_SINGLE_Msk
#define BIAS_BIAS_DIFF_OFF_LV1 	(0x00001130UL) 	/*<! 'bias_diff_off_lv config bank1 */
#define 	BIAS_DIFF_OFF_LV1_CTL_Pos 	(0x0U)
#define 	BIAS_DIFF_OFF_LV1_CTL_Msk 	(0x7FUL << BIAS_DIFF_OFF_LV1_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_DIFF_OFF_LV1_CTL 	BIAS_DIFF_OFF_LV1_CTL_Msk
#define 	BIAS_DIFF_OFF_LV1_BUF_STG_Pos 	(0x10U)
#define 	BIAS_DIFF_OFF_LV1_BUF_STG_Msk 	(0x3UL << BIAS_DIFF_OFF_LV1_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_DIFF_OFF_LV1_BUF_STG 	BIAS_DIFF_OFF_LV1_BUF_STG_Msk
#define 	BIAS_DIFF_OFF_LV1_IBTYPE_SEL_Pos 	(0x13U)
#define 	BIAS_DIFF_OFF_LV1_IBTYPE_SEL_Msk 	(0x1UL << BIAS_DIFF_OFF_LV1_IBTYPE_SEL_Pos) 	/*!< 0x00080000 */
#define 	BIAS_DIFF_OFF_LV1_IBTYPE_SEL 	BIAS_DIFF_OFF_LV1_IBTYPE_SEL_Msk
#define 	BIAS_DIFF_OFF_LV1_EN_Pos 	(0x18U)
#define 	BIAS_DIFF_OFF_LV1_EN_Msk 	(0x1UL << BIAS_DIFF_OFF_LV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_DIFF_OFF_LV1_EN 	BIAS_DIFF_OFF_LV1_EN_Msk
#define 	BIAS_DIFF_OFF_LV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_DIFF_OFF_LV1_PULL_SEL_Msk 	(0x1UL << BIAS_DIFF_OFF_LV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_DIFF_OFF_LV1_PULL_SEL 	BIAS_DIFF_OFF_LV1_PULL_SEL_Msk
#define 	BIAS_DIFF_OFF_LV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_DIFF_OFF_LV1_SINGLE_Msk 	(0x1UL << BIAS_DIFF_OFF_LV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_DIFF_OFF_LV1_SINGLE 	BIAS_DIFF_OFF_LV1_SINGLE_Msk
#define BIAS_BIAS_INV_LV1 	(0x00001134UL) 	/*<! 'bias_inv_lv config bank1' */
#define 	BIAS_INV_LV1_CTL_Pos 	(0x0U)
#define 	BIAS_INV_LV1_CTL_Msk 	(0x7FUL << BIAS_INV_LV1_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_INV_LV1_CTL 	BIAS_INV_LV1_CTL_Msk
#define 	BIAS_INV_LV1_BUF_STG_Pos 	(0x10U)
#define 	BIAS_INV_LV1_BUF_STG_Msk 	(0x3UL << BIAS_INV_LV1_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_INV_LV1_BUF_STG 	BIAS_INV_LV1_BUF_STG_Msk
#define 	BIAS_INV_LV1_EN_Pos 	(0x18U)
#define 	BIAS_INV_LV1_EN_Msk 	(0x1UL << BIAS_INV_LV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_INV_LV1_EN 	BIAS_INV_LV1_EN_Msk
#define 	BIAS_INV_LV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_INV_LV1_PULL_SEL_Msk 	(0x1UL << BIAS_INV_LV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_INV_LV1_PULL_SEL 	BIAS_INV_LV1_PULL_SEL_Msk
#define 	BIAS_INV_LV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_INV_LV1_SINGLE_Msk 	(0x1UL << BIAS_INV_LV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_INV_LV1_SINGLE 	BIAS_INV_LV1_SINGLE_Msk
#define BIAS_BIAS_REFR_LV1 	(0x00001138UL) 	/*<! 'bias_refr_lv config bank1' */
#define 	BIAS_REFR_LV1_CTL_Pos 	(0x0U)
#define 	BIAS_REFR_LV1_CTL_Msk 	(0x7FUL << BIAS_REFR_LV1_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_REFR_LV1_CTL 	BIAS_REFR_LV1_CTL_Msk
#define 	BIAS_REFR_LV1_BUF_STG_Pos 	(0x10U)
#define 	BIAS_REFR_LV1_BUF_STG_Msk 	(0x3UL << BIAS_REFR_LV1_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_REFR_LV1_BUF_STG 	BIAS_REFR_LV1_BUF_STG_Msk
#define 	BIAS_REFR_LV1_RANGE_SEL_Pos 	(0x13U)
#define 	BIAS_REFR_LV1_RANGE_SEL_Msk 	(0x1UL << BIAS_REFR_LV1_RANGE_SEL_Pos) 	/*!< 0x00080000 */
#define 	BIAS_REFR_LV1_RANGE_SEL 	BIAS_REFR_LV1_RANGE_SEL_Msk
#define 	BIAS_REFR_LV1_DC_TRIM_BIT_Pos 	(0x14U)
#define 	BIAS_REFR_LV1_DC_TRIM_BIT_Msk 	(0x1UL << BIAS_REFR_LV1_DC_TRIM_BIT_Pos) 	/*!< 0x00100000 */
#define 	BIAS_REFR_LV1_DC_TRIM_BIT 	BIAS_REFR_LV1_DC_TRIM_BIT_Msk
#define 	BIAS_REFR_LV1_EN_Pos 	(0x18U)
#define 	BIAS_REFR_LV1_EN_Msk 	(0x1UL << BIAS_REFR_LV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_REFR_LV1_EN 	BIAS_REFR_LV1_EN_Msk
#define 	BIAS_REFR_LV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_REFR_LV1_PULL_SEL_Msk 	(0x1UL << BIAS_REFR_LV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_REFR_LV1_PULL_SEL 	BIAS_REFR_LV1_PULL_SEL_Msk
#define 	BIAS_REFR_LV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_REFR_LV1_SINGLE_Msk 	(0x1UL << BIAS_REFR_LV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_REFR_LV1_SINGLE 	BIAS_REFR_LV1_SINGLE_Msk
#define BIAS_BIAS_INVP_LV1 	(0x0000113CUL) 	/*<! 'bias_invp_lv config bank1' */
#define 	BIAS_INVP_LV1_CTL_Pos 	(0x0U)
#define 	BIAS_INVP_LV1_CTL_Msk 	(0x7FUL << BIAS_INVP_LV1_CTL_Pos) 	/*!< 0x0000007F */
#define 	BIAS_INVP_LV1_CTL 	BIAS_INVP_LV1_CTL_Msk
#define 	BIAS_INVP_LV1_BUF_STG_Pos 	(0x10U)
#define 	BIAS_INVP_LV1_BUF_STG_Msk 	(0x3UL << BIAS_INVP_LV1_BUF_STG_Pos) 	/*!< 0x00030000 */
#define 	BIAS_INVP_LV1_BUF_STG 	BIAS_INVP_LV1_BUF_STG_Msk
#define 	BIAS_INVP_LV1_EN_Pos 	(0x18U)
#define 	BIAS_INVP_LV1_EN_Msk 	(0x1UL << BIAS_INVP_LV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_INVP_LV1_EN 	BIAS_INVP_LV1_EN_Msk
#define 	BIAS_INVP_LV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_INVP_LV1_PULL_SEL_Msk 	(0x1UL << BIAS_INVP_LV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_INVP_LV1_PULL_SEL 	BIAS_INVP_LV1_PULL_SEL_Msk
#define 	BIAS_INVP_LV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_INVP_LV1_SINGLE_Msk 	(0x1UL << BIAS_INVP_LV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_INVP_LV1_SINGLE 	BIAS_INVP_LV1_SINGLE_Msk
#define BIAS_BIAS_REQ_PU_LV1 	(0x00001140UL) 	/*<! 'bias_req_pu_lv config bank1' */
#define 	BIAS_REQ_PU_LV1_CTL_Pos 	(0x0U)
