jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	BIAS_REQ_PU_LV1_CTL_Msk 	(0xFFUL << BIAS_REQ_PU_LV1_CTL_Pos) 	/*!< 0x000000FF */
#define 	BIAS_REQ_PU_LV1_CTL 	BIAS_REQ_PU_LV1_CTL_Msk
#define 	BIAS_REQ_PU_LV1_EN_Pos 	(0x18U)
#define 	BIAS_REQ_PU_LV1_EN_Msk 	(0x1UL << BIAS_REQ_PU_LV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_REQ_PU_LV1_EN 	BIAS_REQ_PU_LV1_EN_Msk
#define 	BIAS_REQ_PU_LV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_REQ_PU_LV1_PULL_SEL_Msk 	(0x1UL << BIAS_REQ_PU_LV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_REQ_PU_LV1_PULL_SEL 	BIAS_REQ_PU_LV1_PULL_SEL_Msk
#define 	BIAS_REQ_PU_LV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_REQ_PU_LV1_SINGLE_Msk 	(0x1UL << BIAS_REQ_PU_LV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_REQ_PU_LV1_SINGLE 	BIAS_REQ_PU_LV1_SINGLE_Msk
#define BIAS_BIAS_SM_PDY_LV1 	(0x00001144UL) 	/*<! 'bias_sm_pdy_lv config bank1' */
#define 	BIAS_SM_PDY_LV1_CTL_Pos 	(0x0U)
#define 	BIAS_SM_PDY_LV1_CTL_Msk 	(0xFFUL << BIAS_SM_PDY_LV1_CTL_Pos) 	/*!< 0x000000FF */
#define 	BIAS_SM_PDY_LV1_CTL 	BIAS_SM_PDY_LV1_CTL_Msk
#define 	BIAS_SM_PDY_LV1_EN_Pos 	(0x18U)
#define 	BIAS_SM_PDY_LV1_EN_Msk 	(0x1UL << BIAS_SM_PDY_LV1_EN_Pos) 	/*!< 0x01000000 */
#define 	BIAS_SM_PDY_LV1_EN 	BIAS_SM_PDY_LV1_EN_Msk
#define 	BIAS_SM_PDY_LV1_PULL_SEL_Pos 	(0x19U)
#define 	BIAS_SM_PDY_LV1_PULL_SEL_Msk 	(0x1UL << BIAS_SM_PDY_LV1_PULL_SEL_Pos) 	/*!< 0x02000000 */
#define 	BIAS_SM_PDY_LV1_PULL_SEL 	BIAS_SM_PDY_LV1_PULL_SEL_Msk
#define 	BIAS_SM_PDY_LV1_SINGLE_Pos 	(0x1CU)
#define 	BIAS_SM_PDY_LV1_SINGLE_Msk 	(0x1UL << BIAS_SM_PDY_LV1_SINGLE_Pos) 	/*!< 0x10000000 */
#define 	BIAS_SM_PDY_LV1_SINGLE 	BIAS_SM_PDY_LV1_SINGLE_Msk
#define BIAS_BGEN_SPR 	(0x00001200UL) 	/*<! Spare registers */
#define BIAS_BGEN_TIMER 	(0x00001204UL) 	/*<! Controls setup and hold delay */
#define 	BIAS_BGEN_TIMER_Pos 	(0x0U)
#define 	BIAS_BGEN_TIMER_Msk 	(0xFFUL << BIAS_BGEN_TIMER_Pos) 	/*!< 0x000000FF */
#define BIAS_BGEN_CTRL 	(0x00001208UL) 	/*<!  */
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_HV_BANK_0_Pos 	(0x0U)
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_HV_BANK_0_Msk 	(0x1UL << BIAS_BGEN_CTRL_BURST_TRANSFER_HV_BANK_0_Pos) 	/*!< 0x00000001 */
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_HV_BANK_0 	BIAS_BGEN_CTRL_BURST_TRANSFER_HV_BANK_0_Msk
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_HV_BANK_1_Pos 	(0x1U)
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_HV_BANK_1_Msk 	(0x1UL << BIAS_BGEN_CTRL_BURST_TRANSFER_HV_BANK_1_Pos) 	/*!< 0x00000002 */
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_HV_BANK_1 	BIAS_BGEN_CTRL_BURST_TRANSFER_HV_BANK_1_Msk
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_LV_BANK_0_Pos 	(0x2U)
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_LV_BANK_0_Msk 	(0x1UL << BIAS_BGEN_CTRL_BURST_TRANSFER_LV_BANK_0_Pos) 	/*!< 0x00000004 */
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_LV_BANK_0 	BIAS_BGEN_CTRL_BURST_TRANSFER_LV_BANK_0_Msk
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_LV_BANK_1_Pos 	(0x3U)
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_LV_BANK_1_Msk 	(0x1UL << BIAS_BGEN_CTRL_BURST_TRANSFER_LV_BANK_1_Pos) 	/*!< 0x00000008 */
#define 	BIAS_BGEN_CTRL_BURST_TRANSFER_LV_BANK_1 	BIAS_BGEN_CTRL_BURST_TRANSFER_LV_BANK_1_Msk
#define 	BIAS_BGEN_CTRL_RSTN_HV_Pos 	(0x4U)
#define 	BIAS_BGEN_CTRL_RSTN_HV_Msk 	(0x1UL << BIAS_BGEN_CTRL_RSTN_HV_Pos) 	/*!< 0x00000010 */
#define 	BIAS_BGEN_CTRL_RSTN_HV 	BIAS_BGEN_CTRL_RSTN_HV_Msk
#define 	BIAS_BGEN_CTRL_RSTN_LV_Pos 	(0x5U)
#define 	BIAS_BGEN_CTRL_RSTN_LV_Msk 	(0x1UL << BIAS_BGEN_CTRL_RSTN_LV_Pos) 	/*!< 0x00000020 */
#define 	BIAS_BGEN_CTRL_RSTN_LV 	BIAS_BGEN_CTRL_RSTN_LV_Msk
#define BIAS_BGEN_BU_DFT 	(0x0000120CUL) 	/*<! Warning this register need to be written onehot to avoid short circuit in design */
#define 	BIAS_BGEN_BU_DFT_CTL_Pos 	(0x0U)
#define 	BIAS_BGEN_BU_DFT_CTL_Msk 	(0xFUL << BIAS_BGEN_BU_DFT_CTL_Pos) 	/*!< 0x0000000F */
#define 	BIAS_BGEN_BU_DFT_CTL 	BIAS_BGEN_BU_DFT_CTL_Msk
#define 	BIAS_BGEN_BU_DFT_CTL_VALID_Pos 	(0x4U)
#define 	BIAS_BGEN_BU_DFT_CTL_VALID_Msk 	(0x1UL << BIAS_BGEN_BU_DFT_CTL_VALID_Pos) 	/*!< 0x00000010 */
#define 	BIAS_BGEN_BU_DFT_CTL_VALID 	BIAS_BGEN_BU_DFT_CTL_VALID_Msk
#define BIAS_BGEN_BU_IRPOLY_DFT 	(0x00001210UL) 	/*<! Configuration of the irpoly current mirror used in dft. */
#define 	BIAS_BGEN_BU_IRPOLY_DFT_EN_Pos 	(0x0U)
#define 	BIAS_BGEN_BU_IRPOLY_DFT_EN_Msk 	(0x1UL << BIAS_BGEN_BU_IRPOLY_DFT_EN_Pos) 	/*!< 0x00000001 */
#define 	BIAS_BGEN_BU_IRPOLY_DFT_EN 	BIAS_BGEN_BU_IRPOLY_DFT_EN_Msk
#define 	BIAS_BGEN_BU_IRPOLY_DFT_SEL_Pos 	(0x1U)
#define 	BIAS_BGEN_BU_IRPOLY_DFT_SEL_Msk 	(0x1UL << BIAS_BGEN_BU_IRPOLY_DFT_SEL_Pos) 	/*!< 0x00000002 */
#define 	BIAS_BGEN_BU_IRPOLY_DFT_SEL 	BIAS_BGEN_BU_IRPOLY_DFT_SEL_Msk
#define BIAS_BGEN_REF_DFT 	(0x00001214UL) 	/*<! Configuration of the bias_ref_dft block */
#define 	BIAS_BGEN_REF_DFT_EN_Pos 	(0x0U)
#define 	BIAS_BGEN_REF_DFT_EN_Msk 	(0x1UL << BIAS_BGEN_REF_DFT_EN_Pos) 	/*!< 0x00000001 */
#define 	BIAS_BGEN_REF_DFT_EN 	BIAS_BGEN_REF_DFT_EN_Msk
#define 	BIAS_BGEN_REF_DFT_CTL_Pos 	(0x1U)
#define 	BIAS_BGEN_REF_DFT_CTL_Msk 	(0xFUL << BIAS_BGEN_REF_DFT_CTL_Pos) 	/*!< 0x0000001E */
#define 	BIAS_BGEN_REF_DFT_CTL 	BIAS_BGEN_REF_DFT_CTL_Msk
#define BIAS_BGEN_CGM_SUB 	(0x00001218UL) 	/*<! This register is used to control the bias_cgm_sub block */
#define 	BIAS_BGEN_CGM_SUB_EN_Pos 	(0x0U)
#define 	BIAS_BGEN_CGM_SUB_EN_Msk 	(0x1UL << BIAS_BGEN_CGM_SUB_EN_Pos) 	/*!< 0x00000001 */
#define 	BIAS_BGEN_CGM_SUB_EN 	BIAS_BGEN_CGM_SUB_EN_Msk
#define 	BIAS_BGEN_CGM_SUB_TRIM_Pos 	(0x1U)
#define 	BIAS_BGEN_CGM_SUB_TRIM_Msk 	(0xFUL << BIAS_BGEN_CGM_SUB_TRIM_Pos) 	/*!< 0x0000001E */
#define 	BIAS_BGEN_CGM_SUB_TRIM 	BIAS_BGEN_CGM_SUB_TRIM_Msk
#define 	BIAS_BGEN_CGM_SUB_SLP_CTL_Pos 	(0x5U)
#define 	BIAS_BGEN_CGM_SUB_SLP_CTL_Msk 	(0xFUL << BIAS_BGEN_CGM_SUB_SLP_CTL_Pos) 	/*!< 0x000001E0 */
#define 	BIAS_BGEN_CGM_SUB_SLP_CTL 	BIAS_BGEN_CGM_SUB_SLP_CTL_Msk
#define BIAS_BGEN_CGM_SUB_STATUS 	(0x0000121CUL) 	/*<! This register enables the user to check the bias_cgm_sub status */
#define 	BIAS_BGEN_CGM_SUB_STATUS_RDY_DYN_Pos 	(0x0U)
#define 	BIAS_BGEN_CGM_SUB_STATUS_RDY_DYN_Msk 	(0x1UL << BIAS_BGEN_CGM_SUB_STATUS_RDY_DYN_Pos) 	/*!< 0x00000001 */
#define 	BIAS_BGEN_CGM_SUB_STATUS_RDY_DYN 	BIAS_BGEN_CGM_SUB_STATUS_RDY_DYN_Msk
#define BIAS_BGEN_CC_EN 	(0x00001220UL) 	/*<! Configuration of the local biases coarse central blocks. */
#define 	BIAS_BGEN_CC_EN_HV_Pos 	(0x0U)
#define 	BIAS_BGEN_CC_EN_HV_Msk 	(0x1UL << BIAS_BGEN_CC_EN_HV_Pos) 	/*!< 0x00000001 */
#define 	BIAS_BGEN_CC_EN_HV 	BIAS_BGEN_CC_EN_HV_Msk
#define 	BIAS_BGEN_CC_EN_LV_Pos 	(0x1U)
#define 	BIAS_BGEN_CC_EN_LV_Msk 	(0x1UL << BIAS_BGEN_CC_EN_LV_Pos) 	/*!< 0x00000002 */
#define 	BIAS_BGEN_CC_EN_LV 	BIAS_BGEN_CC_EN_LV_Msk
#define BIAS_BGEN_NMIR_EN 	(0x00001224UL) 	/*<!  */
#define 	BIAS_BGEN_NMIR_EN_IRPOLY_MIR_N_HV_Pos 	(0x0U)
#define 	BIAS_BGEN_NMIR_EN_IRPOLY_MIR_N_HV_Msk 	(0x1UL << BIAS_BGEN_NMIR_EN_IRPOLY_MIR_N_HV_Pos) 	/*!< 0x00000001 */
#define 	BIAS_BGEN_NMIR_EN_IRPOLY_MIR_N_HV 	BIAS_BGEN_NMIR_EN_IRPOLY_MIR_N_HV_Msk
#define BIAS_BGEN_FES_SHDIO 	(0x00001228UL) 	/*<! Configuration of the bias_fes shift through offset current or diode. */
#define 	BIAS_BGEN_FES_SHDIO_SHIFT_CTL_Pos 	(0x0U)
#define 	BIAS_BGEN_FES_SHDIO_SHIFT_CTL_Msk 	(0xFUL << BIAS_BGEN_FES_SHDIO_SHIFT_CTL_Pos) 	/*!< 0x0000000F */
#define 	BIAS_BGEN_FES_SHDIO_SHIFT_CTL 	BIAS_BGEN_FES_SHDIO_SHIFT_CTL_Msk
#define 	BIAS_BGEN_FES_SHDIO_DIODE_CTL_Pos 	(0x4U)
#define 	BIAS_BGEN_FES_SHDIO_DIODE_CTL_Msk 	(0x3UL << BIAS_BGEN_FES_SHDIO_DIODE_CTL_Pos) 	/*!< 0x00000030 */
#define 	BIAS_BGEN_FES_SHDIO_DIODE_CTL 	BIAS_BGEN_FES_SHDIO_DIODE_CTL_Msk
#define BIAS_BGEN_DIFF_ON_VDSN 	(0x0000122CUL) 	/*<! vds margin control of the nmos current used in bias_diff_on */
#define 	BIAS_BGEN_DIFF_ON_VDSN_CTL_Pos 	(0x0U)
#define 	BIAS_BGEN_DIFF_ON_VDSN_CTL_Msk 	(0x7UL << BIAS_BGEN_DIFF_ON_VDSN_CTL_Pos) 	/*!< 0x00000007 */
#define 	BIAS_BGEN_DIFF_ON_VDSN_CTL 	BIAS_BGEN_DIFF_ON_VDSN_CTL_Msk
#define BIAS_BGEN_DIFF_OFF_VDSN 	(0x00001230UL) 	/*<! vds margin control of the nmos current used in bias_diff_off */
#define 	BIAS_BGEN_DIFF_OFF_VDSN_CTL_Pos 	(0x0U)
#define 	BIAS_BGEN_DIFF_OFF_VDSN_CTL_Msk 	(0x7UL << BIAS_BGEN_DIFF_OFF_VDSN_CTL_Pos) 	/*!< 0x00000007 */
#define 	BIAS_BGEN_DIFF_OFF_VDSN_CTL 	BIAS_BGEN_DIFF_OFF_VDSN_CTL_Msk

