jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * ROI: ROI Register Map
 * ------------------------------------------------------ */

#define ROI_TD_ROI_X00 	(0x00002000UL) 	/*<! TD ROI X Register 0(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X00_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X00_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X00_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X00_EFFECTIVE 	ROI_TD_X00_EFFECTIVE_Msk
#define ROI_TD_ROI_X01 	(0x00002004UL) 	/*<! TD ROI X Register 1(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X01_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X01_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X01_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X01_EFFECTIVE 	ROI_TD_X01_EFFECTIVE_Msk
#define ROI_TD_ROI_X02 	(0x00002008UL) 	/*<! TD ROI X Register 2(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X02_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X02_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X02_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X02_EFFECTIVE 	ROI_TD_X02_EFFECTIVE_Msk
#define ROI_TD_ROI_X03 	(0x0000200CUL) 	/*<! TD ROI X Register 3(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X03_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X03_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X03_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X03_EFFECTIVE 	ROI_TD_X03_EFFECTIVE_Msk
#define ROI_TD_ROI_X04 	(0x00002010UL) 	/*<! TD ROI X Register 4(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X04_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X04_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X04_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X04_EFFECTIVE 	ROI_TD_X04_EFFECTIVE_Msk
#define ROI_TD_ROI_X05 	(0x00002014UL) 	/*<! TD ROI X Register 5(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X05_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X05_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X05_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X05_EFFECTIVE 	ROI_TD_X05_EFFECTIVE_Msk
#define ROI_TD_ROI_X06 	(0x00002018UL) 	/*<! TD ROI X Register 6(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X06_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X06_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X06_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X06_EFFECTIVE 	ROI_TD_X06_EFFECTIVE_Msk
#define ROI_TD_ROI_X07 	(0x0000201CUL) 	/*<! TD ROI X Register 7(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X07_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X07_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X07_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X07_EFFECTIVE 	ROI_TD_X07_EFFECTIVE_Msk
#define ROI_TD_ROI_X08 	(0x00002020UL) 	/*<! TD ROI X Register 8(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X08_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X08_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X08_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X08_EFFECTIVE 	ROI_TD_X08_EFFECTIVE_Msk
#define ROI_TD_ROI_X09 	(0x00002024UL) 	/*<! TD ROI X Register 9(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X09_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X09_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X09_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X09_EFFECTIVE 	ROI_TD_X09_EFFECTIVE_Msk
#define ROI_TD_ROI_X10 	(0x00002028UL) 	/*<! TD ROI X Register 10(Those are connected to pin 'data' of integrated pixel Latch) */
#define 	ROI_TD_X10_SCAN_PX_LEFT_Pos 	(0x0U)
#define 	ROI_TD_X10_SCAN_PX_LEFT_Msk 	(0x1UL << ROI_TD_X10_SCAN_PX_LEFT_Pos) 	/*!< 0x00000001 */
#define 	ROI_TD_X10_SCAN_PX_LEFT 	ROI_TD_X10_SCAN_PX_LEFT_Msk
#define 	ROI_TD_X10_DUMMY_P_PX_LEFT_Pos 	(0x1U)
#define 	ROI_TD_X10_DUMMY_P_PX_LEFT_Msk 	(0x1UL << ROI_TD_X10_DUMMY_P_PX_LEFT_Pos) 	/*!< 0x00000002 */
#define 	ROI_TD_X10_DUMMY_P_PX_LEFT 	ROI_TD_X10_DUMMY_P_PX_LEFT_Msk
#define 	ROI_TD_X10_DUMMY_M_PX_LEFT_Pos 	(0x2U)
#define 	ROI_TD_X10_DUMMY_M_PX_LEFT_Msk 	(0x3UL << ROI_TD_X10_DUMMY_M_PX_LEFT_Pos) 	/*!< 0x0000000C */
#define 	ROI_TD_X10_DUMMY_M_PX_LEFT 	ROI_TD_X10_DUMMY_M_PX_LEFT_Msk
#define 	ROI_TD_X10_DUMMY_M_PX_RIGHT_Pos 	(0x4U)
#define 	ROI_TD_X10_DUMMY_M_PX_RIGHT_Msk 	(0x3UL << ROI_TD_X10_DUMMY_M_PX_RIGHT_Pos) 	/*!< 0x00000030 */
#define 	ROI_TD_X10_DUMMY_M_PX_RIGHT 	ROI_TD_X10_DUMMY_M_PX_RIGHT_Msk
#define 	ROI_TD_X10_DUMMY_P_PX_RIGHT_Pos 	(0x6U)
#define 	ROI_TD_X10_DUMMY_P_PX_RIGHT_Msk 	(0x1UL << ROI_TD_X10_DUMMY_P_PX_RIGHT_Pos) 	/*!< 0x00000040 */
#define 	ROI_TD_X10_DUMMY_P_PX_RIGHT 	ROI_TD_X10_DUMMY_P_PX_RIGHT_Msk
#define 	ROI_TD_X10_SCAN_AND_TEST_PX_RIGHT_Pos 	(0x7U)
#define 	ROI_TD_X10_SCAN_AND_TEST_PX_RIGHT_Msk 	(0x1UL << ROI_TD_X10_SCAN_AND_TEST_PX_RIGHT_Pos) 	/*!< 0x00000080 */
#define 	ROI_TD_X10_SCAN_AND_TEST_PX_RIGHT 	ROI_TD_X10_SCAN_AND_TEST_PX_RIGHT_Msk
#define ROI_TD_ROI_X_XOR00 	(0x00002800UL) 	/*<! TD ROI X(xor) Register 0(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR00_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X_XOR00_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X_XOR00_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X_XOR00_EFFECTIVE 	ROI_TD_X_XOR00_EFFECTIVE_Msk
#define ROI_TD_ROI_X_XOR01 	(0x00002804UL) 	/*<! TD ROI X(xor) Register 1(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR01_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X_XOR01_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X_XOR01_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X_XOR01_EFFECTIVE 	ROI_TD_X_XOR01_EFFECTIVE_Msk
#define ROI_TD_ROI_X_XOR02 	(0x00002808UL) 	/*<! TD ROI X(xor) Register 2(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR02_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X_XOR02_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X_XOR02_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X_XOR02_EFFECTIVE 	ROI_TD_X_XOR02_EFFECTIVE_Msk
#define ROI_TD_ROI_X_XOR03 	(0x0000280CUL) 	/*<! TD ROI X(xor) Register 3(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR03_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X_XOR03_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X_XOR03_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X_XOR03_EFFECTIVE 	ROI_TD_X_XOR03_EFFECTIVE_Msk
#define ROI_TD_ROI_X_XOR04 	(0x00002810UL) 	/*<! TD ROI X(xor) Register 4(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR04_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X_XOR04_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X_XOR04_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X_XOR04_EFFECTIVE 	ROI_TD_X_XOR04_EFFECTIVE_Msk
#define ROI_TD_ROI_X_XOR05 	(0x00002814UL) 	/*<! TD ROI X(xor) Register 5(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR05_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X_XOR05_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X_XOR05_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X_XOR05_EFFECTIVE 	ROI_TD_X_XOR05_EFFECTIVE_Msk
#define ROI_TD_ROI_X_XOR06 	(0x00002818UL) 	/*<! TD ROI X(xor) Register 6(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR06_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X_XOR06_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X_XOR06_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X_XOR06_EFFECTIVE 	ROI_TD_X_XOR06_EFFECTIVE_Msk
#define ROI_TD_ROI_X_XOR07 	(0x0000281CUL) 	/*<! TD ROI X(xor) Register 7(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR07_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X_XOR07_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X_XOR07_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X_XOR07_EFFECTIVE 	ROI_TD_X_XOR07_EFFECTIVE_Msk
#define ROI_TD_ROI_X_XOR08 	(0x00002820UL) 	/*<! TD ROI X(xor) Register 8(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR08_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X_XOR08_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X_XOR08_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X_XOR08_EFFECTIVE 	ROI_TD_X_XOR08_EFFECTIVE_Msk
#define ROI_TD_ROI_X_XOR09 	(0x00002824UL) 	/*<! TD ROI X(xor) Register 9(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR09_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_X_XOR09_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_X_XOR09_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_X_XOR09_EFFECTIVE 	ROI_TD_X_XOR09_EFFECTIVE_Msk
#define ROI_TD_ROI_X_XOR10 	(0x00002828UL) 	/*<! TD ROI X(xor) Register 10(xor registers to be used with WindowsMaster/Slice mechanism) */
#define 	ROI_TD_X_XOR10_SCAN_PX_LEFT_Pos 	(0x0U)
#define 	ROI_TD_X_XOR10_SCAN_PX_LEFT_Msk 	(0x1UL << ROI_TD_X_XOR10_SCAN_PX_LEFT_Pos) 	/*!< 0x00000001 */
#define 	ROI_TD_X_XOR10_SCAN_PX_LEFT 	ROI_TD_X_XOR10_SCAN_PX_LEFT_Msk
#define 	ROI_TD_X_XOR10_DUMMY_P_PX_LEFT_Pos 	(0x1U)
#define 	ROI_TD_X_XOR10_DUMMY_P_PX_LEFT_Msk 	(0x1UL << ROI_TD_X_XOR10_DUMMY_P_PX_LEFT_Pos) 	/*!< 0x00000002 */
#define 	ROI_TD_X_XOR10_DUMMY_P_PX_LEFT 	ROI_TD_X_XOR10_DUMMY_P_PX_LEFT_Msk
#define 	ROI_TD_X_XOR10_DUMMY_M_PX_LEFT_Pos 	(0x2U)
#define 	ROI_TD_X_XOR10_DUMMY_M_PX_LEFT_Msk 	(0x3UL << ROI_TD_X_XOR10_DUMMY_M_PX_LEFT_Pos) 	/*!< 0x0000000C */
#define 	ROI_TD_X_XOR10_DUMMY_M_PX_LEFT 	ROI_TD_X_XOR10_DUMMY_M_PX_LEFT_Msk
#define 	ROI_TD_X_XOR10_DUMMY_M_PX_RIGHT_Pos 	(0x4U)
#define 	ROI_TD_X_XOR10_DUMMY_M_PX_RIGHT_Msk 	(0x3UL << ROI_TD_X_XOR10_DUMMY_M_PX_RIGHT_Pos) 	/*!< 0x00000030 */
#define 	ROI_TD_X_XOR10_DUMMY_M_PX_RIGHT 	ROI_TD_X_XOR10_DUMMY_M_PX_RIGHT_Msk
#define 	ROI_TD_X_XOR10_DUMMY_P_PX_RIGHT_Pos 	(0x6U)
#define 	ROI_TD_X_XOR10_DUMMY_P_PX_RIGHT_Msk 	(0x1UL << ROI_TD_X_XOR10_DUMMY_P_PX_RIGHT_Pos) 	/*!< 0x00000040 */
#define 	ROI_TD_X_XOR10_DUMMY_P_PX_RIGHT 	ROI_TD_X_XOR10_DUMMY_P_PX_RIGHT_Msk
#define 	ROI_TD_X_XOR10_SCAN_AND_TEST_PX_RIGHT_Pos 	(0x7U)
#define 	ROI_TD_X_XOR10_SCAN_AND_TEST_PX_RIGHT_Msk 	(0x1UL << ROI_TD_X_XOR10_SCAN_AND_TEST_PX_RIGHT_Pos) 	/*!< 0x00000080 */
#define 	ROI_TD_X_XOR10_SCAN_AND_TEST_PX_RIGHT 	ROI_TD_X_XOR10_SCAN_AND_TEST_PX_RIGHT_Msk
#define ROI_TD_ROI_Y00 	(0x00003000UL) 	/*<! TD ROI Y Register 0 (Those are connected to enable' pin of integrated pixels Latch */
#define 	ROI_TD_Y00_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_Y00_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_Y00_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_Y00_EFFECTIVE 	ROI_TD_Y00_EFFECTIVE_Msk
#define ROI_TD_ROI_Y01 	(0x00003004UL) 	/*<! TD ROI Y Register 1 (Those are connected to enable' pin of integrated pixels Latch */
#define 	ROI_TD_Y01_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_Y01_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_Y01_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_Y01_EFFECTIVE 	ROI_TD_Y01_EFFECTIVE_Msk
#define ROI_TD_ROI_Y02 	(0x00003008UL) 	/*<! TD ROI Y Register 2 (Those are connected to enable' pin of integrated pixels Latch */
#define 	ROI_TD_Y02_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_Y02_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_Y02_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_Y02_EFFECTIVE 	ROI_TD_Y02_EFFECTIVE_Msk
#define ROI_TD_ROI_Y03 	(0x0000300CUL) 	/*<! TD ROI Y Register 3 (Those are connected to enable' pin of integrated pixels Latch */
#define 	ROI_TD_Y03_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_Y03_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_Y03_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_Y03_EFFECTIVE 	ROI_TD_Y03_EFFECTIVE_Msk
#define ROI_TD_ROI_Y04 	(0x00003010UL) 	/*<! TD ROI Y Register 4 (Those are connected to enable' pin of integrated pixels Latch */
#define 	ROI_TD_Y04_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_Y04_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_Y04_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_Y04_EFFECTIVE 	ROI_TD_Y04_EFFECTIVE_Msk
#define ROI_TD_ROI_Y05 	(0x00003014UL) 	/*<! TD ROI Y Register 5 (Those are connected to enable' pin of integrated pixels Latch */
#define 	ROI_TD_Y05_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_Y05_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_Y05_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_Y05_EFFECTIVE 	ROI_TD_Y05_EFFECTIVE_Msk
#define ROI_TD_ROI_Y06 	(0x00003018UL) 	/*<! TD ROI Y Register 6 (Those are connected to enable' pin of integrated pixels Latch */
#define 	ROI_TD_Y06_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_Y06_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_Y06_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_Y06_EFFECTIVE 	ROI_TD_Y06_EFFECTIVE_Msk
#define ROI_TD_ROI_Y07 	(0x0000301CUL) 	/*<! TD ROI Y Register 7 (Those are connected to enable' pin of integrated pixels Latch */
#define 	ROI_TD_Y07_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_Y07_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_Y07_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_Y07_EFFECTIVE 	ROI_TD_Y07_EFFECTIVE_Msk
#define ROI_TD_ROI_Y08 	(0x00003020UL) 	/*<! TD ROI Y Register 8 (Those are connected to enable' pin of integrated pixels Latch */
#define 	ROI_TD_Y08_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_Y08_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_Y08_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_Y08_EFFECTIVE 	ROI_TD_Y08_EFFECTIVE_Msk
#define ROI_TD_ROI_Y09 	(0x00003024UL) 	/*<! TD ROI Y Register 9 (Those are connected to enable' pin of integrated pixels Latch */
#define 	ROI_TD_Y09_EFFECTIVE_Pos 	(0x0U)
#define 	ROI_TD_Y09_EFFECTIVE_Msk 	(0xFFFFFFFFUL << ROI_TD_Y09_EFFECTIVE_Pos) 	/*!< 0xFFFFFFFF */
#define 	ROI_TD_Y09_EFFECTIVE 	ROI_TD_Y09_EFFECTIVE_Msk
#define ROI_TD_ROI_Y10 	(0x00003028UL) 	/*<! TD ROI Y Register 10 */
#define 	ROI_TD_Y10_TEST_ROW0_Pos 	(0x0U)
#define 	ROI_TD_Y10_TEST_ROW0_Msk 	(0x1UL << ROI_TD_Y10_TEST_ROW0_Pos) 	/*!< 0x00000001 */
#define 	ROI_TD_Y10_TEST_ROW0 	ROI_TD_Y10_TEST_ROW0_Msk
#define 	ROI_TD_Y10_TEST_ROW1_Pos 	(0x1U)
#define 	ROI_TD_Y10_TEST_ROW1_Msk 	(0x1UL << ROI_TD_Y10_TEST_ROW1_Pos) 	/*!< 0x00000002 */
#define 	ROI_TD_Y10_TEST_ROW1 	ROI_TD_Y10_TEST_ROW1_Msk
#define 	ROI_TD_Y10_TEST_ROW2_Pos 	(0x2U)
#define 	ROI_TD_Y10_TEST_ROW2_Msk 	(0x1UL << ROI_TD_Y10_TEST_ROW2_Pos) 	/*!< 0x00000004 */
#define 	ROI_TD_Y10_TEST_ROW2 	ROI_TD_Y10_TEST_ROW2_Msk
#define 	ROI_TD_Y10_TEST_ROW3_Pos 	(0x3U)
#define 	ROI_TD_Y10_TEST_ROW3_Msk 	(0x1UL << ROI_TD_Y10_TEST_ROW3_Pos) 	/*!< 0x00000008 */
#define 	ROI_TD_Y10_TEST_ROW3 	ROI_TD_Y10_TEST_ROW3_Msk
#define 	ROI_TD_Y10_TEST_ROW4_Pos 	(0x4U)
#define 	ROI_TD_Y10_TEST_ROW4_Msk 	(0x1UL << ROI_TD_Y10_TEST_ROW4_Pos) 	/*!< 0x00000010 */
#define 	ROI_TD_Y10_TEST_ROW4 	ROI_TD_Y10_TEST_ROW4_Msk
#define 	ROI_TD_Y10_TEST_ROW5_Pos 	(0x5U)
#define 	ROI_TD_Y10_TEST_ROW5_Msk 	(0x1UL << ROI_TD_Y10_TEST_ROW5_Pos) 	/*!< 0x00000020 */
#define 	ROI_TD_Y10_TEST_ROW5 	ROI_TD_Y10_TEST_ROW5_Msk
#define 	ROI_TD_Y10_TEST_ROW6_Pos 	(0x6U)
#define 	ROI_TD_Y10_TEST_ROW6_Msk 	(0x1UL << ROI_TD_Y10_TEST_ROW6_Pos) 	/*!< 0x00000040 */
#define 	ROI_TD_Y10_TEST_ROW6 	ROI_TD_Y10_TEST_ROW6_Msk
#define 	ROI_TD_Y10_TEST_ROW7_Pos 	(0x7U)
#define 	ROI_TD_Y10_TEST_ROW7_Msk 	(0x1UL << ROI_TD_Y10_TEST_ROW7_Pos) 	/*!< 0x00000080 */
#define 	ROI_TD_Y10_TEST_ROW7 	ROI_TD_Y10_TEST_ROW7_Msk
#define 	ROI_TD_Y10_TEST_ROW8_Pos 	(0x8U)
#define 	ROI_TD_Y10_TEST_ROW8_Msk 	(0x1UL << ROI_TD_Y10_TEST_ROW8_Pos) 	/*!< 0x00000100 */
#define 	ROI_TD_Y10_TEST_ROW8 	ROI_TD_Y10_TEST_ROW8_Msk
#define 	ROI_TD_Y10_TEST_ROW9_Pos 	(0x9U)
#define 	ROI_TD_Y10_TEST_ROW9_Msk 	(0x1UL << ROI_TD_Y10_TEST_ROW9_Pos) 	/*!< 0x00000200 */
#define 	ROI_TD_Y10_TEST_ROW9 	ROI_TD_Y10_TEST_ROW9_Msk

