jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * EHC: Event Histogram Computer Register Map
 * ------------------------------------------------------ */

#define EHC_PIPELINE_CONTROL 	(0x00004000UL) 	/*<! Block Control register */
#define 	EHC_PIPELINE_CONTROL_ENABLE_Pos 	(0x0U)
#define 	EHC_PIPELINE_CONTROL_ENABLE_Msk 	(0x1UL << EHC_PIPELINE_CONTROL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	EHC_PIPELINE_CONTROL_ENABLE 	EHC_PIPELINE_CONTROL_ENABLE_Msk
#define 	EHC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos 	(0x1U)
#define 	EHC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk 	(0x1UL << EHC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos) 	/*!< 0x00000002 */
#define 	EHC_PIPELINE_CONTROL_DROP_NBACKPRESSURE 	EHC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk
#define 	EHC_PIPELINE_CONTROL_BYPASS_Pos 	(0x2U)
#define 	EHC_PIPELINE_CONTROL_BYPASS_Msk 	(0x1UL << EHC_PIPELINE_CONTROL_BYPASS_Pos) 	/*!< 0x00000004 */
#define 	EHC_PIPELINE_CONTROL_BYPASS 	EHC_PIPELINE_CONTROL_BYPASS_Msk
#define EHC_PIPELINE_STATUS 	(0x00004004UL) 	/*<! Block Status Register: This register give information about the internal status of the block. */
#define 	EHC_PIPELINE_STATUS_EMPTY_Pos 	(0x0U)
#define 	EHC_PIPELINE_STATUS_EMPTY_Msk 	(0x1UL << EHC_PIPELINE_STATUS_EMPTY_Pos) 	/*!< 0x00000001 */
#define 	EHC_PIPELINE_STATUS_EMPTY 	EHC_PIPELINE_STATUS_EMPTY_Msk
#define 	EHC_PIPELINE_STATUS_BUSY_Pos 	(0x1U)
#define 	EHC_PIPELINE_STATUS_BUSY_Msk 	(0x1UL << EHC_PIPELINE_STATUS_BUSY_Pos) 	/*!< 0x00000002 */
#define 	EHC_PIPELINE_STATUS_BUSY 	EHC_PIPELINE_STATUS_BUSY_Msk
#define 	EHC_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Pos 	(0x2U)
#define 	EHC_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Msk 	(0x1UL << EHC_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Pos) 	/*!< 0x00000004 */
#define 	EHC_PIPELINE_STATUS_DEEP_LOW_POWER_READY 	EHC_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Msk
#define EHC_EHC_CONTROL 	(0x00004040UL) 	/*<! EHC control register, EHC control register, this set parameters for EHC, for example choose between integration mode or event rate mode */
#define 	EHC_CONTROL_ALGO_SEL_Pos 	(0x0U)
#define 	EHC_CONTROL_ALGO_SEL_Msk 	(0x1UL << EHC_CONTROL_ALGO_SEL_Pos) 	/*!< 0x00000001 */
#define 	EHC_CONTROL_ALGO_SEL 	EHC_CONTROL_ALGO_SEL_Msk
#define 	EHC_CONTROL_TRIG_SEL_Pos 	(0x1U)
#define 	EHC_CONTROL_TRIG_SEL_Msk 	(0x1UL << EHC_CONTROL_TRIG_SEL_Pos) 	/*!< 0x00000002 */
#define 	EHC_CONTROL_TRIG_SEL 	EHC_CONTROL_TRIG_SEL_Msk
#define EHC_BITS_SPLITTING 	(0x00004044UL) 	/*<! This register configure bit splitting, This register will not be written(and will report an error on icn) if the sum of its two fields is not in the range: '0 < sum <= 8' */
#define 	EHC_BITS_SPLITTING_NEGATIVE_BIT_LENGTH_Pos 	(0x0U)
#define 	EHC_BITS_SPLITTING_NEGATIVE_BIT_LENGTH_Msk 	(0xFUL << EHC_BITS_SPLITTING_NEGATIVE_BIT_LENGTH_Pos) 	/*!< 0x0000000F */
#define 	EHC_BITS_SPLITTING_NEGATIVE_BIT_LENGTH 	EHC_BITS_SPLITTING_NEGATIVE_BIT_LENGTH_Msk
#define 	EHC_BITS_SPLITTING_POSITIVE_BIT_LENGTH_Pos 	(0x4U)
#define 	EHC_BITS_SPLITTING_POSITIVE_BIT_LENGTH_Msk 	(0xFUL << EHC_BITS_SPLITTING_POSITIVE_BIT_LENGTH_Pos) 	/*!< 0x000000F0 */
#define 	EHC_BITS_SPLITTING_POSITIVE_BIT_LENGTH 	EHC_BITS_SPLITTING_POSITIVE_BIT_LENGTH_Msk
#define 	EHC_BITS_SPLITTING_OUT_16BITS_PADDING_MODE_Pos 	(0x8U)
#define 	EHC_BITS_SPLITTING_OUT_16BITS_PADDING_MODE_Msk 	(0x1UL << EHC_BITS_SPLITTING_OUT_16BITS_PADDING_MODE_Pos) 	/*!< 0x00000100 */
#define 	EHC_BITS_SPLITTING_OUT_16BITS_PADDING_MODE 	EHC_BITS_SPLITTING_OUT_16BITS_PADDING_MODE_Msk
#define EHC_INTEGRATION_PERIOD 	(0x00004048UL) 	/*<! Register to configure integration period, this will then be compared to reconstructed time base precise to 16us, the 4 LSB of 'value_us' fields are not relevant. */
#define 	EHC_INTEGRATION_PERIOD_VALUE_US_Pos 	(0x4U)
#define 	EHC_INTEGRATION_PERIOD_VALUE_US_Msk 	(0x1FFFUL << EHC_INTEGRATION_PERIOD_VALUE_US_Pos) 	/*!< 0x0001FFF0 */
#define 	EHC_INTEGRATION_PERIOD_VALUE_US 	EHC_INTEGRATION_PERIOD_VALUE_US_Msk
#define EHC_EVENT_RATE_THRESHOLD 	(0x0000404CUL) 	/*<! Register to configure integration period, this will then be compared to reconstructed time base precise to 16us, the 4 LSB of 'value_us' fields are not relevant. */
#define 	EHC_EVENT_RATE_THRESHOLD_VALUE_Pos 	(0x0U)
#define 	EHC_EVENT_RATE_THRESHOLD_VALUE_Msk 	(0x1FFFFUL << EHC_EVENT_RATE_THRESHOLD_VALUE_Pos) 	/*!< 0x0001FFFF */
#define 	EHC_EVENT_RATE_THRESHOLD_VALUE 	EHC_EVENT_RATE_THRESHOLD_VALUE_Msk
#define EHC_INITIALISATION 	(0x00004100UL) 	/*<! Timestamping life time invalidation control register */
#define 	EHC_INITIALISATION_REQ_INIT_Pos 	(0x0U)
#define 	EHC_INITIALISATION_REQ_INIT_Msk 	(0x1UL << EHC_INITIALISATION_REQ_INIT_Pos) 	/*!< 0x00000001 */
#define 	EHC_INITIALISATION_REQ_INIT 	EHC_INITIALISATION_REQ_INIT_Msk
#define 	EHC_INITIALISATION_FLAG_INIT_BUSY_Pos 	(0x1U)
#define 	EHC_INITIALISATION_FLAG_INIT_BUSY_Msk 	(0x1UL << EHC_INITIALISATION_FLAG_INIT_BUSY_Pos) 	/*!< 0x00000002 */
#define 	EHC_INITIALISATION_FLAG_INIT_BUSY 	EHC_INITIALISATION_FLAG_INIT_BUSY_Msk
#define 	EHC_INITIALISATION_FLAG_INIT_DONE_Pos 	(0x2U)
#define 	EHC_INITIALISATION_FLAG_INIT_DONE_Msk 	(0x1UL << EHC_INITIALISATION_FLAG_INIT_DONE_Pos) 	/*!< 0x00000004 */
#define 	EHC_INITIALISATION_FLAG_INIT_DONE 	EHC_INITIALISATION_FLAG_INIT_DONE_Msk
#define EHC_ICN_SRAM_CONTROL 	(0x00004104UL) 	/*<! ICN SRAM Access: Request control register */
#define 	EHC_ICN_SRAM_CONTROL_REQ_TRIGGER_Pos 	(0x0U)
#define 	EHC_ICN_SRAM_CONTROL_REQ_TRIGGER_Msk 	(0x1UL << EHC_ICN_SRAM_CONTROL_REQ_TRIGGER_Pos) 	/*!< 0x00000001 */
#define 	EHC_ICN_SRAM_CONTROL_REQ_TRIGGER 	EHC_ICN_SRAM_CONTROL_REQ_TRIGGER_Msk
#define 	EHC_ICN_SRAM_CONTROL_REQ_TYPE_Pos 	(0x1U)
#define 	EHC_ICN_SRAM_CONTROL_REQ_TYPE_Msk 	(0x1UL << EHC_ICN_SRAM_CONTROL_REQ_TYPE_Pos) 	/*!< 0x00000002 */
#define 	EHC_ICN_SRAM_CONTROL_REQ_TYPE 	EHC_ICN_SRAM_CONTROL_REQ_TYPE_Msk
#define 	EHC_ICN_SRAM_CONTROL_DATA_SEL_Pos 	(0x2U)
#define 	EHC_ICN_SRAM_CONTROL_DATA_SEL_Msk 	(0x3UL << EHC_ICN_SRAM_CONTROL_DATA_SEL_Pos) 	/*!< 0x0000000C */
#define 	EHC_ICN_SRAM_CONTROL_DATA_SEL 	EHC_ICN_SRAM_CONTROL_DATA_SEL_Msk
#define EHC_ICN_SRAM_ADDRESS 	(0x00004108UL) 	/*<! ICN SRAM Access: Address register */
#define 	EHC_ICN_SRAM_ADDRESS_X_ADDR_Pos 	(0x0U)
#define 	EHC_ICN_SRAM_ADDRESS_X_ADDR_Msk 	(0x7FFUL << EHC_ICN_SRAM_ADDRESS_X_ADDR_Pos) 	/*!< 0x000007FF */
#define 	EHC_ICN_SRAM_ADDRESS_X_ADDR 	EHC_ICN_SRAM_ADDRESS_X_ADDR_Msk
#define 	EHC_ICN_SRAM_ADDRESS_Y_ADDR_Pos 	(0x10U)
#define 	EHC_ICN_SRAM_ADDRESS_Y_ADDR_Msk 	(0x7FFUL << EHC_ICN_SRAM_ADDRESS_Y_ADDR_Pos) 	/*!< 0x07FF0000 */
#define 	EHC_ICN_SRAM_ADDRESS_Y_ADDR 	EHC_ICN_SRAM_ADDRESS_Y_ADDR_Msk
#define EHC_ICN_SRAM_DATA 	(0x0000410CUL) 	/*<! ICN SRAM Access: Read/Write Data */
#define 	EHC_ICN_SRAM_DATA_VAL_Pos 	(0x0U)
#define 	EHC_ICN_SRAM_DATA_VAL_Msk 	(0xFFFFFFFFUL << EHC_ICN_SRAM_DATA_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	EHC_ICN_SRAM_DATA_VAL 	EHC_ICN_SRAM_DATA_VAL_Msk
#define EHC_FLAGS 	(0x00004110UL) 	/*<! Flags */
#define 	EHC_FLAGS_ERR_DRAINING_RETRIG_Pos 	(0x0U)
#define 	EHC_FLAGS_ERR_DRAINING_RETRIG_Msk 	(0x1UL << EHC_FLAGS_ERR_DRAINING_RETRIG_Pos) 	/*!< 0x00000001 */
#define 	EHC_FLAGS_ERR_DRAINING_RETRIG 	EHC_FLAGS_ERR_DRAINING_RETRIG_Msk
#define 	EHC_FLAGS_ERR_WRONG_CONFIG_Pos 	(0x1U)
#define 	EHC_FLAGS_ERR_WRONG_CONFIG_Msk 	(0x1UL << EHC_FLAGS_ERR_WRONG_CONFIG_Pos) 	/*!< 0x00000002 */
#define 	EHC_FLAGS_ERR_WRONG_CONFIG 	EHC_FLAGS_ERR_WRONG_CONFIG_Msk
#define 	EHC_FLAGS_FCT_WAKE_UP_Pos 	(0x2U)
#define 	EHC_FLAGS_FCT_WAKE_UP_Msk 	(0x1UL << EHC_FLAGS_FCT_WAKE_UP_Pos) 	/*!< 0x00000004 */
#define 	EHC_FLAGS_FCT_WAKE_UP 	EHC_FLAGS_FCT_WAKE_UP_Msk
#define EHC_IRQ_CONTROL 	(0x00004114UL) 	/*<! Interrupt control register, If any of those source enabled this enable the associated interrupt source line, and configure hold time for GPIO routing (Function, nor Error line) (default: all 0) */
#define 	EHC_IRQ_CONTROL_ERR_DRAINING_RETRIG_SEL_Pos 	(0x0U)
#define 	EHC_IRQ_CONTROL_ERR_DRAINING_RETRIG_SEL_Msk 	(0x1UL << EHC_IRQ_CONTROL_ERR_DRAINING_RETRIG_SEL_Pos) 	/*!< 0x00000001 */
#define 	EHC_IRQ_CONTROL_ERR_DRAINING_RETRIG_SEL 	EHC_IRQ_CONTROL_ERR_DRAINING_RETRIG_SEL_Msk
#define 	EHC_IRQ_CONTROL_ERR_WRONG_CONFIG_SEL_Pos 	(0x1U)
#define 	EHC_IRQ_CONTROL_ERR_WRONG_CONFIG_SEL_Msk 	(0x1UL << EHC_IRQ_CONTROL_ERR_WRONG_CONFIG_SEL_Pos) 	/*!< 0x00000002 */
#define 	EHC_IRQ_CONTROL_ERR_WRONG_CONFIG_SEL 	EHC_IRQ_CONTROL_ERR_WRONG_CONFIG_SEL_Msk
#define 	EHC_IRQ_CONTROL_FCT_WAKE_UP_SEL_Pos 	(0x2U)
#define 	EHC_IRQ_CONTROL_FCT_WAKE_UP_SEL_Msk 	(0x1UL << EHC_IRQ_CONTROL_FCT_WAKE_UP_SEL_Pos) 	/*!< 0x00000004 */
#define 	EHC_IRQ_CONTROL_FCT_WAKE_UP_SEL 	EHC_IRQ_CONTROL_FCT_WAKE_UP_SEL_Msk
#define 	EHC_IRQ_CONTROL_HOLD_CYCLE_NUM_Pos 	(0x10U)
#define 	EHC_IRQ_CONTROL_HOLD_CYCLE_NUM_Msk 	(0x3FFUL << EHC_IRQ_CONTROL_HOLD_CYCLE_NUM_Pos) 	/*!< 0x03FF0000 */
#define 	EHC_IRQ_CONTROL_HOLD_CYCLE_NUM 	EHC_IRQ_CONTROL_HOLD_CYCLE_NUM_Msk
#define EHC_WAKE_UP_PERIOD 	(0x00004118UL) 	/*<! Register to configure wake_up period, this will be first substracted to integration_period and then will then be compared to reconstructed time base precise to 16us, the 4 LSB of 'value_us' fields are not relevant. */
#define 	EHC_WAKE_UP_PERIOD_VALUE_US_Pos 	(0x4U)
#define 	EHC_WAKE_UP_PERIOD_VALUE_US_Msk 	(0xFFFUL << EHC_WAKE_UP_PERIOD_VALUE_US_Pos) 	/*!< 0x0000FFF0 */
#define 	EHC_WAKE_UP_PERIOD_VALUE_US 	EHC_WAKE_UP_PERIOD_VALUE_US_Msk
#define EHC_CHICKEN0_BITS 	(0x000041C0UL) 	/*<! Private register 0. It helps unrisking the design by adding deep control bits */
#define 	EHC_CHICKEN0_BITS_DRAIN_BLOCKING_MODE_Pos 	(0x0U)
#define 	EHC_CHICKEN0_BITS_DRAIN_BLOCKING_MODE_Msk 	(0x1UL << EHC_CHICKEN0_BITS_DRAIN_BLOCKING_MODE_Pos) 	/*!< 0x00000001 */
#define 	EHC_CHICKEN0_BITS_DRAIN_BLOCKING_MODE 	EHC_CHICKEN0_BITS_DRAIN_BLOCKING_MODE_Msk
#define 	EHC_CHICKEN0_BITS_DRAIN_TRASHING_MODE_Pos 	(0x1U)
#define 	EHC_CHICKEN0_BITS_DRAIN_TRASHING_MODE_Msk 	(0x1UL << EHC_CHICKEN0_BITS_DRAIN_TRASHING_MODE_Pos) 	/*!< 0x00000002 */
#define 	EHC_CHICKEN0_BITS_DRAIN_TRASHING_MODE 	EHC_CHICKEN0_BITS_DRAIN_TRASHING_MODE_Msk
#define 	EHC_CHICKEN0_BITS_DIFF3D_SAT_Pos 	(0x2U)
#define 	EHC_CHICKEN0_BITS_DIFF3D_SAT_Msk 	(0x1UL << EHC_CHICKEN0_BITS_DIFF3D_SAT_Pos) 	/*!< 0x00000004 */
#define 	EHC_CHICKEN0_BITS_DIFF3D_SAT 	EHC_CHICKEN0_BITS_DIFF3D_SAT_Msk
#define 	EHC_CHICKEN0_BITS_TIMEBASE_REC_TD_TH_ONLY_Pos 	(0x3U)
#define 	EHC_CHICKEN0_BITS_TIMEBASE_REC_TD_TH_ONLY_Msk 	(0x1UL << EHC_CHICKEN0_BITS_TIMEBASE_REC_TD_TH_ONLY_Pos) 	/*!< 0x00000008 */
#define 	EHC_CHICKEN0_BITS_TIMEBASE_REC_TD_TH_ONLY 	EHC_CHICKEN0_BITS_TIMEBASE_REC_TD_TH_ONLY_Msk
#define 	EHC_CHICKEN0_BITS_FORCE_DRAIN_REQ_Pos 	(0x4U)
#define 	EHC_CHICKEN0_BITS_FORCE_DRAIN_REQ_Msk 	(0x1UL << EHC_CHICKEN0_BITS_FORCE_DRAIN_REQ_Pos) 	/*!< 0x00000010 */
#define 	EHC_CHICKEN0_BITS_FORCE_DRAIN_REQ 	EHC_CHICKEN0_BITS_FORCE_DRAIN_REQ_Msk

