jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * ERC:  multi-line comment 
 * ------------------------------------------------------ */

#define ERC_PIPELINE_CONTROL 	(0x00006000UL) 	/*<! Block Control register */
#define 	ERC_PIPELINE_CONTROL_ENABLE_Pos 	(0x0U)
#define 	ERC_PIPELINE_CONTROL_ENABLE_Msk 	(0x1UL << ERC_PIPELINE_CONTROL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	ERC_PIPELINE_CONTROL_ENABLE 	ERC_PIPELINE_CONTROL_ENABLE_Msk
#define 	ERC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos 	(0x1U)
#define 	ERC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk 	(0x1UL << ERC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos) 	/*!< 0x00000002 */
#define 	ERC_PIPELINE_CONTROL_DROP_NBACKPRESSURE 	ERC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk
#define 	ERC_PIPELINE_CONTROL_BYPASS_Pos 	(0x2U)
#define 	ERC_PIPELINE_CONTROL_BYPASS_Msk 	(0x1UL << ERC_PIPELINE_CONTROL_BYPASS_Pos) 	/*!< 0x00000004 */
#define 	ERC_PIPELINE_CONTROL_BYPASS 	ERC_PIPELINE_CONTROL_BYPASS_Msk
#define ERC_PIPELINE_STATUS 	(0x00006004UL) 	/*<! Block Status Register: This register give information about the internal status of the block. */
#define 	ERC_PIPELINE_STATUS_EMPTY_Pos 	(0x0U)
#define 	ERC_PIPELINE_STATUS_EMPTY_Msk 	(0x1UL << ERC_PIPELINE_STATUS_EMPTY_Pos) 	/*!< 0x00000001 */
#define 	ERC_PIPELINE_STATUS_EMPTY 	ERC_PIPELINE_STATUS_EMPTY_Msk
#define 	ERC_PIPELINE_STATUS_BUSY_Pos 	(0x1U)
#define 	ERC_PIPELINE_STATUS_BUSY_Msk 	(0x1UL << ERC_PIPELINE_STATUS_BUSY_Pos) 	/*!< 0x00000002 */
#define 	ERC_PIPELINE_STATUS_BUSY 	ERC_PIPELINE_STATUS_BUSY_Msk
#define 	ERC_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Pos 	(0x2U)
#define 	ERC_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ERC_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00000004 */
#define 	ERC_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN 	ERC_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Msk
#define ERC_PIPELINE_FLUSH 	(0x00006010UL) 	/*<! Flush the pipeline. While status is 0, flush is in progress. When status is '1', all flushes are done (clear status when it is 0 has no effect). */
#define 	ERC_PIPELINE_FLUSH_IN_PROGRESS_Pos 	(0x0U)
#define 	ERC_PIPELINE_FLUSH_IN_PROGRESS_Msk 	(0x3UL << ERC_PIPELINE_FLUSH_IN_PROGRESS_Pos) 	/*!< 0x00000003 */
#define 	ERC_PIPELINE_FLUSH_IN_PROGRESS 	ERC_PIPELINE_FLUSH_IN_PROGRESS_Msk
#define 	ERC_PIPELINE_FLUSH_CMD_EN_Pos 	(0x1EU)
#define 	ERC_PIPELINE_FLUSH_CMD_EN_Msk 	(0x1UL << ERC_PIPELINE_FLUSH_CMD_EN_Pos) 	/*!< 0x40000000 */
#define 	ERC_PIPELINE_FLUSH_CMD_EN 	ERC_PIPELINE_FLUSH_CMD_EN_Msk
#define 	ERC_PIPELINE_FLUSH_STATUS_Pos 	(0x1FU)
#define 	ERC_PIPELINE_FLUSH_STATUS_Msk 	(0x1UL << ERC_PIPELINE_FLUSH_STATUS_Pos) 	/*!< 0x80000000 */
#define 	ERC_PIPELINE_FLUSH_STATUS 	ERC_PIPELINE_FLUSH_STATUS_Msk
#define ERC_AHVT_DROPPING_CONTROL 	(0x00006014UL) 	/*<! (dp) Configuration for drop all, horizontal, vertical and temporal dropping. */
#define 	ERC_AHVT_DROPPING_CONTROL_H_EN_Pos 	(0x0U)
#define 	ERC_AHVT_DROPPING_CONTROL_H_EN_Msk 	(0x1UL << ERC_AHVT_DROPPING_CONTROL_H_EN_Pos) 	/*!< 0x00000001 */
#define 	ERC_AHVT_DROPPING_CONTROL_H_EN 	ERC_AHVT_DROPPING_CONTROL_H_EN_Msk
#define 	ERC_AHVT_DROPPING_CONTROL_V_EN_Pos 	(0x1U)
#define 	ERC_AHVT_DROPPING_CONTROL_V_EN_Msk 	(0x1UL << ERC_AHVT_DROPPING_CONTROL_V_EN_Pos) 	/*!< 0x00000002 */
#define 	ERC_AHVT_DROPPING_CONTROL_V_EN 	ERC_AHVT_DROPPING_CONTROL_V_EN_Msk
#define 	ERC_AHVT_DROPPING_CONTROL_T_EN_Pos 	(0x2U)
#define 	ERC_AHVT_DROPPING_CONTROL_T_EN_Msk 	(0x1UL << ERC_AHVT_DROPPING_CONTROL_T_EN_Pos) 	/*!< 0x00000004 */
#define 	ERC_AHVT_DROPPING_CONTROL_T_EN 	ERC_AHVT_DROPPING_CONTROL_T_EN_Msk
#define 	ERC_AHVT_DROPPING_CONTROL_T_LUT_EN_Pos 	(0x3U)
#define 	ERC_AHVT_DROPPING_CONTROL_T_LUT_EN_Msk 	(0x1UL << ERC_AHVT_DROPPING_CONTROL_T_LUT_EN_Pos) 	/*!< 0x00000008 */
#define 	ERC_AHVT_DROPPING_CONTROL_T_LUT_EN 	ERC_AHVT_DROPPING_CONTROL_T_LUT_EN_Msk
#define 	ERC_AHVT_DROPPING_CONTROL_DROP_ALL_TD_WHEN_GEQ_Pos 	(0x4U)
#define 	ERC_AHVT_DROPPING_CONTROL_DROP_ALL_TD_WHEN_GEQ_Msk 	(0x3FFUL << ERC_AHVT_DROPPING_CONTROL_DROP_ALL_TD_WHEN_GEQ_Pos) 	/*!< 0x00003FF0 */
#define 	ERC_AHVT_DROPPING_CONTROL_DROP_ALL_TD_WHEN_GEQ 	ERC_AHVT_DROPPING_CONTROL_DROP_ALL_TD_WHEN_GEQ_Msk
#define 	ERC_AHVT_DROPPING_CONTROL_STATUS_Pos 	(0x1FU)
#define 	ERC_AHVT_DROPPING_CONTROL_STATUS_Msk 	(0x1UL << ERC_AHVT_DROPPING_CONTROL_STATUS_Pos) 	/*!< 0x80000000 */
#define 	ERC_AHVT_DROPPING_CONTROL_STATUS 	ERC_AHVT_DROPPING_CONTROL_STATUS_Msk
#define ERC_REF_PERIOD_FLAVOR 	(0x00006020UL) 	/*<! Reference period and delay fifo enable. */
#define 	ERC_REF_PERIOD_FLAVOR_REFERENCE_Pos 	(0x0U)
#define 	ERC_REF_PERIOD_FLAVOR_REFERENCE_Msk 	(0x3FFUL << ERC_REF_PERIOD_FLAVOR_REFERENCE_Pos) 	/*!< 0x000003FF */
#define 	ERC_REF_PERIOD_FLAVOR_REFERENCE 	ERC_REF_PERIOD_FLAVOR_REFERENCE_Msk
#define 	ERC_REF_PERIOD_FLAVOR_AVG_DROP_RATE_DELAYED_Pos 	(0x10U)
#define 	ERC_REF_PERIOD_FLAVOR_AVG_DROP_RATE_DELAYED_Msk 	(0x1UL << ERC_REF_PERIOD_FLAVOR_AVG_DROP_RATE_DELAYED_Pos) 	/*!< 0x00010000 */
#define 	ERC_REF_PERIOD_FLAVOR_AVG_DROP_RATE_DELAYED 	ERC_REF_PERIOD_FLAVOR_AVG_DROP_RATE_DELAYED_Msk
#define ERC_DELAY_FIFO_NON_TD_RSVD_AREA 	(0x00006024UL) 	/*<! (dip) Area in the delay fifo reserved for non TD vectors belonging to the same event period. When written value is greater than fifo size (5128), value is forced to fifo sized, i.e. no area is available for TD. Default value is 1026 (up to 20288 TD vectors can be stored if there is no more than 1026 non TD vectors). */
#define 	ERC_DELAY_FIFO_NON_TD_RSVD_AREA_VAL_Pos 	(0x0U)
#define 	ERC_DELAY_FIFO_NON_TD_RSVD_AREA_VAL_Msk 	(0x1FFFUL << ERC_DELAY_FIFO_NON_TD_RSVD_AREA_VAL_Pos) 	/*!< 0x00001FFF */
#define 	ERC_DELAY_FIFO_NON_TD_RSVD_AREA_VAL 	ERC_DELAY_FIFO_NON_TD_RSVD_AREA_VAL_Msk
#define 	ERC_DELAY_FIFO_NON_TD_RSVD_AREA_AUTO_RAISE_Pos 	(0x10U)
#define 	ERC_DELAY_FIFO_NON_TD_RSVD_AREA_AUTO_RAISE_Msk 	(0x1UL << ERC_DELAY_FIFO_NON_TD_RSVD_AREA_AUTO_RAISE_Pos) 	/*!< 0x00010000 */
#define 	ERC_DELAY_FIFO_NON_TD_RSVD_AREA_AUTO_RAISE 	ERC_DELAY_FIFO_NON_TD_RSVD_AREA_AUTO_RAISE_Msk
#define ERC_DELAY_FIFO_SIZE 	(0x00006028UL) 	/*<! Maximum number of events that can fit in the delay fifo. */
#define 	ERC_DELAY_FIFO_SIZE_VAL_Pos 	(0x0U)
#define 	ERC_DELAY_FIFO_SIZE_VAL_Msk 	(0x7FFFUL << ERC_DELAY_FIFO_SIZE_VAL_Pos) 	/*!< 0x00007FFF */
#define 	ERC_DELAY_FIFO_SIZE_VAL 	ERC_DELAY_FIFO_SIZE_VAL_Msk
#define ERC_TD_TARGET_EVENT_COUNT 	(0x0000602CUL) 	/*<! (dp) Maximum number of events to be outputted during one event period. Max value is 1023 * 50 * 32 = 0x18F9C0 */
#define 	ERC_TD_TARGET_EVENT_COUNT_VAL_Pos 	(0x0U)
#define 	ERC_TD_TARGET_EVENT_COUNT_VAL_Msk 	(0x1FFFFFUL << ERC_TD_TARGET_EVENT_COUNT_VAL_Pos) 	/*!< 0x001FFFFF */
#define 	ERC_TD_TARGET_EVENT_COUNT_VAL 	ERC_TD_TARGET_EVENT_COUNT_VAL_Msk
#define ERC_INTEREST_LEVEL 	(0x00006030UL) 	/*<! (dp) Warning: this register should not be written while status is '0'. The whole interest level behavior is configured with this register. */
#define 	ERC_INTEREST_LEVEL_SELECT_PONG_INTLVL_GRID_Pos 	(0x0U)
#define 	ERC_INTEREST_LEVEL_SELECT_PONG_INTLVL_GRID_Msk 	(0x1UL << ERC_INTEREST_LEVEL_SELECT_PONG_INTLVL_GRID_Pos) 	/*!< 0x00000001 */
#define 	ERC_INTEREST_LEVEL_SELECT_PONG_INTLVL_GRID 	ERC_INTEREST_LEVEL_SELECT_PONG_INTLVL_GRID_Msk
#define 	ERC_INTEREST_LEVEL_USE_INTLVL_GRID_Pos 	(0x1U)
#define 	ERC_INTEREST_LEVEL_USE_INTLVL_GRID_Msk 	(0x1UL << ERC_INTEREST_LEVEL_USE_INTLVL_GRID_Pos) 	/*!< 0x00000002 */
#define 	ERC_INTEREST_LEVEL_USE_INTLVL_GRID 	ERC_INTEREST_LEVEL_USE_INTLVL_GRID_Msk
#define 	ERC_INTEREST_LEVEL_WEAK_THRESHOLD_Pos 	(0x2U)
#define 	ERC_INTEREST_LEVEL_WEAK_THRESHOLD_Msk 	(0xFUL << ERC_INTEREST_LEVEL_WEAK_THRESHOLD_Pos) 	/*!< 0x0000003C */
#define 	ERC_INTEREST_LEVEL_WEAK_THRESHOLD 	ERC_INTEREST_LEVEL_WEAK_THRESHOLD_Msk
#define 	ERC_INTEREST_LEVEL_STATUS_Pos 	(0x1FU)
#define 	ERC_INTEREST_LEVEL_STATUS_Msk 	(0x1UL << ERC_INTEREST_LEVEL_STATUS_Pos) 	/*!< 0x80000000 */
#define 	ERC_INTEREST_LEVEL_STATUS 	ERC_INTEREST_LEVEL_STATUS_Msk
#define ERC_MONITORING_EVENT_CONTROL 	(0x00006034UL) 	/*<! Control of monitoring events generated by the ERC. When enable, monitoring events added to event flow are sent downstream, else monitoring events are removed defore ERC output (in OFS). */
#define 	ERC_MONITORING_EVENT_CONTROL_FIRST_MODULE_TAG_EN_Pos 	(0x0U)
#define 	ERC_MONITORING_EVENT_CONTROL_FIRST_MODULE_TAG_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_FIRST_MODULE_TAG_EN_Pos) 	/*!< 0x00000001 */
#define 	ERC_MONITORING_EVENT_CONTROL_FIRST_MODULE_TAG_EN 	ERC_MONITORING_EVENT_CONTROL_FIRST_MODULE_TAG_EN_Msk
#define 	ERC_MONITORING_EVENT_CONTROL_AVG_DROP_RATE_EN_Pos 	(0x1U)
#define 	ERC_MONITORING_EVENT_CONTROL_AVG_DROP_RATE_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_AVG_DROP_RATE_EN_Pos) 	/*!< 0x00000002 */
#define 	ERC_MONITORING_EVENT_CONTROL_AVG_DROP_RATE_EN 	ERC_MONITORING_EVENT_CONTROL_AVG_DROP_RATE_EN_Msk
#define 	ERC_MONITORING_EVENT_CONTROL_IN_TD_CNT_EN_Pos 	(0x2U)
#define 	ERC_MONITORING_EVENT_CONTROL_IN_TD_CNT_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_IN_TD_CNT_EN_Pos) 	/*!< 0x00000004 */
#define 	ERC_MONITORING_EVENT_CONTROL_IN_TD_CNT_EN 	ERC_MONITORING_EVENT_CONTROL_IN_TD_CNT_EN_Msk
#define 	ERC_MONITORING_EVENT_CONTROL_DF_TD_VECT_DROP_CNT_EN_Pos 	(0x3U)
#define 	ERC_MONITORING_EVENT_CONTROL_DF_TD_VECT_DROP_CNT_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_DF_TD_VECT_DROP_CNT_EN_Pos) 	/*!< 0x00000008 */
#define 	ERC_MONITORING_EVENT_CONTROL_DF_TD_VECT_DROP_CNT_EN 	ERC_MONITORING_EVENT_CONTROL_DF_TD_VECT_DROP_CNT_EN_Msk
#define 	ERC_MONITORING_EVENT_CONTROL_DF_NON_TD_VECT_DROP_CNT_EN_Pos 	(0x4U)
#define 	ERC_MONITORING_EVENT_CONTROL_DF_NON_TD_VECT_DROP_CNT_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_DF_NON_TD_VECT_DROP_CNT_EN_Pos) 	/*!< 0x00000010 */
#define 	ERC_MONITORING_EVENT_CONTROL_DF_NON_TD_VECT_DROP_CNT_EN 	ERC_MONITORING_EVENT_CONTROL_DF_NON_TD_VECT_DROP_CNT_EN_Msk
#define 	ERC_MONITORING_EVENT_CONTROL_ALLDR_EVT_DROP_CNT_EN_Pos 	(0x5U)
#define 	ERC_MONITORING_EVENT_CONTROL_ALLDR_EVT_DROP_CNT_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_ALLDR_EVT_DROP_CNT_EN_Pos) 	/*!< 0x00000020 */
#define 	ERC_MONITORING_EVENT_CONTROL_ALLDR_EVT_DROP_CNT_EN 	ERC_MONITORING_EVENT_CONTROL_ALLDR_EVT_DROP_CNT_EN_Msk
#define 	ERC_MONITORING_EVENT_CONTROL_HDR_EVT_DROP_CNT_EN_Pos 	(0x6U)
#define 	ERC_MONITORING_EVENT_CONTROL_HDR_EVT_DROP_CNT_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_HDR_EVT_DROP_CNT_EN_Pos) 	/*!< 0x00000040 */
#define 	ERC_MONITORING_EVENT_CONTROL_HDR_EVT_DROP_CNT_EN 	ERC_MONITORING_EVENT_CONTROL_HDR_EVT_DROP_CNT_EN_Msk
#define 	ERC_MONITORING_EVENT_CONTROL_VDR_EVT_DROP_CNT_EN_Pos 	(0x7U)
#define 	ERC_MONITORING_EVENT_CONTROL_VDR_EVT_DROP_CNT_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_VDR_EVT_DROP_CNT_EN_Pos) 	/*!< 0x00000080 */
#define 	ERC_MONITORING_EVENT_CONTROL_VDR_EVT_DROP_CNT_EN 	ERC_MONITORING_EVENT_CONTROL_VDR_EVT_DROP_CNT_EN_Msk
#define 	ERC_MONITORING_EVENT_CONTROL_TDR_EVT_DROP_CNT_EN_Pos 	(0x8U)
#define 	ERC_MONITORING_EVENT_CONTROL_TDR_EVT_DROP_CNT_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_TDR_EVT_DROP_CNT_EN_Pos) 	/*!< 0x00000100 */
#define 	ERC_MONITORING_EVENT_CONTROL_TDR_EVT_DROP_CNT_EN 	ERC_MONITORING_EVENT_CONTROL_TDR_EVT_DROP_CNT_EN_Msk
#define 	ERC_MONITORING_EVENT_CONTROL_TD_EVT_CNT_EN_Pos 	(0x9U)
#define 	ERC_MONITORING_EVENT_CONTROL_TD_EVT_CNT_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_TD_EVT_CNT_EN_Pos) 	/*!< 0x00000200 */
#define 	ERC_MONITORING_EVENT_CONTROL_TD_EVT_CNT_EN 	ERC_MONITORING_EVENT_CONTROL_TD_EVT_CNT_EN_Msk
#define 	ERC_MONITORING_EVENT_CONTROL_LAST_MODULE_TAG_EN_Pos 	(0xAU)
#define 	ERC_MONITORING_EVENT_CONTROL_LAST_MODULE_TAG_EN_Msk 	(0x1UL << ERC_MONITORING_EVENT_CONTROL_LAST_MODULE_TAG_EN_Pos) 	/*!< 0x00000400 */
#define 	ERC_MONITORING_EVENT_CONTROL_LAST_MODULE_TAG_EN 	ERC_MONITORING_EVENT_CONTROL_LAST_MODULE_TAG_EN_Msk
#define ERC_IRQ_PENDING 	(0x00006038UL) 	/*<! This register shows which irq have been raised since they was cleared. Irq status bits value are 1 if the correspondig interrupt has triggered, whatever the irq_mask bits values are. On write access, a bit set to 1 clears the corresponding irq while a bit set to 0 has no effect. */
#define 	ERC_IRQ_PENDING_ICN_CFG_ERROR_Pos 	(0x0U)
#define 	ERC_IRQ_PENDING_ICN_CFG_ERROR_Msk 	(0x1UL << ERC_IRQ_PENDING_ICN_CFG_ERROR_Pos) 	/*!< 0x00000001 */
#define 	ERC_IRQ_PENDING_ICN_CFG_ERROR 	ERC_IRQ_PENDING_ICN_CFG_ERROR_Msk
#define 	ERC_IRQ_PENDING_ICN_HDR_ERROR_Pos 	(0x1U)
#define 	ERC_IRQ_PENDING_ICN_HDR_ERROR_Msk 	(0x1UL << ERC_IRQ_PENDING_ICN_HDR_ERROR_Pos) 	/*!< 0x00000002 */
#define 	ERC_IRQ_PENDING_ICN_HDR_ERROR 	ERC_IRQ_PENDING_ICN_HDR_ERROR_Msk
#define 	ERC_IRQ_PENDING_ICN_VDR_ERROR_Pos 	(0x2U)
#define 	ERC_IRQ_PENDING_ICN_VDR_ERROR_Msk 	(0x1UL << ERC_IRQ_PENDING_ICN_VDR_ERROR_Pos) 	/*!< 0x00000004 */
#define 	ERC_IRQ_PENDING_ICN_VDR_ERROR 	ERC_IRQ_PENDING_ICN_VDR_ERROR_Msk
#define 	ERC_IRQ_PENDING_ICN_TDR_ERROR_Pos 	(0x3U)
#define 	ERC_IRQ_PENDING_ICN_TDR_ERROR_Msk 	(0x1UL << ERC_IRQ_PENDING_ICN_TDR_ERROR_Pos) 	/*!< 0x00000008 */
#define 	ERC_IRQ_PENDING_ICN_TDR_ERROR 	ERC_IRQ_PENDING_ICN_TDR_ERROR_Msk
#define 	ERC_IRQ_PENDING_ICN_ILG_ERROR_Pos 	(0x4U)
#define 	ERC_IRQ_PENDING_ICN_ILG_ERROR_Msk 	(0x1UL << ERC_IRQ_PENDING_ICN_ILG_ERROR_Pos) 	/*!< 0x00000010 */
#define 	ERC_IRQ_PENDING_ICN_ILG_ERROR 	ERC_IRQ_PENDING_ICN_ILG_ERROR_Msk
#define 	ERC_IRQ_PENDING_DF_NON_TD_DROP_Pos 	(0x5U)
#define 	ERC_IRQ_PENDING_DF_NON_TD_DROP_Msk 	(0x1UL << ERC_IRQ_PENDING_DF_NON_TD_DROP_Pos) 	/*!< 0x00000020 */
#define 	ERC_IRQ_PENDING_DF_NON_TD_DROP 	ERC_IRQ_PENDING_DF_NON_TD_DROP_Msk
#define 	ERC_IRQ_PENDING_DF_TD_DROP_Pos 	(0x6U)
#define 	ERC_IRQ_PENDING_DF_TD_DROP_Msk 	(0x1UL << ERC_IRQ_PENDING_DF_TD_DROP_Pos) 	/*!< 0x00000040 */
#define 	ERC_IRQ_PENDING_DF_TD_DROP 	ERC_IRQ_PENDING_DF_TD_DROP_Msk
#define 	ERC_IRQ_PENDING_INTEREST_LEVEL_CMD_DONE_Pos 	(0x7U)
#define 	ERC_IRQ_PENDING_INTEREST_LEVEL_CMD_DONE_Msk 	(0x1UL << ERC_IRQ_PENDING_INTEREST_LEVEL_CMD_DONE_Pos) 	/*!< 0x00000080 */
#define 	ERC_IRQ_PENDING_INTEREST_LEVEL_CMD_DONE 	ERC_IRQ_PENDING_INTEREST_LEVEL_CMD_DONE_Msk
#define 	ERC_IRQ_PENDING_STAT_SNAP_UPDATE_Pos 	(0x8U)
#define 	ERC_IRQ_PENDING_STAT_SNAP_UPDATE_Msk 	(0x1UL << ERC_IRQ_PENDING_STAT_SNAP_UPDATE_Pos) 	/*!< 0x00000100 */
#define 	ERC_IRQ_PENDING_STAT_SNAP_UPDATE 	ERC_IRQ_PENDING_STAT_SNAP_UPDATE_Msk
#define 	ERC_IRQ_PENDING_USER_PIPE_FLUSH_DONE_Pos 	(0x9U)
#define 	ERC_IRQ_PENDING_USER_PIPE_FLUSH_DONE_Msk 	(0x1UL << ERC_IRQ_PENDING_USER_PIPE_FLUSH_DONE_Pos) 	/*!< 0x00000200 */
#define 	ERC_IRQ_PENDING_USER_PIPE_FLUSH_DONE 	ERC_IRQ_PENDING_USER_PIPE_FLUSH_DONE_Msk
#define 	ERC_IRQ_PENDING_AHVT_DROPPING_CMD_DONE_Pos 	(0xAU)
#define 	ERC_IRQ_PENDING_AHVT_DROPPING_CMD_DONE_Msk 	(0x1UL << ERC_IRQ_PENDING_AHVT_DROPPING_CMD_DONE_Pos) 	/*!< 0x00000400 */
#define 	ERC_IRQ_PENDING_AHVT_DROPPING_CMD_DONE 	ERC_IRQ_PENDING_AHVT_DROPPING_CMD_DONE_Msk
#define 	ERC_IRQ_PENDING_DEEP_LOW_POWER_SEEN_Pos 	(0xBU)
#define 	ERC_IRQ_PENDING_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ERC_IRQ_PENDING_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00000800 */
#define 	ERC_IRQ_PENDING_DEEP_LOW_POWER_SEEN 	ERC_IRQ_PENDING_DEEP_LOW_POWER_SEEN_Msk
#define 	ERC_IRQ_PENDING_SRAM_POWER_UP_DOWN_DONE_Pos 	(0x1CU)
#define 	ERC_IRQ_PENDING_SRAM_POWER_UP_DOWN_DONE_Msk 	(0x1UL << ERC_IRQ_PENDING_SRAM_POWER_UP_DOWN_DONE_Pos) 	/*!< 0x10000000 */
#define 	ERC_IRQ_PENDING_SRAM_POWER_UP_DOWN_DONE 	ERC_IRQ_PENDING_SRAM_POWER_UP_DOWN_DONE_Msk
#define 	ERC_IRQ_PENDING_FIRST_TIME_HIGH_ERROR_Pos 	(0x1DU)
#define 	ERC_IRQ_PENDING_FIRST_TIME_HIGH_ERROR_Msk 	(0x1UL << ERC_IRQ_PENDING_FIRST_TIME_HIGH_ERROR_Pos) 	/*!< 0x20000000 */
#define 	ERC_IRQ_PENDING_FIRST_TIME_HIGH_ERROR 	ERC_IRQ_PENDING_FIRST_TIME_HIGH_ERROR_Msk
#define 	ERC_IRQ_PENDING_EXIT_DEEP_LOW_POWER_ERROR_Pos 	(0x1EU)
#define 	ERC_IRQ_PENDING_EXIT_DEEP_LOW_POWER_ERROR_Msk 	(0x1UL << ERC_IRQ_PENDING_EXIT_DEEP_LOW_POWER_ERROR_Pos) 	/*!< 0x40000000 */
#define 	ERC_IRQ_PENDING_EXIT_DEEP_LOW_POWER_ERROR 	ERC_IRQ_PENDING_EXIT_DEEP_LOW_POWER_ERROR_Msk
#define 	ERC_IRQ_PENDING_DF_SRAM_BYPASS_DONE_Pos 	(0x1FU)
#define 	ERC_IRQ_PENDING_DF_SRAM_BYPASS_DONE_Msk 	(0x1UL << ERC_IRQ_PENDING_DF_SRAM_BYPASS_DONE_Pos) 	/*!< 0x80000000 */
#define 	ERC_IRQ_PENDING_DF_SRAM_BYPASS_DONE 	ERC_IRQ_PENDING_DF_SRAM_BYPASS_DONE_Msk
#define ERC_IRQ_STATUS 	(0x0000603CUL) 	/*<! This register shows which irq have been raised since they was cleared. Irq status bits value are 1 if the associated interrupt had raised. During write, any bit set to 1 will clear the corresponding irq status bit. */
#define 	ERC_IRQ_STATUS_ICN_CFG_ERROR_Pos 	(0x0U)
#define 	ERC_IRQ_STATUS_ICN_CFG_ERROR_Msk 	(0x1UL << ERC_IRQ_STATUS_ICN_CFG_ERROR_Pos) 	/*!< 0x00000001 */
#define 	ERC_IRQ_STATUS_ICN_CFG_ERROR 	ERC_IRQ_STATUS_ICN_CFG_ERROR_Msk
#define 	ERC_IRQ_STATUS_ICN_HDR_ERROR_Pos 	(0x1U)
#define 	ERC_IRQ_STATUS_ICN_HDR_ERROR_Msk 	(0x1UL << ERC_IRQ_STATUS_ICN_HDR_ERROR_Pos) 	/*!< 0x00000002 */
#define 	ERC_IRQ_STATUS_ICN_HDR_ERROR 	ERC_IRQ_STATUS_ICN_HDR_ERROR_Msk
#define 	ERC_IRQ_STATUS_ICN_VDR_ERROR_Pos 	(0x2U)
#define 	ERC_IRQ_STATUS_ICN_VDR_ERROR_Msk 	(0x1UL << ERC_IRQ_STATUS_ICN_VDR_ERROR_Pos) 	/*!< 0x00000004 */
#define 	ERC_IRQ_STATUS_ICN_VDR_ERROR 	ERC_IRQ_STATUS_ICN_VDR_ERROR_Msk
#define 	ERC_IRQ_STATUS_ICN_TDR_ERROR_Pos 	(0x3U)
#define 	ERC_IRQ_STATUS_ICN_TDR_ERROR_Msk 	(0x1UL << ERC_IRQ_STATUS_ICN_TDR_ERROR_Pos) 	/*!< 0x00000008 */
#define 	ERC_IRQ_STATUS_ICN_TDR_ERROR 	ERC_IRQ_STATUS_ICN_TDR_ERROR_Msk
#define 	ERC_IRQ_STATUS_ICN_ILG_ERROR_Pos 	(0x4U)
#define 	ERC_IRQ_STATUS_ICN_ILG_ERROR_Msk 	(0x1UL << ERC_IRQ_STATUS_ICN_ILG_ERROR_Pos) 	/*!< 0x00000010 */
#define 	ERC_IRQ_STATUS_ICN_ILG_ERROR 	ERC_IRQ_STATUS_ICN_ILG_ERROR_Msk
#define 	ERC_IRQ_STATUS_DF_NON_TD_DROP_Pos 	(0x5U)
#define 	ERC_IRQ_STATUS_DF_NON_TD_DROP_Msk 	(0x1UL << ERC_IRQ_STATUS_DF_NON_TD_DROP_Pos) 	/*!< 0x00000020 */
#define 	ERC_IRQ_STATUS_DF_NON_TD_DROP 	ERC_IRQ_STATUS_DF_NON_TD_DROP_Msk
#define 	ERC_IRQ_STATUS_DF_TD_DROP_Pos 	(0x6U)
#define 	ERC_IRQ_STATUS_DF_TD_DROP_Msk 	(0x1UL << ERC_IRQ_STATUS_DF_TD_DROP_Pos) 	/*!< 0x00000040 */
#define 	ERC_IRQ_STATUS_DF_TD_DROP 	ERC_IRQ_STATUS_DF_TD_DROP_Msk
#define 	ERC_IRQ_STATUS_INTEREST_LEVEL_CMD_DONE_Pos 	(0x7U)
#define 	ERC_IRQ_STATUS_INTEREST_LEVEL_CMD_DONE_Msk 	(0x1UL << ERC_IRQ_STATUS_INTEREST_LEVEL_CMD_DONE_Pos) 	/*!< 0x00000080 */
#define 	ERC_IRQ_STATUS_INTEREST_LEVEL_CMD_DONE 	ERC_IRQ_STATUS_INTEREST_LEVEL_CMD_DONE_Msk
#define 	ERC_IRQ_STATUS_STAT_SNAP_UPDATE_Pos 	(0x8U)
#define 	ERC_IRQ_STATUS_STAT_SNAP_UPDATE_Msk 	(0x1UL << ERC_IRQ_STATUS_STAT_SNAP_UPDATE_Pos) 	/*!< 0x00000100 */
#define 	ERC_IRQ_STATUS_STAT_SNAP_UPDATE 	ERC_IRQ_STATUS_STAT_SNAP_UPDATE_Msk
#define 	ERC_IRQ_STATUS_USER_PIPE_FLUSH_DONE_Pos 	(0x9U)
#define 	ERC_IRQ_STATUS_USER_PIPE_FLUSH_DONE_Msk 	(0x1UL << ERC_IRQ_STATUS_USER_PIPE_FLUSH_DONE_Pos) 	/*!< 0x00000200 */
#define 	ERC_IRQ_STATUS_USER_PIPE_FLUSH_DONE 	ERC_IRQ_STATUS_USER_PIPE_FLUSH_DONE_Msk
#define 	ERC_IRQ_STATUS_AHVT_DROPPING_CMD_DONE_Pos 	(0xAU)
#define 	ERC_IRQ_STATUS_AHVT_DROPPING_CMD_DONE_Msk 	(0x1UL << ERC_IRQ_STATUS_AHVT_DROPPING_CMD_DONE_Pos) 	/*!< 0x00000400 */
#define 	ERC_IRQ_STATUS_AHVT_DROPPING_CMD_DONE 	ERC_IRQ_STATUS_AHVT_DROPPING_CMD_DONE_Msk
#define 	ERC_IRQ_STATUS_DEEP_LOW_POWER_SEEN_Pos 	(0xBU)
#define 	ERC_IRQ_STATUS_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ERC_IRQ_STATUS_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00000800 */
#define 	ERC_IRQ_STATUS_DEEP_LOW_POWER_SEEN 	ERC_IRQ_STATUS_DEEP_LOW_POWER_SEEN_Msk
#define 	ERC_IRQ_STATUS_SRAM_POWER_UP_DOWN_DONE_Pos 	(0x1CU)
#define 	ERC_IRQ_STATUS_SRAM_POWER_UP_DOWN_DONE_Msk 	(0x1UL << ERC_IRQ_STATUS_SRAM_POWER_UP_DOWN_DONE_Pos) 	/*!< 0x10000000 */
#define 	ERC_IRQ_STATUS_SRAM_POWER_UP_DOWN_DONE 	ERC_IRQ_STATUS_SRAM_POWER_UP_DOWN_DONE_Msk
#define 	ERC_IRQ_STATUS_FIRST_TIME_HIGH_ERROR_Pos 	(0x1DU)
#define 	ERC_IRQ_STATUS_FIRST_TIME_HIGH_ERROR_Msk 	(0x1UL << ERC_IRQ_STATUS_FIRST_TIME_HIGH_ERROR_Pos) 	/*!< 0x20000000 */
#define 	ERC_IRQ_STATUS_FIRST_TIME_HIGH_ERROR 	ERC_IRQ_STATUS_FIRST_TIME_HIGH_ERROR_Msk
#define 	ERC_IRQ_STATUS_EXIT_DEEP_LOW_POWER_ERROR_Pos 	(0x1EU)
#define 	ERC_IRQ_STATUS_EXIT_DEEP_LOW_POWER_ERROR_Msk 	(0x1UL << ERC_IRQ_STATUS_EXIT_DEEP_LOW_POWER_ERROR_Pos) 	/*!< 0x40000000 */
#define 	ERC_IRQ_STATUS_EXIT_DEEP_LOW_POWER_ERROR 	ERC_IRQ_STATUS_EXIT_DEEP_LOW_POWER_ERROR_Msk
#define 	ERC_IRQ_STATUS_DF_SRAM_BYPASS_DONE_Pos 	(0x1FU)
#define 	ERC_IRQ_STATUS_DF_SRAM_BYPASS_DONE_Msk 	(0x1UL << ERC_IRQ_STATUS_DF_SRAM_BYPASS_DONE_Pos) 	/*!< 0x80000000 */
#define 	ERC_IRQ_STATUS_DF_SRAM_BYPASS_DONE 	ERC_IRQ_STATUS_DF_SRAM_BYPASS_DONE_Msk
#define ERC_IRQ_MASK 	(0x00006040UL) 	/*<! Interrupt mask. Any bit set to 1 activate the corresponding interrupt. A bit set to 0 hide triggers of the corresponding interrupt. */
#define 	ERC_IRQ_MASK_ICN_CFG_ERROR_Pos 	(0x0U)
#define 	ERC_IRQ_MASK_ICN_CFG_ERROR_Msk 	(0x1UL << ERC_IRQ_MASK_ICN_CFG_ERROR_Pos) 	/*!< 0x00000001 */
#define 	ERC_IRQ_MASK_ICN_CFG_ERROR 	ERC_IRQ_MASK_ICN_CFG_ERROR_Msk
#define 	ERC_IRQ_MASK_ICN_HDR_ERROR_Pos 	(0x1U)
#define 	ERC_IRQ_MASK_ICN_HDR_ERROR_Msk 	(0x1UL << ERC_IRQ_MASK_ICN_HDR_ERROR_Pos) 	/*!< 0x00000002 */
#define 	ERC_IRQ_MASK_ICN_HDR_ERROR 	ERC_IRQ_MASK_ICN_HDR_ERROR_Msk
#define 	ERC_IRQ_MASK_ICN_VDR_ERROR_Pos 	(0x2U)
#define 	ERC_IRQ_MASK_ICN_VDR_ERROR_Msk 	(0x1UL << ERC_IRQ_MASK_ICN_VDR_ERROR_Pos) 	/*!< 0x00000004 */
#define 	ERC_IRQ_MASK_ICN_VDR_ERROR 	ERC_IRQ_MASK_ICN_VDR_ERROR_Msk
#define 	ERC_IRQ_MASK_ICN_TDR_ERROR_Pos 	(0x3U)
#define 	ERC_IRQ_MASK_ICN_TDR_ERROR_Msk 	(0x1UL << ERC_IRQ_MASK_ICN_TDR_ERROR_Pos) 	/*!< 0x00000008 */
#define 	ERC_IRQ_MASK_ICN_TDR_ERROR 	ERC_IRQ_MASK_ICN_TDR_ERROR_Msk
#define 	ERC_IRQ_MASK_ICN_ILG_ERROR_Pos 	(0x4U)
#define 	ERC_IRQ_MASK_ICN_ILG_ERROR_Msk 	(0x1UL << ERC_IRQ_MASK_ICN_ILG_ERROR_Pos) 	/*!< 0x00000010 */
#define 	ERC_IRQ_MASK_ICN_ILG_ERROR 	ERC_IRQ_MASK_ICN_ILG_ERROR_Msk
#define 	ERC_IRQ_MASK_DF_NON_TD_DROP_Pos 	(0x5U)
#define 	ERC_IRQ_MASK_DF_NON_TD_DROP_Msk 	(0x1UL << ERC_IRQ_MASK_DF_NON_TD_DROP_Pos) 	/*!< 0x00000020 */
#define 	ERC_IRQ_MASK_DF_NON_TD_DROP 	ERC_IRQ_MASK_DF_NON_TD_DROP_Msk
#define 	ERC_IRQ_MASK_DF_TD_DROP_Pos 	(0x6U)
#define 	ERC_IRQ_MASK_DF_TD_DROP_Msk 	(0x1UL << ERC_IRQ_MASK_DF_TD_DROP_Pos) 	/*!< 0x00000040 */
#define 	ERC_IRQ_MASK_DF_TD_DROP 	ERC_IRQ_MASK_DF_TD_DROP_Msk
#define 	ERC_IRQ_MASK_INTEREST_LEVEL_CMD_DONE_Pos 	(0x7U)
#define 	ERC_IRQ_MASK_INTEREST_LEVEL_CMD_DONE_Msk 	(0x1UL << ERC_IRQ_MASK_INTEREST_LEVEL_CMD_DONE_Pos) 	/*!< 0x00000080 */
#define 	ERC_IRQ_MASK_INTEREST_LEVEL_CMD_DONE 	ERC_IRQ_MASK_INTEREST_LEVEL_CMD_DONE_Msk
#define 	ERC_IRQ_MASK_STAT_SNAP_UPDATE_Pos 	(0x8U)
#define 	ERC_IRQ_MASK_STAT_SNAP_UPDATE_Msk 	(0x1UL << ERC_IRQ_MASK_STAT_SNAP_UPDATE_Pos) 	/*!< 0x00000100 */
#define 	ERC_IRQ_MASK_STAT_SNAP_UPDATE 	ERC_IRQ_MASK_STAT_SNAP_UPDATE_Msk
#define 	ERC_IRQ_MASK_USER_PIPE_FLUSH_DONE_Pos 	(0x9U)
#define 	ERC_IRQ_MASK_USER_PIPE_FLUSH_DONE_Msk 	(0x1UL << ERC_IRQ_MASK_USER_PIPE_FLUSH_DONE_Pos) 	/*!< 0x00000200 */
#define 	ERC_IRQ_MASK_USER_PIPE_FLUSH_DONE 	ERC_IRQ_MASK_USER_PIPE_FLUSH_DONE_Msk
#define 	ERC_IRQ_MASK_AHVT_DROPPING_CMD_DONE_Pos 	(0xAU)
#define 	ERC_IRQ_MASK_AHVT_DROPPING_CMD_DONE_Msk 	(0x1UL << ERC_IRQ_MASK_AHVT_DROPPING_CMD_DONE_Pos) 	/*!< 0x00000400 */
#define 	ERC_IRQ_MASK_AHVT_DROPPING_CMD_DONE 	ERC_IRQ_MASK_AHVT_DROPPING_CMD_DONE_Msk
#define 	ERC_IRQ_MASK_DEEP_LOW_POWER_SEEN_Pos 	(0xBU)
#define 	ERC_IRQ_MASK_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << ERC_IRQ_MASK_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00000800 */
#define 	ERC_IRQ_MASK_DEEP_LOW_POWER_SEEN 	ERC_IRQ_MASK_DEEP_LOW_POWER_SEEN_Msk
#define 	ERC_IRQ_MASK_SRAM_POWER_UP_DOWN_DONE_Pos 	(0x1CU)
#define 	ERC_IRQ_MASK_SRAM_POWER_UP_DOWN_DONE_Msk 	(0x1UL << ERC_IRQ_MASK_SRAM_POWER_UP_DOWN_DONE_Pos) 	/*!< 0x10000000 */
#define 	ERC_IRQ_MASK_SRAM_POWER_UP_DOWN_DONE 	ERC_IRQ_MASK_SRAM_POWER_UP_DOWN_DONE_Msk
#define 	ERC_IRQ_MASK_FIRST_TIME_HIGH_ERROR_Pos 	(0x1DU)
#define 	ERC_IRQ_MASK_FIRST_TIME_HIGH_ERROR_Msk 	(0x1UL << ERC_IRQ_MASK_FIRST_TIME_HIGH_ERROR_Pos) 	/*!< 0x20000000 */
#define 	ERC_IRQ_MASK_FIRST_TIME_HIGH_ERROR 	ERC_IRQ_MASK_FIRST_TIME_HIGH_ERROR_Msk
