jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_IRQ_MASK_EXIT_DEEP_LOW_POWER_ERROR_Pos 	(0x1EU)
#define 	ERC_IRQ_MASK_EXIT_DEEP_LOW_POWER_ERROR_Msk 	(0x1UL << ERC_IRQ_MASK_EXIT_DEEP_LOW_POWER_ERROR_Pos) 	/*!< 0x40000000 */
#define 	ERC_IRQ_MASK_EXIT_DEEP_LOW_POWER_ERROR 	ERC_IRQ_MASK_EXIT_DEEP_LOW_POWER_ERROR_Msk
#define 	ERC_IRQ_MASK_DF_SRAM_BYPASS_DONE_Pos 	(0x1FU)
#define 	ERC_IRQ_MASK_DF_SRAM_BYPASS_DONE_Msk 	(0x1UL << ERC_IRQ_MASK_DF_SRAM_BYPASS_DONE_Pos) 	/*!< 0x80000000 */
#define 	ERC_IRQ_MASK_DF_SRAM_BYPASS_DONE 	ERC_IRQ_MASK_DF_SRAM_BYPASS_DONE_Msk
#define ERC_IRQ_DF_NON_TD_DROP_CNT 	(0x00006044UL) 	/*<! When irq_pending.df_non_td_drop is raised and irq_enable.df_non_td_drop is 1, this register contains the number of non TD vectors dropped during the latest event period pushed in the delay fifo. This value should at least be added to the delay_fifo_non_td_rsvd_area.val field to avoid any futur non TDdrop on delay fifo input. Adding this value should not be sufficient if some non-TD vectors where stored in the Delay Fifo while the non TD reserved area was already full. */
#define 	ERC_IRQ_DF_NON_TD_DROP_CNT_VAL_Pos 	(0x0U)
#define 	ERC_IRQ_DF_NON_TD_DROP_CNT_VAL_Msk 	(0xFFFFUL << ERC_IRQ_DF_NON_TD_DROP_CNT_VAL_Pos) 	/*!< 0x0000FFFF */
#define 	ERC_IRQ_DF_NON_TD_DROP_CNT_VAL 	ERC_IRQ_DF_NON_TD_DROP_CNT_VAL_Msk
#define ERC_IRQ_DF_TD_DROP_CNT 	(0x00006048UL) 	/*<! When the delay fifo is full (even when some non TD reserved area remain available), it has to drop incoming TD vectors. This register contains the number of TD vectors dropped during the event period that raise the df_non_td_drop irq. */
#define 	ERC_IRQ_DF_TD_DROP_CNT_VAL_Pos 	(0x0U)
#define 	ERC_IRQ_DF_TD_DROP_CNT_VAL_Msk 	(0xFFFFUL << ERC_IRQ_DF_TD_DROP_CNT_VAL_Pos) 	/*!< 0x0000FFFF */
#define 	ERC_IRQ_DF_TD_DROP_CNT_VAL 	ERC_IRQ_DF_TD_DROP_CNT_VAL_Msk
#define ERC_SHADOW_CTRL 	(0x0000604CUL) 	/*<! Atomic register read ctrl */
#define 	ERC_SHADOW_CTRL_TIMER_EN_Pos 	(0x0U)
#define 	ERC_SHADOW_CTRL_TIMER_EN_Msk 	(0x1UL << ERC_SHADOW_CTRL_TIMER_EN_Pos) 	/*!< 0x00000001 */
#define 	ERC_SHADOW_CTRL_TIMER_EN 	ERC_SHADOW_CTRL_TIMER_EN_Msk
#define 	ERC_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos 	(0x1U)
#define 	ERC_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk 	(0x1UL << ERC_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos) 	/*!< 0x00000002 */
#define 	ERC_SHADOW_CTRL_IRQ_SW_OVERRIDE 	ERC_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk
#define 	ERC_SHADOW_CTRL_RESET_ON_COPY_Pos 	(0x2U)
#define 	ERC_SHADOW_CTRL_RESET_ON_COPY_Msk 	(0x1UL << ERC_SHADOW_CTRL_RESET_ON_COPY_Pos) 	/*!< 0x00000004 */
#define 	ERC_SHADOW_CTRL_RESET_ON_COPY 	ERC_SHADOW_CTRL_RESET_ON_COPY_Msk
#define ERC_SHADOW_TIMER_THRESHOLD 	(0x00006050UL) 	/*<! Atomic register timer */
#define 	ERC_SHADOW_TIMER_THRESHOLD_Pos 	(0x0U)
#define 	ERC_SHADOW_TIMER_THRESHOLD_Msk 	(0xFFFFUL << ERC_SHADOW_TIMER_THRESHOLD_Pos) 	/*!< 0x0000FFFF */
#define ERC_SHADOW_STATUS 	(0x00006054UL) 	/*<! Atomic register read ctrl */
#define 	ERC_SHADOW_STATUS_VALID_Pos 	(0x0U)
#define 	ERC_SHADOW_STATUS_VALID_Msk 	(0x1UL << ERC_SHADOW_STATUS_VALID_Pos) 	/*!< 0x00000001 */
#define 	ERC_SHADOW_STATUS_VALID 	ERC_SHADOW_STATUS_VALID_Msk
#define 	ERC_SHADOW_STATUS_OVERRUN_Pos 	(0x1U)
#define 	ERC_SHADOW_STATUS_OVERRUN_Msk 	(0x1UL << ERC_SHADOW_STATUS_OVERRUN_Pos) 	/*!< 0x00000002 */
#define 	ERC_SHADOW_STATUS_OVERRUN 	ERC_SHADOW_STATUS_OVERRUN_Msk
#define ERC_STAT_IN_TD_EVENT_COUNT 	(0x00006058UL) 	/*<! TD Event Count on input of delay fifo measured on the latest elapsed reference period */
#define 	ERC_STAT_IN_TD_EVENT_COUNT_VAL_Pos 	(0x0U)
#define 	ERC_STAT_IN_TD_EVENT_COUNT_VAL_Msk 	(0xFFFFFFFFUL << ERC_STAT_IN_TD_EVENT_COUNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	ERC_STAT_IN_TD_EVENT_COUNT_VAL 	ERC_STAT_IN_TD_EVENT_COUNT_VAL_Msk
#define ERC_STAT_ERC_TD_EVENT_COUNT 	(0x0000605CUL) 	/*<! TD Event Count measured on the latest elapsed reference period. */
#define 	ERC_STAT_TD_EVENT_COUNT_VAL_Pos 	(0x0U)
#define 	ERC_STAT_TD_EVENT_COUNT_VAL_Msk 	(0xFFFFFFFFUL << ERC_STAT_TD_EVENT_COUNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	ERC_STAT_TD_EVENT_COUNT_VAL 	ERC_STAT_TD_EVENT_COUNT_VAL_Msk
#define ERC_STAT_DF_TD_EVENT_DROP_COUNT 	(0x00006060UL) 	/*<! Dropped TD vectors count on delay fifo input. Vectors are dropped since there was no remaining room for TD events in the delay fifo for the current event period. */
#define 	ERC_STAT_DF_TD_EVENT_DROP_COUNT_VAL_Pos 	(0x0U)
#define 	ERC_STAT_DF_TD_EVENT_DROP_COUNT_VAL_Msk 	(0xFFFFFFFFUL << ERC_STAT_DF_TD_EVENT_DROP_COUNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	ERC_STAT_DF_TD_EVENT_DROP_COUNT_VAL 	ERC_STAT_DF_TD_EVENT_DROP_COUNT_VAL_Msk
#define ERC_STAT_DF_NON_TD_EVENT_DROP_COUNT 	(0x00006064UL) 	/*<! Number of non TD vectors (others, evt_time_high, ...) dropped because there was unsufficient area reserved for those events in the fifo. This information is given for the current event period. . */
#define 	ERC_STAT_DF_NON_TD_EVENT_DROP_COUNT_VAL_Pos 	(0x0U)
#define 	ERC_STAT_DF_NON_TD_EVENT_DROP_COUNT_VAL_Msk 	(0xFFFFFFFFUL << ERC_STAT_DF_NON_TD_EVENT_DROP_COUNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	ERC_STAT_DF_NON_TD_EVENT_DROP_COUNT_VAL 	ERC_STAT_DF_NON_TD_EVENT_DROP_COUNT_VAL_Msk
#define ERC_STAT_ALLDROP_TD_EVENT_DROP_COUNT 	(0x00006068UL) 	/*<!  */
#define 	ERC_STAT_ALLDROP_TD_EVENT_DROP_COUNT_VAL_Pos 	(0x0U)
#define 	ERC_STAT_ALLDROP_TD_EVENT_DROP_COUNT_VAL_Msk 	(0xFFFFFFFFUL << ERC_STAT_ALLDROP_TD_EVENT_DROP_COUNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	ERC_STAT_ALLDROP_TD_EVENT_DROP_COUNT_VAL 	ERC_STAT_ALLDROP_TD_EVENT_DROP_COUNT_VAL_Msk
#define ERC_STAT_HDROP_TD_EVENT_DROP_COUNT 	(0x0000606CUL) 	/*<!  */
#define 	ERC_STAT_HDROP_TD_EVENT_DROP_COUNT_VAL_Pos 	(0x0U)
#define 	ERC_STAT_HDROP_TD_EVENT_DROP_COUNT_VAL_Msk 	(0xFFFFFFFFUL << ERC_STAT_HDROP_TD_EVENT_DROP_COUNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	ERC_STAT_HDROP_TD_EVENT_DROP_COUNT_VAL 	ERC_STAT_HDROP_TD_EVENT_DROP_COUNT_VAL_Msk
#define ERC_STAT_VDROP_TD_EVENT_DROP_COUNT 	(0x00006070UL) 	/*<!  */
#define 	ERC_STAT_VDROP_TD_EVENT_DROP_COUNT_VAL_Pos 	(0x0U)
#define 	ERC_STAT_VDROP_TD_EVENT_DROP_COUNT_VAL_Msk 	(0xFFFFFFFFUL << ERC_STAT_VDROP_TD_EVENT_DROP_COUNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	ERC_STAT_VDROP_TD_EVENT_DROP_COUNT_VAL 	ERC_STAT_VDROP_TD_EVENT_DROP_COUNT_VAL_Msk
#define ERC_STAT_TDROP_TD_EVENT_DROP_COUNT 	(0x00006074UL) 	/*<!  */
#define 	ERC_STAT_TDROP_TD_EVENT_DROP_COUNT_VAL_Pos 	(0x0U)
#define 	ERC_STAT_TDROP_TD_EVENT_DROP_COUNT_VAL_Msk 	(0xFFFFFFFFUL << ERC_STAT_TDROP_TD_EVENT_DROP_COUNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	ERC_STAT_TDROP_TD_EVENT_DROP_COUNT_VAL 	ERC_STAT_TDROP_TD_EVENT_DROP_COUNT_VAL_Msk
#define ERC_STAT_OTHER_DROP_15_0 	(0x00006078UL) 	/*<!  */
#define 	ERC_STAT_OTHER_DROP_15_0_VAL_Pos 	(0x0U)
#define 	ERC_STAT_OTHER_DROP_15_0_VAL_Msk 	(0xFFFFFFFFUL << ERC_STAT_OTHER_DROP_15_0_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	ERC_STAT_OTHER_DROP_15_0_VAL 	ERC_STAT_OTHER_DROP_15_0_VAL_Msk
#define ERC_STAT_OTHER_DROP_31_16 	(0x0000607CUL) 	/*<!  */
#define 	ERC_STAT_OTHER_DROP_31_16_VAL_Pos 	(0x0U)
#define 	ERC_STAT_OTHER_DROP_31_16_VAL_Msk 	(0xFFFFFFFFUL << ERC_STAT_OTHER_DROP_31_16_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	ERC_STAT_OTHER_DROP_31_16_VAL 	ERC_STAT_OTHER_DROP_31_16_VAL_Msk
#define ERC_SNAP_FIRST_LAST_MODULE_TAG 	(0x00006080UL) 	/*<! First and Last (if it exists) ERC module tag flags for the latest event period. When there is no 'Last' ERC Module Tag event for the event period, all 'last' flags are zero. */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_START_SEQ_Pos 	(0x0U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_START_SEQ_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_START_SEQ_Pos) 	/*!< 0x00000001 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_START_SEQ 	ERC_SNAP_FIRST_LAST_MODULE_TAG_START_SEQ_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_SELECT_PONG_Pos 	(0x1U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_SELECT_PONG_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_SELECT_PONG_Pos) 	/*!< 0x00000002 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_SELECT_PONG 	ERC_SNAP_FIRST_LAST_MODULE_TAG_SELECT_PONG_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_INTLVL_EN_Pos 	(0x2U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_INTLVL_EN_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_INTLVL_EN_Pos) 	/*!< 0x00000004 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_INTLVL_EN 	ERC_SNAP_FIRST_LAST_MODULE_TAG_INTLVL_EN_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_WEAK_THOLD_Pos 	(0x3U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_WEAK_THOLD_Msk 	(0xFUL << ERC_SNAP_FIRST_LAST_MODULE_TAG_WEAK_THOLD_Pos) 	/*!< 0x00000078 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_WEAK_THOLD 	ERC_SNAP_FIRST_LAST_MODULE_TAG_WEAK_THOLD_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_ADR_DELAYED_Pos 	(0x7U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_ADR_DELAYED_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_ADR_DELAYED_Pos) 	/*!< 0x00000080 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_ADR_DELAYED 	ERC_SNAP_FIRST_LAST_MODULE_TAG_ADR_DELAYED_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_ALL_DR_GEQ_Pos 	(0x8U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_ALL_DR_GEQ_Msk 	(0x3FFUL << ERC_SNAP_FIRST_LAST_MODULE_TAG_ALL_DR_GEQ_Pos) 	/*!< 0x0003FF00 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_ALL_DR_GEQ 	ERC_SNAP_FIRST_LAST_MODULE_TAG_ALL_DR_GEQ_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_HDR_EN_Pos 	(0x12U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_HDR_EN_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_HDR_EN_Pos) 	/*!< 0x00040000 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_HDR_EN 	ERC_SNAP_FIRST_LAST_MODULE_TAG_HDR_EN_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_VDR_EN_Pos 	(0x13U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_VDR_EN_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_VDR_EN_Pos) 	/*!< 0x00080000 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_VDR_EN 	ERC_SNAP_FIRST_LAST_MODULE_TAG_VDR_EN_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_TDR_EN_Pos 	(0x14U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_TDR_EN_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_TDR_EN_Pos) 	/*!< 0x00100000 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_TDR_EN 	ERC_SNAP_FIRST_LAST_MODULE_TAG_TDR_EN_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_TDR_LUT_EN_Pos 	(0x15U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_TDR_LUT_EN_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_TDR_LUT_EN_Pos) 	/*!< 0x00200000 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_TDR_LUT_EN 	ERC_SNAP_FIRST_LAST_MODULE_TAG_TDR_LUT_EN_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_DISABLE_Pos 	(0x18U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_DISABLE_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_DISABLE_Pos) 	/*!< 0x01000000 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_DISABLE 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_DISABLE_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_ICN_CMD_Pos 	(0x19U)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_ICN_CMD_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_ICN_CMD_Pos) 	/*!< 0x02000000 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_ICN_CMD 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_ICN_CMD_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_DEEP_LOW_POWER_Pos 	(0x1AU)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_DEEP_LOW_POWER_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_DEEP_LOW_POWER_Pos) 	/*!< 0x04000000 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_DEEP_LOW_POWER 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FLUSH_DEEP_LOW_POWER_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_CYCLE_TIMEOUT_Pos 	(0x1BU)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_CYCLE_TIMEOUT_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_CYCLE_TIMEOUT_Pos) 	/*!< 0x08000000 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_CYCLE_TIMEOUT 	ERC_SNAP_FIRST_LAST_MODULE_TAG_CYCLE_TIMEOUT_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FFWD_TIMEOUT_Pos 	(0x1CU)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FFWD_TIMEOUT_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_FFWD_TIMEOUT_Pos) 	/*!< 0x10000000 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FFWD_TIMEOUT 	ERC_SNAP_FIRST_LAST_MODULE_TAG_FFWD_TIMEOUT_Msk
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_BEFORE_BYPASS_Pos 	(0x1DU)
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_BEFORE_BYPASS_Msk 	(0x1UL << ERC_SNAP_FIRST_LAST_MODULE_TAG_BEFORE_BYPASS_Pos) 	/*!< 0x20000000 */
#define 	ERC_SNAP_FIRST_LAST_MODULE_TAG_BEFORE_BYPASS 	ERC_SNAP_FIRST_LAST_MODULE_TAG_BEFORE_BYPASS_Msk
#define ERC_SNAP_AVG_DROP_RATE 	(0x00006084UL) 	/*<! Average drop rate used during latest ended period. */
#define 	ERC_SNAP_AVG_DROP_RATE_ID_Pos 	(0x0U)
#define 	ERC_SNAP_AVG_DROP_RATE_ID_Msk 	(0xFFFFUL << ERC_SNAP_AVG_DROP_RATE_ID_Pos) 	/*!< 0x0000FFFF */
#define 	ERC_SNAP_AVG_DROP_RATE_ID 	ERC_SNAP_AVG_DROP_RATE_ID_Msk
#define 	ERC_SNAP_AVG_DROP_RATE_OTHER_DROPS_Pos 	(0x10U)
#define 	ERC_SNAP_AVG_DROP_RATE_OTHER_DROPS_Msk 	(0x3UL << ERC_SNAP_AVG_DROP_RATE_OTHER_DROPS_Pos) 	/*!< 0x00030000 */
#define 	ERC_SNAP_AVG_DROP_RATE_OTHER_DROPS 	ERC_SNAP_AVG_DROP_RATE_OTHER_DROPS_Msk
#define ERC_SRAM_POWER_DOWN 	(0x00006090UL) 	/*<! SRAM power down control. Any field set to 0 powers the relative SRAM up. Any field set to 1 turns the relative SRAM off. */
#define 	ERC_SRAM_POWER_DOWN_DELAY_FIFO_PD_Pos 	(0x0U)
#define 	ERC_SRAM_POWER_DOWN_DELAY_FIFO_PD_Msk 	(0x1UL << ERC_SRAM_POWER_DOWN_DELAY_FIFO_PD_Pos) 	/*!< 0x00000001 */
#define 	ERC_SRAM_POWER_DOWN_DELAY_FIFO_PD 	ERC_SRAM_POWER_DOWN_DELAY_FIFO_PD_Msk
#define 	ERC_SRAM_POWER_DOWN_INTLVL_GRID_PD_Pos 	(0x1U)
#define 	ERC_SRAM_POWER_DOWN_INTLVL_GRID_PD_Msk 	(0x1UL << ERC_SRAM_POWER_DOWN_INTLVL_GRID_PD_Pos) 	/*!< 0x00000002 */
#define 	ERC_SRAM_POWER_DOWN_INTLVL_GRID_PD 	ERC_SRAM_POWER_DOWN_INTLVL_GRID_PD_Msk
#define 	ERC_SRAM_POWER_DOWN_TDROP_MEM_PD_Pos 	(0x2U)
#define 	ERC_SRAM_POWER_DOWN_TDROP_MEM_PD_Msk 	(0x1UL << ERC_SRAM_POWER_DOWN_TDROP_MEM_PD_Pos) 	/*!< 0x00000004 */
#define 	ERC_SRAM_POWER_DOWN_TDROP_MEM_PD 	ERC_SRAM_POWER_DOWN_TDROP_MEM_PD_Msk
#define 	ERC_SRAM_POWER_DOWN_DELAY_FIFO_PD_STATUS_Pos 	(0x10U)
#define 	ERC_SRAM_POWER_DOWN_DELAY_FIFO_PD_STATUS_Msk 	(0x1UL << ERC_SRAM_POWER_DOWN_DELAY_FIFO_PD_STATUS_Pos) 	/*!< 0x00010000 */
#define 	ERC_SRAM_POWER_DOWN_DELAY_FIFO_PD_STATUS 	ERC_SRAM_POWER_DOWN_DELAY_FIFO_PD_STATUS_Msk
#define 	ERC_SRAM_POWER_DOWN_INTLVL_GRID_PD_STATUS_Pos 	(0x11U)
#define 	ERC_SRAM_POWER_DOWN_INTLVL_GRID_PD_STATUS_Msk 	(0x1UL << ERC_SRAM_POWER_DOWN_INTLVL_GRID_PD_STATUS_Pos) 	/*!< 0x00020000 */
#define 	ERC_SRAM_POWER_DOWN_INTLVL_GRID_PD_STATUS 	ERC_SRAM_POWER_DOWN_INTLVL_GRID_PD_STATUS_Msk
#define 	ERC_SRAM_POWER_DOWN_TDROP_MEM_PD_STATUS_Pos 	(0x12U)
#define 	ERC_SRAM_POWER_DOWN_TDROP_MEM_PD_STATUS_Msk 	(0x1UL << ERC_SRAM_POWER_DOWN_TDROP_MEM_PD_STATUS_Pos) 	/*!< 0x00040000 */
#define 	ERC_SRAM_POWER_DOWN_TDROP_MEM_PD_STATUS 	ERC_SRAM_POWER_DOWN_TDROP_MEM_PD_STATUS_Msk
#define 	ERC_SRAM_POWER_DOWN_PD_STATUS_Pos 	(0x1FU)
#define 	ERC_SRAM_POWER_DOWN_PD_STATUS_Msk 	(0x1UL << ERC_SRAM_POWER_DOWN_PD_STATUS_Pos) 	/*!< 0x80000000 */
#define 	ERC_SRAM_POWER_DOWN_PD_STATUS 	ERC_SRAM_POWER_DOWN_PD_STATUS_Msk
#define ERC_SRAM_READ_WRITE_CYCLE_TIMING 	(0x00006094UL) 	/*<! (s) Read/write cycle timing selection. */
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_ADR_INTLVL_GRID0_WTSEL_Pos 	(0x0U)
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_ADR_INTLVL_GRID0_WTSEL_Msk 	(0x3UL << ERC_SRAM_READ_WRITE_CYCLE_TIMING_ADR_INTLVL_GRID0_WTSEL_Pos) 	/*!< 0x00000003 */
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_ADR_INTLVL_GRID0_WTSEL 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_ADR_INTLVL_GRID0_WTSEL_Msk
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_ADR_INTLVL_GRID0_RTSEL_Pos 	(0x2U)
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_ADR_INTLVL_GRID0_RTSEL_Msk 	(0x3UL << ERC_SRAM_READ_WRITE_CYCLE_TIMING_ADR_INTLVL_GRID0_RTSEL_Pos) 	/*!< 0x0000000C */
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_ADR_INTLVL_GRID0_RTSEL 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_ADR_INTLVL_GRID0_RTSEL_Msk
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_EDR_INTLVL_GRID0_WTSEL_Pos 	(0x8U)
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_EDR_INTLVL_GRID0_WTSEL_Msk 	(0x3UL << ERC_SRAM_READ_WRITE_CYCLE_TIMING_EDR_INTLVL_GRID0_WTSEL_Pos) 	/*!< 0x00000300 */
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_EDR_INTLVL_GRID0_WTSEL 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_EDR_INTLVL_GRID0_WTSEL_Msk
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_EDR_INTLVL_GRID0_RTSEL_Pos 	(0xAU)
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_EDR_INTLVL_GRID0_RTSEL_Msk 	(0x3UL << ERC_SRAM_READ_WRITE_CYCLE_TIMING_EDR_INTLVL_GRID0_RTSEL_Pos) 	/*!< 0x00000C00 */
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_EDR_INTLVL_GRID0_RTSEL 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_EDR_INTLVL_GRID0_RTSEL_Msk
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_T_DROP_WTSEL_Pos 	(0x10U)
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_T_DROP_WTSEL_Msk 	(0x3UL << ERC_SRAM_READ_WRITE_CYCLE_TIMING_T_DROP_WTSEL_Pos) 	/*!< 0x00030000 */
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_T_DROP_WTSEL 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_T_DROP_WTSEL_Msk
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_T_DROP_RTSEL_Pos 	(0x12U)
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_T_DROP_RTSEL_Msk 	(0x3UL << ERC_SRAM_READ_WRITE_CYCLE_TIMING_T_DROP_RTSEL_Pos) 	/*!< 0x000C0000 */
#define 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_T_DROP_RTSEL 	ERC_SRAM_READ_WRITE_CYCLE_TIMING_T_DROP_RTSEL_Msk
#define ERC_INTLVL_READ_BANK_SEL 	(0x00006098UL) 	/*<! (di) Select which interest level grid is read from icn. There are four grid to be read. */
#define 	ERC_INTLVL_READ_BANK_SEL_ID_Pos 	(0x0U)
#define 	ERC_INTLVL_READ_BANK_SEL_ID_Msk 	(0x3UL << ERC_INTLVL_READ_BANK_SEL_ID_Pos) 	/*!< 0x00000003 */
#define 	ERC_INTLVL_READ_BANK_SEL_ID 	ERC_INTLVL_READ_BANK_SEL_ID_Msk
#define ERC_END_OF_PERIOD_CYCLES_PER_US 	(0x0000609CUL) 	/*<! Timeout mechanism based on the number of clock cycles in an event period. This value is used concomitantly with the event period in µs to determine event period duration in cycles. If the current event period duration reaches maximum allowed cycles, a MT Last event is inserted to close the event period, and the event period sequence. */
#define 	ERC_END_OF_PERIOD_CYCLES_PER_US_NB_Pos 	(0x0U)
#define 	ERC_END_OF_PERIOD_CYCLES_PER_US_NB_Msk 	(0xFFFUL << ERC_END_OF_PERIOD_CYCLES_PER_US_NB_Pos) 	/*!< 0x00000FFF */
#define 	ERC_END_OF_PERIOD_CYCLES_PER_US_NB 	ERC_END_OF_PERIOD_CYCLES_PER_US_NB_Msk
#define ERC_DELAY_FIFO_FLUSH_AND_BYPASS 	(0x000060A0UL) 	/*<! (di) Force the DRAM of the delay to be unused. This command should be used when the ERC is in bypass. The delay fifo sram should be powered on before turning off the bypass, ad may only be powered off when the bypass enable is 1 and the status is 1. */
#define 	ERC_DELAY_FIFO_FLUSH_AND_BYPASS_EN_Pos 	(0x0U)
#define 	ERC_DELAY_FIFO_FLUSH_AND_BYPASS_EN_Msk 	(0x1UL << ERC_DELAY_FIFO_FLUSH_AND_BYPASS_EN_Pos) 	/*!< 0x00000001 */
#define 	ERC_DELAY_FIFO_FLUSH_AND_BYPASS_EN 	ERC_DELAY_FIFO_FLUSH_AND_BYPASS_EN_Msk
#define 	ERC_DELAY_FIFO_FLUSH_AND_BYPASS_STATUS_Pos 	(0x1FU)
#define 	ERC_DELAY_FIFO_FLUSH_AND_BYPASS_STATUS_Msk 	(0x1UL << ERC_DELAY_FIFO_FLUSH_AND_BYPASS_STATUS_Pos) 	/*!< 0x80000000 */
#define 	ERC_DELAY_FIFO_FLUSH_AND_BYPASS_STATUS 	ERC_DELAY_FIFO_FLUSH_AND_BYPASS_STATUS_Msk
#define ERC_TIMESTAMP_FROM_TH_TD_ONLY 	(0x000060A4UL) 	/*<! (s) Use timestamp from TimeHigh and TD events only to sync internal timer. */
#define 	ERC_TIMESTAMP_FROM_TH_TD_ONLY_EN_Pos 	(0x0U)
#define 	ERC_TIMESTAMP_FROM_TH_TD_ONLY_EN_Msk 	(0x1UL << ERC_TIMESTAMP_FROM_TH_TD_ONLY_EN_Pos) 	/*!< 0x00000001 */
#define 	ERC_TIMESTAMP_FROM_TH_TD_ONLY_EN 	ERC_TIMESTAMP_FROM_TH_TD_ONLY_EN_Msk
#define ERC_MANUAL_TD_AVG_DROP_RATE 	(0x000060A8UL) 	/*<! (dip) Average drop rate control. When enable, this option forces all event period to have the same avg_drop_rate specified through iD and other_drops fields. This register is applied dynamically on an event-period boundary. It means the event period that will get the new avg_drop_rate value when this register is enable is not fully known. Average drop rate new value is applied on an event period and all following event period. The 1st event period that take the new value into account is any of the event periods contained (even partially) in the ERC, or the next event period to enter the ERC, but not the event period that is output when theis register is enable. Warning: when manual_td_evt_drop_rate is enabled, this register has no effect. */
#define 	ERC_MANUAL_TD_AVG_DROP_RATE_ID_Pos 	(0x0U)
#define 	ERC_MANUAL_TD_AVG_DROP_RATE_ID_Msk 	(0xFFFFUL << ERC_MANUAL_TD_AVG_DROP_RATE_ID_Pos) 	/*!< 0x0000FFFF */
#define 	ERC_MANUAL_TD_AVG_DROP_RATE_ID 	ERC_MANUAL_TD_AVG_DROP_RATE_ID_Msk
#define 	ERC_MANUAL_TD_AVG_DROP_RATE_OTHER_DROPS_Pos 	(0x10U)
#define 	ERC_MANUAL_TD_AVG_DROP_RATE_OTHER_DROPS_Msk 	(0x3UL << ERC_MANUAL_TD_AVG_DROP_RATE_OTHER_DROPS_Pos) 	/*!< 0x00030000 */
#define 	ERC_MANUAL_TD_AVG_DROP_RATE_OTHER_DROPS 	ERC_MANUAL_TD_AVG_DROP_RATE_OTHER_DROPS_Msk
#define 	ERC_MANUAL_TD_AVG_DROP_RATE_EN_Pos 	(0x1FU)
#define 	ERC_MANUAL_TD_AVG_DROP_RATE_EN_Msk 	(0x1UL << ERC_MANUAL_TD_AVG_DROP_RATE_EN_Pos) 	/*!< 0x80000000 */
#define 	ERC_MANUAL_TD_AVG_DROP_RATE_EN 	ERC_MANUAL_TD_AVG_DROP_RATE_EN_Msk
#define ERC_MANUAL_TD_EVT_DROP_RATE 	(0x000060ACUL) 	/*<! (dip) Event drop rate control.  Interest levels may be used through field 'interest_level.use_intlvl_grid'. Note: this register has precedence over manual_td_avg_drop_rate. */
#define 	ERC_MANUAL_TD_EVT_DROP_RATE_EN_Pos 	(0x0U)
#define 	ERC_MANUAL_TD_EVT_DROP_RATE_EN_Msk 	(0x1UL << ERC_MANUAL_TD_EVT_DROP_RATE_EN_Pos) 	/*!< 0x00000001 */
#define 	ERC_MANUAL_TD_EVT_DROP_RATE_EN 	ERC_MANUAL_TD_EVT_DROP_RATE_EN_Msk
#define 	ERC_MANUAL_TD_EVT_DROP_RATE_DIJ_Pos 	(0x1U)
#define 	ERC_MANUAL_TD_EVT_DROP_RATE_DIJ_Msk 	(0x3FFUL << ERC_MANUAL_TD_EVT_DROP_RATE_DIJ_Pos) 	/*!< 0x000007FE */
#define 	ERC_MANUAL_TD_EVT_DROP_RATE_DIJ 	ERC_MANUAL_TD_EVT_DROP_RATE_DIJ_Msk
#define ERC_FORCE_IMMEDIATE_CHANGE 	(0x000060B0UL) 	/*<! (s) When a field of this register is set to '1', the corresponding (dp) register behaves immediatly as a (di) register. */
#define 	ERC_FORCE_IMMEDIATE_CHANGE_AHVT_DROPPING_CONTROL_Pos 	(0x0U)
#define 	ERC_FORCE_IMMEDIATE_CHANGE_AHVT_DROPPING_CONTROL_Msk 	(0x1UL << ERC_FORCE_IMMEDIATE_CHANGE_AHVT_DROPPING_CONTROL_Pos) 	/*!< 0x00000001 */
#define 	ERC_FORCE_IMMEDIATE_CHANGE_AHVT_DROPPING_CONTROL 	ERC_FORCE_IMMEDIATE_CHANGE_AHVT_DROPPING_CONTROL_Msk
#define 	ERC_FORCE_IMMEDIATE_CHANGE_INTEREST_LEVEL_Pos 	(0x1U)
#define 	ERC_FORCE_IMMEDIATE_CHANGE_INTEREST_LEVEL_Msk 	(0x1UL << ERC_FORCE_IMMEDIATE_CHANGE_INTEREST_LEVEL_Pos) 	/*!< 0x00000002 */
#define 	ERC_FORCE_IMMEDIATE_CHANGE_INTEREST_LEVEL 	ERC_FORCE_IMMEDIATE_CHANGE_INTEREST_LEVEL_Msk
#define ERC_RESET_TDROP_COUNTER_ON_MTAG_FIRST 	(0x000060B4UL) 	/*<! (s) When value is 1, reset t-drop counter at the beginning of each event period. When 0, the counter is not reset when event period change. */
#define 	ERC_RESET_TDROP_COUNTER_ON_MTAG_FIRST_EN_Pos 	(0x0U)
#define 	ERC_RESET_TDROP_COUNTER_ON_MTAG_FIRST_EN_Msk 	(0x1UL << ERC_RESET_TDROP_COUNTER_ON_MTAG_FIRST_EN_Pos) 	/*!< 0x00000001 */
#define 	ERC_RESET_TDROP_COUNTER_ON_MTAG_FIRST_EN 	ERC_RESET_TDROP_COUNTER_ON_MTAG_FIRST_EN_Msk
#define ERC_DELAY_FIFO_BYPASS_WO_BACK_PRESSURE 	(0x000060B8UL) 	/*<! (s) When 0 and delay_fifo_flush_and_bypass.en is 1, the delay fifo does not accept data while bypass is not effective. When 1 and delay_fifo_flush_and_bypass.en is 1, the delay fifo is flushed without generating backpressure. This is done by allowing write to the fifo during the cycle that follows a read immediately. */
#define 	ERC_DELAY_FIFO_BYPASS_WO_BACK_PRESSURE_EN_Pos 	(0x0U)
#define 	ERC_DELAY_FIFO_BYPASS_WO_BACK_PRESSURE_EN_Msk 	(0x1UL << ERC_DELAY_FIFO_BYPASS_WO_BACK_PRESSURE_EN_Pos) 	/*!< 0x00000001 */
#define 	ERC_DELAY_FIFO_BYPASS_WO_BACK_PRESSURE_EN 	ERC_DELAY_FIFO_BYPASS_WO_BACK_PRESSURE_EN_Msk
#define ERC_NICE_TO_HAVE 	(0x000060BCUL) 	/*<! (s) Some config bit that can be used to have up to date behavior. Use value 0 to have old behavior (the default), and 1 for the new behavior. */
#define 	ERC_NICE_TO_HAVE_EOS_ON_NEW_REF_PERIOD_Pos 	(0x0U)
#define 	ERC_NICE_TO_HAVE_EOS_ON_NEW_REF_PERIOD_Msk 	(0x1UL << ERC_NICE_TO_HAVE_EOS_ON_NEW_REF_PERIOD_Pos) 	/*!< 0x00000001 */
#define 	ERC_NICE_TO_HAVE_EOS_ON_NEW_REF_PERIOD 	ERC_NICE_TO_HAVE_EOS_ON_NEW_REF_PERIOD_Msk
