jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_NICE_TO_HAVE_BUGFREE_EVENT_PERIOD_CYCLE_CNT_Pos 	(0x1U)
#define 	ERC_NICE_TO_HAVE_BUGFREE_EVENT_PERIOD_CYCLE_CNT_Msk 	(0x1UL << ERC_NICE_TO_HAVE_BUGFREE_EVENT_PERIOD_CYCLE_CNT_Pos) 	/*!< 0x00000002 */
#define 	ERC_NICE_TO_HAVE_BUGFREE_EVENT_PERIOD_CYCLE_CNT 	ERC_NICE_TO_HAVE_BUGFREE_EVENT_PERIOD_CYCLE_CNT_Msk
#define 	ERC_NICE_TO_HAVE_ADD_CYCLE_TIMEOUT_IRQ_Pos 	(0x2U)
#define 	ERC_NICE_TO_HAVE_ADD_CYCLE_TIMEOUT_IRQ_Msk 	(0x1UL << ERC_NICE_TO_HAVE_ADD_CYCLE_TIMEOUT_IRQ_Pos) 	/*!< 0x00000004 */
#define 	ERC_NICE_TO_HAVE_ADD_CYCLE_TIMEOUT_IRQ 	ERC_NICE_TO_HAVE_ADD_CYCLE_TIMEOUT_IRQ_Msk
#define 	ERC_NICE_TO_HAVE_ADD_SRAM_POWER_STATE_IRQ_Pos 	(0x3U)
#define 	ERC_NICE_TO_HAVE_ADD_SRAM_POWER_STATE_IRQ_Msk 	(0x1UL << ERC_NICE_TO_HAVE_ADD_SRAM_POWER_STATE_IRQ_Pos) 	/*!< 0x00000008 */
#define 	ERC_NICE_TO_HAVE_ADD_SRAM_POWER_STATE_IRQ 	ERC_NICE_TO_HAVE_ADD_SRAM_POWER_STATE_IRQ_Msk
#define ERC_H_DROPPING_LUT_00 	(0x00006100UL) 	/*<! Hdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_H_DROPPING_LUT_00_V0_Pos 	(0x0U)
#define 	ERC_H_DROPPING_LUT_00_V0_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_00_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_H_DROPPING_LUT_00_V0 	ERC_H_DROPPING_LUT_00_V0_Msk
#define 	ERC_H_DROPPING_LUT_00_V1_Pos 	(0x8U)
#define 	ERC_H_DROPPING_LUT_00_V1_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_00_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_H_DROPPING_LUT_00_V1 	ERC_H_DROPPING_LUT_00_V1_Msk
#define 	ERC_H_DROPPING_LUT_00_V2_Pos 	(0x10U)
#define 	ERC_H_DROPPING_LUT_00_V2_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_00_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_H_DROPPING_LUT_00_V2 	ERC_H_DROPPING_LUT_00_V2_Msk
#define 	ERC_H_DROPPING_LUT_00_V3_Pos 	(0x18U)
#define 	ERC_H_DROPPING_LUT_00_V3_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_00_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_H_DROPPING_LUT_00_V3 	ERC_H_DROPPING_LUT_00_V3_Msk
#define ERC_H_DROPPING_LUT_01 	(0x00006104UL) 	/*<! Hdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_H_DROPPING_LUT_01_V0_Pos 	(0x0U)
#define 	ERC_H_DROPPING_LUT_01_V0_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_01_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_H_DROPPING_LUT_01_V0 	ERC_H_DROPPING_LUT_01_V0_Msk
#define 	ERC_H_DROPPING_LUT_01_V1_Pos 	(0x8U)
#define 	ERC_H_DROPPING_LUT_01_V1_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_01_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_H_DROPPING_LUT_01_V1 	ERC_H_DROPPING_LUT_01_V1_Msk
#define 	ERC_H_DROPPING_LUT_01_V2_Pos 	(0x10U)
#define 	ERC_H_DROPPING_LUT_01_V2_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_01_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_H_DROPPING_LUT_01_V2 	ERC_H_DROPPING_LUT_01_V2_Msk
#define 	ERC_H_DROPPING_LUT_01_V3_Pos 	(0x18U)
#define 	ERC_H_DROPPING_LUT_01_V3_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_01_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_H_DROPPING_LUT_01_V3 	ERC_H_DROPPING_LUT_01_V3_Msk
#define ERC_H_DROPPING_LUT_02 	(0x00006108UL) 	/*<! Hdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_H_DROPPING_LUT_02_V0_Pos 	(0x0U)
#define 	ERC_H_DROPPING_LUT_02_V0_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_02_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_H_DROPPING_LUT_02_V0 	ERC_H_DROPPING_LUT_02_V0_Msk
#define 	ERC_H_DROPPING_LUT_02_V1_Pos 	(0x8U)
#define 	ERC_H_DROPPING_LUT_02_V1_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_02_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_H_DROPPING_LUT_02_V1 	ERC_H_DROPPING_LUT_02_V1_Msk
#define 	ERC_H_DROPPING_LUT_02_V2_Pos 	(0x10U)
#define 	ERC_H_DROPPING_LUT_02_V2_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_02_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_H_DROPPING_LUT_02_V2 	ERC_H_DROPPING_LUT_02_V2_Msk
#define 	ERC_H_DROPPING_LUT_02_V3_Pos 	(0x18U)
#define 	ERC_H_DROPPING_LUT_02_V3_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_02_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_H_DROPPING_LUT_02_V3 	ERC_H_DROPPING_LUT_02_V3_Msk
#define ERC_H_DROPPING_LUT_03 	(0x0000610CUL) 	/*<! Hdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_H_DROPPING_LUT_03_V0_Pos 	(0x0U)
#define 	ERC_H_DROPPING_LUT_03_V0_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_03_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_H_DROPPING_LUT_03_V0 	ERC_H_DROPPING_LUT_03_V0_Msk
#define 	ERC_H_DROPPING_LUT_03_V1_Pos 	(0x8U)
#define 	ERC_H_DROPPING_LUT_03_V1_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_03_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_H_DROPPING_LUT_03_V1 	ERC_H_DROPPING_LUT_03_V1_Msk
#define 	ERC_H_DROPPING_LUT_03_V2_Pos 	(0x10U)
#define 	ERC_H_DROPPING_LUT_03_V2_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_03_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_H_DROPPING_LUT_03_V2 	ERC_H_DROPPING_LUT_03_V2_Msk
#define 	ERC_H_DROPPING_LUT_03_V3_Pos 	(0x18U)
#define 	ERC_H_DROPPING_LUT_03_V3_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_03_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_H_DROPPING_LUT_03_V3 	ERC_H_DROPPING_LUT_03_V3_Msk
#define ERC_H_DROPPING_LUT_04 	(0x00006110UL) 	/*<! Hdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_H_DROPPING_LUT_04_V0_Pos 	(0x0U)
#define 	ERC_H_DROPPING_LUT_04_V0_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_04_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_H_DROPPING_LUT_04_V0 	ERC_H_DROPPING_LUT_04_V0_Msk
#define 	ERC_H_DROPPING_LUT_04_V1_Pos 	(0x8U)
#define 	ERC_H_DROPPING_LUT_04_V1_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_04_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_H_DROPPING_LUT_04_V1 	ERC_H_DROPPING_LUT_04_V1_Msk
#define 	ERC_H_DROPPING_LUT_04_V2_Pos 	(0x10U)
#define 	ERC_H_DROPPING_LUT_04_V2_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_04_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_H_DROPPING_LUT_04_V2 	ERC_H_DROPPING_LUT_04_V2_Msk
#define 	ERC_H_DROPPING_LUT_04_V3_Pos 	(0x18U)
#define 	ERC_H_DROPPING_LUT_04_V3_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_04_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_H_DROPPING_LUT_04_V3 	ERC_H_DROPPING_LUT_04_V3_Msk
#define ERC_H_DROPPING_LUT_05 	(0x00006114UL) 	/*<! Hdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_H_DROPPING_LUT_05_V0_Pos 	(0x0U)
#define 	ERC_H_DROPPING_LUT_05_V0_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_05_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_H_DROPPING_LUT_05_V0 	ERC_H_DROPPING_LUT_05_V0_Msk
#define 	ERC_H_DROPPING_LUT_05_V1_Pos 	(0x8U)
#define 	ERC_H_DROPPING_LUT_05_V1_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_05_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_H_DROPPING_LUT_05_V1 	ERC_H_DROPPING_LUT_05_V1_Msk
#define 	ERC_H_DROPPING_LUT_05_V2_Pos 	(0x10U)
#define 	ERC_H_DROPPING_LUT_05_V2_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_05_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_H_DROPPING_LUT_05_V2 	ERC_H_DROPPING_LUT_05_V2_Msk
#define 	ERC_H_DROPPING_LUT_05_V3_Pos 	(0x18U)
#define 	ERC_H_DROPPING_LUT_05_V3_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_05_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_H_DROPPING_LUT_05_V3 	ERC_H_DROPPING_LUT_05_V3_Msk
#define ERC_H_DROPPING_LUT_06 	(0x00006118UL) 	/*<! Hdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_H_DROPPING_LUT_06_V0_Pos 	(0x0U)
#define 	ERC_H_DROPPING_LUT_06_V0_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_06_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_H_DROPPING_LUT_06_V0 	ERC_H_DROPPING_LUT_06_V0_Msk
#define 	ERC_H_DROPPING_LUT_06_V1_Pos 	(0x8U)
#define 	ERC_H_DROPPING_LUT_06_V1_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_06_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_H_DROPPING_LUT_06_V1 	ERC_H_DROPPING_LUT_06_V1_Msk
#define 	ERC_H_DROPPING_LUT_06_V2_Pos 	(0x10U)
#define 	ERC_H_DROPPING_LUT_06_V2_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_06_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_H_DROPPING_LUT_06_V2 	ERC_H_DROPPING_LUT_06_V2_Msk
#define 	ERC_H_DROPPING_LUT_06_V3_Pos 	(0x18U)
#define 	ERC_H_DROPPING_LUT_06_V3_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_06_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_H_DROPPING_LUT_06_V3 	ERC_H_DROPPING_LUT_06_V3_Msk
#define ERC_H_DROPPING_LUT_07 	(0x0000611CUL) 	/*<! Hdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_H_DROPPING_LUT_07_V0_Pos 	(0x0U)
#define 	ERC_H_DROPPING_LUT_07_V0_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_07_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_H_DROPPING_LUT_07_V0 	ERC_H_DROPPING_LUT_07_V0_Msk
#define 	ERC_H_DROPPING_LUT_07_V1_Pos 	(0x8U)
#define 	ERC_H_DROPPING_LUT_07_V1_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_07_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_H_DROPPING_LUT_07_V1 	ERC_H_DROPPING_LUT_07_V1_Msk
#define 	ERC_H_DROPPING_LUT_07_V2_Pos 	(0x10U)
#define 	ERC_H_DROPPING_LUT_07_V2_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_07_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_H_DROPPING_LUT_07_V2 	ERC_H_DROPPING_LUT_07_V2_Msk
#define 	ERC_H_DROPPING_LUT_07_V3_Pos 	(0x18U)
#define 	ERC_H_DROPPING_LUT_07_V3_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_07_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_H_DROPPING_LUT_07_V3 	ERC_H_DROPPING_LUT_07_V3_Msk
#define ERC_H_DROPPING_LUT_08 	(0x00006120UL) 	/*<! Hdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_H_DROPPING_LUT_08_V0_Pos 	(0x0U)
#define 	ERC_H_DROPPING_LUT_08_V0_Msk 	(0x1FUL << ERC_H_DROPPING_LUT_08_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_H_DROPPING_LUT_08_V0 	ERC_H_DROPPING_LUT_08_V0_Msk
#define ERC_V_DROPPING_LUT_00 	(0x00006140UL) 	/*<! Vdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_V_DROPPING_LUT_00_V0_Pos 	(0x0U)
#define 	ERC_V_DROPPING_LUT_00_V0_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_00_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_V_DROPPING_LUT_00_V0 	ERC_V_DROPPING_LUT_00_V0_Msk
#define 	ERC_V_DROPPING_LUT_00_V1_Pos 	(0x8U)
#define 	ERC_V_DROPPING_LUT_00_V1_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_00_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_V_DROPPING_LUT_00_V1 	ERC_V_DROPPING_LUT_00_V1_Msk
#define 	ERC_V_DROPPING_LUT_00_V2_Pos 	(0x10U)
#define 	ERC_V_DROPPING_LUT_00_V2_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_00_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_V_DROPPING_LUT_00_V2 	ERC_V_DROPPING_LUT_00_V2_Msk
#define 	ERC_V_DROPPING_LUT_00_V3_Pos 	(0x18U)
#define 	ERC_V_DROPPING_LUT_00_V3_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_00_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_V_DROPPING_LUT_00_V3 	ERC_V_DROPPING_LUT_00_V3_Msk
#define ERC_V_DROPPING_LUT_01 	(0x00006144UL) 	/*<! Vdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_V_DROPPING_LUT_01_V0_Pos 	(0x0U)
#define 	ERC_V_DROPPING_LUT_01_V0_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_01_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_V_DROPPING_LUT_01_V0 	ERC_V_DROPPING_LUT_01_V0_Msk
#define 	ERC_V_DROPPING_LUT_01_V1_Pos 	(0x8U)
#define 	ERC_V_DROPPING_LUT_01_V1_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_01_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_V_DROPPING_LUT_01_V1 	ERC_V_DROPPING_LUT_01_V1_Msk
#define 	ERC_V_DROPPING_LUT_01_V2_Pos 	(0x10U)
#define 	ERC_V_DROPPING_LUT_01_V2_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_01_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_V_DROPPING_LUT_01_V2 	ERC_V_DROPPING_LUT_01_V2_Msk
#define 	ERC_V_DROPPING_LUT_01_V3_Pos 	(0x18U)
#define 	ERC_V_DROPPING_LUT_01_V3_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_01_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_V_DROPPING_LUT_01_V3 	ERC_V_DROPPING_LUT_01_V3_Msk
#define ERC_V_DROPPING_LUT_02 	(0x00006148UL) 	/*<! Vdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_V_DROPPING_LUT_02_V0_Pos 	(0x0U)
#define 	ERC_V_DROPPING_LUT_02_V0_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_02_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_V_DROPPING_LUT_02_V0 	ERC_V_DROPPING_LUT_02_V0_Msk
#define 	ERC_V_DROPPING_LUT_02_V1_Pos 	(0x8U)
#define 	ERC_V_DROPPING_LUT_02_V1_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_02_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_V_DROPPING_LUT_02_V1 	ERC_V_DROPPING_LUT_02_V1_Msk
#define 	ERC_V_DROPPING_LUT_02_V2_Pos 	(0x10U)
#define 	ERC_V_DROPPING_LUT_02_V2_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_02_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_V_DROPPING_LUT_02_V2 	ERC_V_DROPPING_LUT_02_V2_Msk
#define 	ERC_V_DROPPING_LUT_02_V3_Pos 	(0x18U)
#define 	ERC_V_DROPPING_LUT_02_V3_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_02_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_V_DROPPING_LUT_02_V3 	ERC_V_DROPPING_LUT_02_V3_Msk
#define ERC_V_DROPPING_LUT_03 	(0x0000614CUL) 	/*<! Vdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_V_DROPPING_LUT_03_V0_Pos 	(0x0U)
#define 	ERC_V_DROPPING_LUT_03_V0_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_03_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_V_DROPPING_LUT_03_V0 	ERC_V_DROPPING_LUT_03_V0_Msk
#define 	ERC_V_DROPPING_LUT_03_V1_Pos 	(0x8U)
#define 	ERC_V_DROPPING_LUT_03_V1_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_03_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_V_DROPPING_LUT_03_V1 	ERC_V_DROPPING_LUT_03_V1_Msk
#define 	ERC_V_DROPPING_LUT_03_V2_Pos 	(0x10U)
#define 	ERC_V_DROPPING_LUT_03_V2_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_03_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_V_DROPPING_LUT_03_V2 	ERC_V_DROPPING_LUT_03_V2_Msk
#define 	ERC_V_DROPPING_LUT_03_V3_Pos 	(0x18U)
#define 	ERC_V_DROPPING_LUT_03_V3_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_03_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_V_DROPPING_LUT_03_V3 	ERC_V_DROPPING_LUT_03_V3_Msk
#define ERC_V_DROPPING_LUT_04 	(0x00006150UL) 	/*<! Vdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_V_DROPPING_LUT_04_V0_Pos 	(0x0U)
#define 	ERC_V_DROPPING_LUT_04_V0_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_04_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_V_DROPPING_LUT_04_V0 	ERC_V_DROPPING_LUT_04_V0_Msk
#define 	ERC_V_DROPPING_LUT_04_V1_Pos 	(0x8U)
#define 	ERC_V_DROPPING_LUT_04_V1_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_04_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_V_DROPPING_LUT_04_V1 	ERC_V_DROPPING_LUT_04_V1_Msk
#define 	ERC_V_DROPPING_LUT_04_V2_Pos 	(0x10U)
#define 	ERC_V_DROPPING_LUT_04_V2_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_04_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_V_DROPPING_LUT_04_V2 	ERC_V_DROPPING_LUT_04_V2_Msk
#define 	ERC_V_DROPPING_LUT_04_V3_Pos 	(0x18U)
#define 	ERC_V_DROPPING_LUT_04_V3_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_04_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_V_DROPPING_LUT_04_V3 	ERC_V_DROPPING_LUT_04_V3_Msk
#define ERC_V_DROPPING_LUT_05 	(0x00006154UL) 	/*<! Vdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_V_DROPPING_LUT_05_V0_Pos 	(0x0U)
#define 	ERC_V_DROPPING_LUT_05_V0_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_05_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_V_DROPPING_LUT_05_V0 	ERC_V_DROPPING_LUT_05_V0_Msk
#define 	ERC_V_DROPPING_LUT_05_V1_Pos 	(0x8U)
#define 	ERC_V_DROPPING_LUT_05_V1_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_05_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_V_DROPPING_LUT_05_V1 	ERC_V_DROPPING_LUT_05_V1_Msk
#define 	ERC_V_DROPPING_LUT_05_V2_Pos 	(0x10U)
#define 	ERC_V_DROPPING_LUT_05_V2_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_05_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_V_DROPPING_LUT_05_V2 	ERC_V_DROPPING_LUT_05_V2_Msk
#define 	ERC_V_DROPPING_LUT_05_V3_Pos 	(0x18U)
#define 	ERC_V_DROPPING_LUT_05_V3_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_05_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_V_DROPPING_LUT_05_V3 	ERC_V_DROPPING_LUT_05_V3_Msk
#define ERC_V_DROPPING_LUT_06 	(0x00006158UL) 	/*<! Vdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_V_DROPPING_LUT_06_V0_Pos 	(0x0U)
#define 	ERC_V_DROPPING_LUT_06_V0_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_06_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_V_DROPPING_LUT_06_V0 	ERC_V_DROPPING_LUT_06_V0_Msk
#define 	ERC_V_DROPPING_LUT_06_V1_Pos 	(0x8U)
#define 	ERC_V_DROPPING_LUT_06_V1_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_06_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_V_DROPPING_LUT_06_V1 	ERC_V_DROPPING_LUT_06_V1_Msk
#define 	ERC_V_DROPPING_LUT_06_V2_Pos 	(0x10U)
#define 	ERC_V_DROPPING_LUT_06_V2_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_06_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_V_DROPPING_LUT_06_V2 	ERC_V_DROPPING_LUT_06_V2_Msk
#define 	ERC_V_DROPPING_LUT_06_V3_Pos 	(0x18U)
#define 	ERC_V_DROPPING_LUT_06_V3_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_06_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_V_DROPPING_LUT_06_V3 	ERC_V_DROPPING_LUT_06_V3_Msk
#define ERC_V_DROPPING_LUT_07 	(0x0000615CUL) 	/*<! Vdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_V_DROPPING_LUT_07_V0_Pos 	(0x0U)
#define 	ERC_V_DROPPING_LUT_07_V0_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_07_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_V_DROPPING_LUT_07_V0 	ERC_V_DROPPING_LUT_07_V0_Msk
#define 	ERC_V_DROPPING_LUT_07_V1_Pos 	(0x8U)
#define 	ERC_V_DROPPING_LUT_07_V1_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_07_V1_Pos) 	/*!< 0x00001F00 */
#define 	ERC_V_DROPPING_LUT_07_V1 	ERC_V_DROPPING_LUT_07_V1_Msk
#define 	ERC_V_DROPPING_LUT_07_V2_Pos 	(0x10U)
#define 	ERC_V_DROPPING_LUT_07_V2_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_07_V2_Pos) 	/*!< 0x001F0000 */
#define 	ERC_V_DROPPING_LUT_07_V2 	ERC_V_DROPPING_LUT_07_V2_Msk
#define 	ERC_V_DROPPING_LUT_07_V3_Pos 	(0x18U)
#define 	ERC_V_DROPPING_LUT_07_V3_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_07_V3_Pos) 	/*!< 0x1F000000 */
#define 	ERC_V_DROPPING_LUT_07_V3 	ERC_V_DROPPING_LUT_07_V3_Msk
#define ERC_V_DROPPING_LUT_08 	(0x00006160UL) 	/*<! Vdrop value is a Q1.5 selected by Di,j Q1.5 value */
#define 	ERC_V_DROPPING_LUT_08_V0_Pos 	(0x0U)
#define 	ERC_V_DROPPING_LUT_08_V0_Msk 	(0x1FUL << ERC_V_DROPPING_LUT_08_V0_Pos) 	/*!< 0x0000001F */
#define 	ERC_V_DROPPING_LUT_08_V0 	ERC_V_DROPPING_LUT_08_V0_Msk
#define ERC_T_DROPPING_LUT_000 	(0x00006400UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_000_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_000_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_000_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_000_V0 	ERC_T_DROPPING_LUT_000_V0_Msk
#define 	ERC_T_DROPPING_LUT_000_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_000_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_000_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_000_V1 	ERC_T_DROPPING_LUT_000_V1_Msk
#define ERC_T_DROPPING_LUT_001 	(0x00006404UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_001_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_001_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_001_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_001_V0 	ERC_T_DROPPING_LUT_001_V0_Msk
#define 	ERC_T_DROPPING_LUT_001_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_001_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_001_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_001_V1 	ERC_T_DROPPING_LUT_001_V1_Msk
#define ERC_T_DROPPING_LUT_002 	(0x00006408UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_002_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_002_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_002_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_002_V0 	ERC_T_DROPPING_LUT_002_V0_Msk
#define 	ERC_T_DROPPING_LUT_002_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_002_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_002_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_002_V1 	ERC_T_DROPPING_LUT_002_V1_Msk
#define ERC_T_DROPPING_LUT_003 	(0x0000640CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_003_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_003_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_003_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_003_V0 	ERC_T_DROPPING_LUT_003_V0_Msk
#define 	ERC_T_DROPPING_LUT_003_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_003_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_003_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_003_V1 	ERC_T_DROPPING_LUT_003_V1_Msk
#define ERC_T_DROPPING_LUT_004 	(0x00006410UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_004_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_004_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_004_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_004_V0 	ERC_T_DROPPING_LUT_004_V0_Msk
#define 	ERC_T_DROPPING_LUT_004_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_004_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_004_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_004_V1 	ERC_T_DROPPING_LUT_004_V1_Msk
#define ERC_T_DROPPING_LUT_005 	(0x00006414UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_005_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_005_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_005_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_005_V0 	ERC_T_DROPPING_LUT_005_V0_Msk
#define 	ERC_T_DROPPING_LUT_005_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_005_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_005_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_005_V1 	ERC_T_DROPPING_LUT_005_V1_Msk
#define ERC_T_DROPPING_LUT_006 	(0x00006418UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_006_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_006_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_006_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_006_V0 	ERC_T_DROPPING_LUT_006_V0_Msk
#define 	ERC_T_DROPPING_LUT_006_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_006_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_006_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_006_V1 	ERC_T_DROPPING_LUT_006_V1_Msk
#define ERC_T_DROPPING_LUT_007 	(0x0000641CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_007_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_007_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_007_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_007_V0 	ERC_T_DROPPING_LUT_007_V0_Msk
#define 	ERC_T_DROPPING_LUT_007_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_007_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_007_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_007_V1 	ERC_T_DROPPING_LUT_007_V1_Msk
#define ERC_T_DROPPING_LUT_008 	(0x00006420UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_008_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_008_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_008_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_008_V0 	ERC_T_DROPPING_LUT_008_V0_Msk
#define 	ERC_T_DROPPING_LUT_008_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_008_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_008_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_008_V1 	ERC_T_DROPPING_LUT_008_V1_Msk
#define ERC_T_DROPPING_LUT_009 	(0x00006424UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_009_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_009_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_009_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_009_V0 	ERC_T_DROPPING_LUT_009_V0_Msk
#define 	ERC_T_DROPPING_LUT_009_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_009_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_009_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_009_V1 	ERC_T_DROPPING_LUT_009_V1_Msk
#define ERC_T_DROPPING_LUT_010 	(0x00006428UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_010_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_010_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_010_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_010_V0 	ERC_T_DROPPING_LUT_010_V0_Msk
#define 	ERC_T_DROPPING_LUT_010_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_010_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_010_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_010_V1 	ERC_T_DROPPING_LUT_010_V1_Msk
#define ERC_T_DROPPING_LUT_011 	(0x0000642CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_011_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_011_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_011_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_011_V0 	ERC_T_DROPPING_LUT_011_V0_Msk
#define 	ERC_T_DROPPING_LUT_011_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_011_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_011_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_011_V1 	ERC_T_DROPPING_LUT_011_V1_Msk
#define ERC_T_DROPPING_LUT_012 	(0x00006430UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_012_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_012_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_012_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_012_V0 	ERC_T_DROPPING_LUT_012_V0_Msk
#define 	ERC_T_DROPPING_LUT_012_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_012_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_012_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_012_V1 	ERC_T_DROPPING_LUT_012_V1_Msk
#define ERC_T_DROPPING_LUT_013 	(0x00006434UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_013_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_013_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_013_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_013_V0 	ERC_T_DROPPING_LUT_013_V0_Msk
#define 	ERC_T_DROPPING_LUT_013_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_013_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_013_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_013_V1 	ERC_T_DROPPING_LUT_013_V1_Msk
#define ERC_T_DROPPING_LUT_014 	(0x00006438UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_014_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_014_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_014_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_014_V0 	ERC_T_DROPPING_LUT_014_V0_Msk
#define 	ERC_T_DROPPING_LUT_014_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_014_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_014_V1_Pos) 	/*!< 0x01FF0000 */
