jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_T_DROPPING_LUT_014_V1 	ERC_T_DROPPING_LUT_014_V1_Msk
#define ERC_T_DROPPING_LUT_015 	(0x0000643CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_015_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_015_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_015_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_015_V0 	ERC_T_DROPPING_LUT_015_V0_Msk
#define 	ERC_T_DROPPING_LUT_015_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_015_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_015_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_015_V1 	ERC_T_DROPPING_LUT_015_V1_Msk
#define ERC_T_DROPPING_LUT_016 	(0x00006440UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_016_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_016_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_016_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_016_V0 	ERC_T_DROPPING_LUT_016_V0_Msk
#define 	ERC_T_DROPPING_LUT_016_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_016_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_016_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_016_V1 	ERC_T_DROPPING_LUT_016_V1_Msk
#define ERC_T_DROPPING_LUT_017 	(0x00006444UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_017_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_017_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_017_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_017_V0 	ERC_T_DROPPING_LUT_017_V0_Msk
#define 	ERC_T_DROPPING_LUT_017_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_017_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_017_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_017_V1 	ERC_T_DROPPING_LUT_017_V1_Msk
#define ERC_T_DROPPING_LUT_018 	(0x00006448UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_018_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_018_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_018_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_018_V0 	ERC_T_DROPPING_LUT_018_V0_Msk
#define 	ERC_T_DROPPING_LUT_018_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_018_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_018_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_018_V1 	ERC_T_DROPPING_LUT_018_V1_Msk
#define ERC_T_DROPPING_LUT_019 	(0x0000644CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_019_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_019_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_019_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_019_V0 	ERC_T_DROPPING_LUT_019_V0_Msk
#define 	ERC_T_DROPPING_LUT_019_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_019_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_019_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_019_V1 	ERC_T_DROPPING_LUT_019_V1_Msk
#define ERC_T_DROPPING_LUT_020 	(0x00006450UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_020_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_020_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_020_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_020_V0 	ERC_T_DROPPING_LUT_020_V0_Msk
#define 	ERC_T_DROPPING_LUT_020_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_020_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_020_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_020_V1 	ERC_T_DROPPING_LUT_020_V1_Msk
#define ERC_T_DROPPING_LUT_021 	(0x00006454UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_021_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_021_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_021_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_021_V0 	ERC_T_DROPPING_LUT_021_V0_Msk
#define 	ERC_T_DROPPING_LUT_021_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_021_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_021_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_021_V1 	ERC_T_DROPPING_LUT_021_V1_Msk
#define ERC_T_DROPPING_LUT_022 	(0x00006458UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_022_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_022_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_022_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_022_V0 	ERC_T_DROPPING_LUT_022_V0_Msk
#define 	ERC_T_DROPPING_LUT_022_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_022_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_022_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_022_V1 	ERC_T_DROPPING_LUT_022_V1_Msk
#define ERC_T_DROPPING_LUT_023 	(0x0000645CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_023_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_023_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_023_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_023_V0 	ERC_T_DROPPING_LUT_023_V0_Msk
#define 	ERC_T_DROPPING_LUT_023_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_023_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_023_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_023_V1 	ERC_T_DROPPING_LUT_023_V1_Msk
#define ERC_T_DROPPING_LUT_024 	(0x00006460UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_024_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_024_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_024_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_024_V0 	ERC_T_DROPPING_LUT_024_V0_Msk
#define 	ERC_T_DROPPING_LUT_024_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_024_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_024_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_024_V1 	ERC_T_DROPPING_LUT_024_V1_Msk
#define ERC_T_DROPPING_LUT_025 	(0x00006464UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_025_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_025_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_025_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_025_V0 	ERC_T_DROPPING_LUT_025_V0_Msk
#define 	ERC_T_DROPPING_LUT_025_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_025_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_025_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_025_V1 	ERC_T_DROPPING_LUT_025_V1_Msk
#define ERC_T_DROPPING_LUT_026 	(0x00006468UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_026_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_026_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_026_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_026_V0 	ERC_T_DROPPING_LUT_026_V0_Msk
#define 	ERC_T_DROPPING_LUT_026_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_026_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_026_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_026_V1 	ERC_T_DROPPING_LUT_026_V1_Msk
#define ERC_T_DROPPING_LUT_027 	(0x0000646CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_027_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_027_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_027_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_027_V0 	ERC_T_DROPPING_LUT_027_V0_Msk
#define 	ERC_T_DROPPING_LUT_027_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_027_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_027_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_027_V1 	ERC_T_DROPPING_LUT_027_V1_Msk
#define ERC_T_DROPPING_LUT_028 	(0x00006470UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_028_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_028_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_028_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_028_V0 	ERC_T_DROPPING_LUT_028_V0_Msk
#define 	ERC_T_DROPPING_LUT_028_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_028_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_028_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_028_V1 	ERC_T_DROPPING_LUT_028_V1_Msk
#define ERC_T_DROPPING_LUT_029 	(0x00006474UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_029_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_029_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_029_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_029_V0 	ERC_T_DROPPING_LUT_029_V0_Msk
#define 	ERC_T_DROPPING_LUT_029_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_029_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_029_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_029_V1 	ERC_T_DROPPING_LUT_029_V1_Msk
#define ERC_T_DROPPING_LUT_030 	(0x00006478UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_030_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_030_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_030_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_030_V0 	ERC_T_DROPPING_LUT_030_V0_Msk
#define 	ERC_T_DROPPING_LUT_030_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_030_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_030_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_030_V1 	ERC_T_DROPPING_LUT_030_V1_Msk
#define ERC_T_DROPPING_LUT_031 	(0x0000647CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_031_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_031_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_031_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_031_V0 	ERC_T_DROPPING_LUT_031_V0_Msk
#define 	ERC_T_DROPPING_LUT_031_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_031_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_031_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_031_V1 	ERC_T_DROPPING_LUT_031_V1_Msk
#define ERC_T_DROPPING_LUT_032 	(0x00006480UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_032_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_032_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_032_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_032_V0 	ERC_T_DROPPING_LUT_032_V0_Msk
#define 	ERC_T_DROPPING_LUT_032_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_032_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_032_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_032_V1 	ERC_T_DROPPING_LUT_032_V1_Msk
#define ERC_T_DROPPING_LUT_033 	(0x00006484UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_033_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_033_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_033_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_033_V0 	ERC_T_DROPPING_LUT_033_V0_Msk
#define 	ERC_T_DROPPING_LUT_033_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_033_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_033_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_033_V1 	ERC_T_DROPPING_LUT_033_V1_Msk
#define ERC_T_DROPPING_LUT_034 	(0x00006488UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_034_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_034_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_034_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_034_V0 	ERC_T_DROPPING_LUT_034_V0_Msk
#define 	ERC_T_DROPPING_LUT_034_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_034_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_034_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_034_V1 	ERC_T_DROPPING_LUT_034_V1_Msk
#define ERC_T_DROPPING_LUT_035 	(0x0000648CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_035_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_035_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_035_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_035_V0 	ERC_T_DROPPING_LUT_035_V0_Msk
#define 	ERC_T_DROPPING_LUT_035_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_035_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_035_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_035_V1 	ERC_T_DROPPING_LUT_035_V1_Msk
#define ERC_T_DROPPING_LUT_036 	(0x00006490UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_036_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_036_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_036_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_036_V0 	ERC_T_DROPPING_LUT_036_V0_Msk
#define 	ERC_T_DROPPING_LUT_036_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_036_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_036_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_036_V1 	ERC_T_DROPPING_LUT_036_V1_Msk
#define ERC_T_DROPPING_LUT_037 	(0x00006494UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_037_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_037_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_037_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_037_V0 	ERC_T_DROPPING_LUT_037_V0_Msk
#define 	ERC_T_DROPPING_LUT_037_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_037_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_037_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_037_V1 	ERC_T_DROPPING_LUT_037_V1_Msk
#define ERC_T_DROPPING_LUT_038 	(0x00006498UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_038_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_038_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_038_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_038_V0 	ERC_T_DROPPING_LUT_038_V0_Msk
#define 	ERC_T_DROPPING_LUT_038_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_038_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_038_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_038_V1 	ERC_T_DROPPING_LUT_038_V1_Msk
#define ERC_T_DROPPING_LUT_039 	(0x0000649CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_039_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_039_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_039_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_039_V0 	ERC_T_DROPPING_LUT_039_V0_Msk
#define 	ERC_T_DROPPING_LUT_039_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_039_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_039_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_039_V1 	ERC_T_DROPPING_LUT_039_V1_Msk
#define ERC_T_DROPPING_LUT_040 	(0x000064A0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_040_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_040_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_040_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_040_V0 	ERC_T_DROPPING_LUT_040_V0_Msk
#define 	ERC_T_DROPPING_LUT_040_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_040_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_040_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_040_V1 	ERC_T_DROPPING_LUT_040_V1_Msk
#define ERC_T_DROPPING_LUT_041 	(0x000064A4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_041_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_041_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_041_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_041_V0 	ERC_T_DROPPING_LUT_041_V0_Msk
#define 	ERC_T_DROPPING_LUT_041_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_041_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_041_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_041_V1 	ERC_T_DROPPING_LUT_041_V1_Msk
#define ERC_T_DROPPING_LUT_042 	(0x000064A8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_042_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_042_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_042_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_042_V0 	ERC_T_DROPPING_LUT_042_V0_Msk
#define 	ERC_T_DROPPING_LUT_042_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_042_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_042_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_042_V1 	ERC_T_DROPPING_LUT_042_V1_Msk
#define ERC_T_DROPPING_LUT_043 	(0x000064ACUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_043_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_043_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_043_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_043_V0 	ERC_T_DROPPING_LUT_043_V0_Msk
#define 	ERC_T_DROPPING_LUT_043_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_043_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_043_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_043_V1 	ERC_T_DROPPING_LUT_043_V1_Msk
#define ERC_T_DROPPING_LUT_044 	(0x000064B0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_044_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_044_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_044_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_044_V0 	ERC_T_DROPPING_LUT_044_V0_Msk
#define 	ERC_T_DROPPING_LUT_044_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_044_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_044_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_044_V1 	ERC_T_DROPPING_LUT_044_V1_Msk
#define ERC_T_DROPPING_LUT_045 	(0x000064B4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_045_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_045_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_045_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_045_V0 	ERC_T_DROPPING_LUT_045_V0_Msk
#define 	ERC_T_DROPPING_LUT_045_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_045_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_045_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_045_V1 	ERC_T_DROPPING_LUT_045_V1_Msk
#define ERC_T_DROPPING_LUT_046 	(0x000064B8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_046_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_046_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_046_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_046_V0 	ERC_T_DROPPING_LUT_046_V0_Msk
#define 	ERC_T_DROPPING_LUT_046_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_046_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_046_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_046_V1 	ERC_T_DROPPING_LUT_046_V1_Msk
#define ERC_T_DROPPING_LUT_047 	(0x000064BCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_047_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_047_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_047_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_047_V0 	ERC_T_DROPPING_LUT_047_V0_Msk
#define 	ERC_T_DROPPING_LUT_047_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_047_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_047_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_047_V1 	ERC_T_DROPPING_LUT_047_V1_Msk
#define ERC_T_DROPPING_LUT_048 	(0x000064C0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_048_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_048_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_048_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_048_V0 	ERC_T_DROPPING_LUT_048_V0_Msk
#define 	ERC_T_DROPPING_LUT_048_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_048_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_048_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_048_V1 	ERC_T_DROPPING_LUT_048_V1_Msk
#define ERC_T_DROPPING_LUT_049 	(0x000064C4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_049_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_049_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_049_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_049_V0 	ERC_T_DROPPING_LUT_049_V0_Msk
#define 	ERC_T_DROPPING_LUT_049_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_049_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_049_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_049_V1 	ERC_T_DROPPING_LUT_049_V1_Msk
#define ERC_T_DROPPING_LUT_050 	(0x000064C8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_050_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_050_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_050_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_050_V0 	ERC_T_DROPPING_LUT_050_V0_Msk
#define 	ERC_T_DROPPING_LUT_050_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_050_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_050_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_050_V1 	ERC_T_DROPPING_LUT_050_V1_Msk
#define ERC_T_DROPPING_LUT_051 	(0x000064CCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_051_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_051_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_051_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_051_V0 	ERC_T_DROPPING_LUT_051_V0_Msk
#define 	ERC_T_DROPPING_LUT_051_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_051_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_051_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_051_V1 	ERC_T_DROPPING_LUT_051_V1_Msk
#define ERC_T_DROPPING_LUT_052 	(0x000064D0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_052_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_052_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_052_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_052_V0 	ERC_T_DROPPING_LUT_052_V0_Msk
#define 	ERC_T_DROPPING_LUT_052_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_052_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_052_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_052_V1 	ERC_T_DROPPING_LUT_052_V1_Msk
#define ERC_T_DROPPING_LUT_053 	(0x000064D4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_053_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_053_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_053_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_053_V0 	ERC_T_DROPPING_LUT_053_V0_Msk
#define 	ERC_T_DROPPING_LUT_053_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_053_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_053_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_053_V1 	ERC_T_DROPPING_LUT_053_V1_Msk
#define ERC_T_DROPPING_LUT_054 	(0x000064D8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_054_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_054_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_054_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_054_V0 	ERC_T_DROPPING_LUT_054_V0_Msk
#define 	ERC_T_DROPPING_LUT_054_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_054_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_054_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_054_V1 	ERC_T_DROPPING_LUT_054_V1_Msk
#define ERC_T_DROPPING_LUT_055 	(0x000064DCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_055_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_055_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_055_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_055_V0 	ERC_T_DROPPING_LUT_055_V0_Msk
#define 	ERC_T_DROPPING_LUT_055_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_055_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_055_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_055_V1 	ERC_T_DROPPING_LUT_055_V1_Msk
#define ERC_T_DROPPING_LUT_056 	(0x000064E0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_056_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_056_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_056_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_056_V0 	ERC_T_DROPPING_LUT_056_V0_Msk
#define 	ERC_T_DROPPING_LUT_056_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_056_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_056_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_056_V1 	ERC_T_DROPPING_LUT_056_V1_Msk
#define ERC_T_DROPPING_LUT_057 	(0x000064E4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_057_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_057_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_057_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_057_V0 	ERC_T_DROPPING_LUT_057_V0_Msk
#define 	ERC_T_DROPPING_LUT_057_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_057_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_057_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_057_V1 	ERC_T_DROPPING_LUT_057_V1_Msk
#define ERC_T_DROPPING_LUT_058 	(0x000064E8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_058_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_058_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_058_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_058_V0 	ERC_T_DROPPING_LUT_058_V0_Msk
#define 	ERC_T_DROPPING_LUT_058_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_058_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_058_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_058_V1 	ERC_T_DROPPING_LUT_058_V1_Msk
#define ERC_T_DROPPING_LUT_059 	(0x000064ECUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_059_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_059_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_059_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_059_V0 	ERC_T_DROPPING_LUT_059_V0_Msk
#define 	ERC_T_DROPPING_LUT_059_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_059_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_059_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_059_V1 	ERC_T_DROPPING_LUT_059_V1_Msk
#define ERC_T_DROPPING_LUT_060 	(0x000064F0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_060_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_060_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_060_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_060_V0 	ERC_T_DROPPING_LUT_060_V0_Msk
#define 	ERC_T_DROPPING_LUT_060_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_060_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_060_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_060_V1 	ERC_T_DROPPING_LUT_060_V1_Msk
#define ERC_T_DROPPING_LUT_061 	(0x000064F4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_061_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_061_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_061_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_061_V0 	ERC_T_DROPPING_LUT_061_V0_Msk
#define 	ERC_T_DROPPING_LUT_061_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_061_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_061_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_061_V1 	ERC_T_DROPPING_LUT_061_V1_Msk
#define ERC_T_DROPPING_LUT_062 	(0x000064F8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_062_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_062_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_062_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_062_V0 	ERC_T_DROPPING_LUT_062_V0_Msk
#define 	ERC_T_DROPPING_LUT_062_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_062_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_062_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_062_V1 	ERC_T_DROPPING_LUT_062_V1_Msk
#define ERC_T_DROPPING_LUT_063 	(0x000064FCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_063_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_063_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_063_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_063_V0 	ERC_T_DROPPING_LUT_063_V0_Msk
#define 	ERC_T_DROPPING_LUT_063_V1_Pos 	(0x10U)
