jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_T_DROPPING_LUT_063_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_063_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_063_V1 	ERC_T_DROPPING_LUT_063_V1_Msk
#define ERC_T_DROPPING_LUT_064 	(0x00006500UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_064_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_064_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_064_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_064_V0 	ERC_T_DROPPING_LUT_064_V0_Msk
#define 	ERC_T_DROPPING_LUT_064_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_064_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_064_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_064_V1 	ERC_T_DROPPING_LUT_064_V1_Msk
#define ERC_T_DROPPING_LUT_065 	(0x00006504UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_065_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_065_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_065_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_065_V0 	ERC_T_DROPPING_LUT_065_V0_Msk
#define 	ERC_T_DROPPING_LUT_065_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_065_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_065_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_065_V1 	ERC_T_DROPPING_LUT_065_V1_Msk
#define ERC_T_DROPPING_LUT_066 	(0x00006508UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_066_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_066_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_066_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_066_V0 	ERC_T_DROPPING_LUT_066_V0_Msk
#define 	ERC_T_DROPPING_LUT_066_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_066_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_066_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_066_V1 	ERC_T_DROPPING_LUT_066_V1_Msk
#define ERC_T_DROPPING_LUT_067 	(0x0000650CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_067_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_067_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_067_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_067_V0 	ERC_T_DROPPING_LUT_067_V0_Msk
#define 	ERC_T_DROPPING_LUT_067_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_067_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_067_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_067_V1 	ERC_T_DROPPING_LUT_067_V1_Msk
#define ERC_T_DROPPING_LUT_068 	(0x00006510UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_068_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_068_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_068_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_068_V0 	ERC_T_DROPPING_LUT_068_V0_Msk
#define 	ERC_T_DROPPING_LUT_068_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_068_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_068_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_068_V1 	ERC_T_DROPPING_LUT_068_V1_Msk
#define ERC_T_DROPPING_LUT_069 	(0x00006514UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_069_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_069_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_069_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_069_V0 	ERC_T_DROPPING_LUT_069_V0_Msk
#define 	ERC_T_DROPPING_LUT_069_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_069_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_069_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_069_V1 	ERC_T_DROPPING_LUT_069_V1_Msk
#define ERC_T_DROPPING_LUT_070 	(0x00006518UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_070_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_070_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_070_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_070_V0 	ERC_T_DROPPING_LUT_070_V0_Msk
#define 	ERC_T_DROPPING_LUT_070_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_070_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_070_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_070_V1 	ERC_T_DROPPING_LUT_070_V1_Msk
#define ERC_T_DROPPING_LUT_071 	(0x0000651CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_071_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_071_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_071_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_071_V0 	ERC_T_DROPPING_LUT_071_V0_Msk
#define 	ERC_T_DROPPING_LUT_071_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_071_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_071_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_071_V1 	ERC_T_DROPPING_LUT_071_V1_Msk
#define ERC_T_DROPPING_LUT_072 	(0x00006520UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_072_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_072_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_072_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_072_V0 	ERC_T_DROPPING_LUT_072_V0_Msk
#define 	ERC_T_DROPPING_LUT_072_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_072_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_072_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_072_V1 	ERC_T_DROPPING_LUT_072_V1_Msk
#define ERC_T_DROPPING_LUT_073 	(0x00006524UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_073_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_073_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_073_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_073_V0 	ERC_T_DROPPING_LUT_073_V0_Msk
#define 	ERC_T_DROPPING_LUT_073_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_073_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_073_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_073_V1 	ERC_T_DROPPING_LUT_073_V1_Msk
#define ERC_T_DROPPING_LUT_074 	(0x00006528UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_074_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_074_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_074_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_074_V0 	ERC_T_DROPPING_LUT_074_V0_Msk
#define 	ERC_T_DROPPING_LUT_074_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_074_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_074_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_074_V1 	ERC_T_DROPPING_LUT_074_V1_Msk
#define ERC_T_DROPPING_LUT_075 	(0x0000652CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_075_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_075_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_075_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_075_V0 	ERC_T_DROPPING_LUT_075_V0_Msk
#define 	ERC_T_DROPPING_LUT_075_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_075_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_075_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_075_V1 	ERC_T_DROPPING_LUT_075_V1_Msk
#define ERC_T_DROPPING_LUT_076 	(0x00006530UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_076_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_076_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_076_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_076_V0 	ERC_T_DROPPING_LUT_076_V0_Msk
#define 	ERC_T_DROPPING_LUT_076_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_076_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_076_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_076_V1 	ERC_T_DROPPING_LUT_076_V1_Msk
#define ERC_T_DROPPING_LUT_077 	(0x00006534UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_077_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_077_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_077_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_077_V0 	ERC_T_DROPPING_LUT_077_V0_Msk
#define 	ERC_T_DROPPING_LUT_077_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_077_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_077_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_077_V1 	ERC_T_DROPPING_LUT_077_V1_Msk
#define ERC_T_DROPPING_LUT_078 	(0x00006538UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_078_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_078_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_078_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_078_V0 	ERC_T_DROPPING_LUT_078_V0_Msk
#define 	ERC_T_DROPPING_LUT_078_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_078_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_078_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_078_V1 	ERC_T_DROPPING_LUT_078_V1_Msk
#define ERC_T_DROPPING_LUT_079 	(0x0000653CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_079_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_079_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_079_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_079_V0 	ERC_T_DROPPING_LUT_079_V0_Msk
#define 	ERC_T_DROPPING_LUT_079_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_079_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_079_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_079_V1 	ERC_T_DROPPING_LUT_079_V1_Msk
#define ERC_T_DROPPING_LUT_080 	(0x00006540UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_080_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_080_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_080_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_080_V0 	ERC_T_DROPPING_LUT_080_V0_Msk
#define 	ERC_T_DROPPING_LUT_080_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_080_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_080_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_080_V1 	ERC_T_DROPPING_LUT_080_V1_Msk
#define ERC_T_DROPPING_LUT_081 	(0x00006544UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_081_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_081_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_081_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_081_V0 	ERC_T_DROPPING_LUT_081_V0_Msk
#define 	ERC_T_DROPPING_LUT_081_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_081_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_081_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_081_V1 	ERC_T_DROPPING_LUT_081_V1_Msk
#define ERC_T_DROPPING_LUT_082 	(0x00006548UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_082_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_082_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_082_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_082_V0 	ERC_T_DROPPING_LUT_082_V0_Msk
#define 	ERC_T_DROPPING_LUT_082_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_082_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_082_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_082_V1 	ERC_T_DROPPING_LUT_082_V1_Msk
#define ERC_T_DROPPING_LUT_083 	(0x0000654CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_083_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_083_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_083_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_083_V0 	ERC_T_DROPPING_LUT_083_V0_Msk
#define 	ERC_T_DROPPING_LUT_083_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_083_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_083_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_083_V1 	ERC_T_DROPPING_LUT_083_V1_Msk
#define ERC_T_DROPPING_LUT_084 	(0x00006550UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_084_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_084_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_084_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_084_V0 	ERC_T_DROPPING_LUT_084_V0_Msk
#define 	ERC_T_DROPPING_LUT_084_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_084_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_084_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_084_V1 	ERC_T_DROPPING_LUT_084_V1_Msk
#define ERC_T_DROPPING_LUT_085 	(0x00006554UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_085_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_085_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_085_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_085_V0 	ERC_T_DROPPING_LUT_085_V0_Msk
#define 	ERC_T_DROPPING_LUT_085_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_085_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_085_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_085_V1 	ERC_T_DROPPING_LUT_085_V1_Msk
#define ERC_T_DROPPING_LUT_086 	(0x00006558UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_086_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_086_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_086_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_086_V0 	ERC_T_DROPPING_LUT_086_V0_Msk
#define 	ERC_T_DROPPING_LUT_086_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_086_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_086_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_086_V1 	ERC_T_DROPPING_LUT_086_V1_Msk
#define ERC_T_DROPPING_LUT_087 	(0x0000655CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_087_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_087_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_087_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_087_V0 	ERC_T_DROPPING_LUT_087_V0_Msk
#define 	ERC_T_DROPPING_LUT_087_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_087_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_087_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_087_V1 	ERC_T_DROPPING_LUT_087_V1_Msk
#define ERC_T_DROPPING_LUT_088 	(0x00006560UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_088_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_088_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_088_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_088_V0 	ERC_T_DROPPING_LUT_088_V0_Msk
#define 	ERC_T_DROPPING_LUT_088_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_088_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_088_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_088_V1 	ERC_T_DROPPING_LUT_088_V1_Msk
#define ERC_T_DROPPING_LUT_089 	(0x00006564UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_089_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_089_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_089_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_089_V0 	ERC_T_DROPPING_LUT_089_V0_Msk
#define 	ERC_T_DROPPING_LUT_089_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_089_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_089_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_089_V1 	ERC_T_DROPPING_LUT_089_V1_Msk
#define ERC_T_DROPPING_LUT_090 	(0x00006568UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_090_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_090_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_090_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_090_V0 	ERC_T_DROPPING_LUT_090_V0_Msk
#define 	ERC_T_DROPPING_LUT_090_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_090_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_090_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_090_V1 	ERC_T_DROPPING_LUT_090_V1_Msk
#define ERC_T_DROPPING_LUT_091 	(0x0000656CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_091_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_091_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_091_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_091_V0 	ERC_T_DROPPING_LUT_091_V0_Msk
#define 	ERC_T_DROPPING_LUT_091_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_091_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_091_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_091_V1 	ERC_T_DROPPING_LUT_091_V1_Msk
#define ERC_T_DROPPING_LUT_092 	(0x00006570UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_092_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_092_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_092_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_092_V0 	ERC_T_DROPPING_LUT_092_V0_Msk
#define 	ERC_T_DROPPING_LUT_092_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_092_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_092_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_092_V1 	ERC_T_DROPPING_LUT_092_V1_Msk
#define ERC_T_DROPPING_LUT_093 	(0x00006574UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_093_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_093_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_093_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_093_V0 	ERC_T_DROPPING_LUT_093_V0_Msk
#define 	ERC_T_DROPPING_LUT_093_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_093_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_093_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_093_V1 	ERC_T_DROPPING_LUT_093_V1_Msk
#define ERC_T_DROPPING_LUT_094 	(0x00006578UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_094_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_094_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_094_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_094_V0 	ERC_T_DROPPING_LUT_094_V0_Msk
#define 	ERC_T_DROPPING_LUT_094_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_094_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_094_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_094_V1 	ERC_T_DROPPING_LUT_094_V1_Msk
#define ERC_T_DROPPING_LUT_095 	(0x0000657CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_095_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_095_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_095_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_095_V0 	ERC_T_DROPPING_LUT_095_V0_Msk
#define 	ERC_T_DROPPING_LUT_095_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_095_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_095_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_095_V1 	ERC_T_DROPPING_LUT_095_V1_Msk
#define ERC_T_DROPPING_LUT_096 	(0x00006580UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_096_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_096_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_096_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_096_V0 	ERC_T_DROPPING_LUT_096_V0_Msk
#define 	ERC_T_DROPPING_LUT_096_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_096_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_096_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_096_V1 	ERC_T_DROPPING_LUT_096_V1_Msk
#define ERC_T_DROPPING_LUT_097 	(0x00006584UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_097_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_097_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_097_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_097_V0 	ERC_T_DROPPING_LUT_097_V0_Msk
#define 	ERC_T_DROPPING_LUT_097_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_097_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_097_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_097_V1 	ERC_T_DROPPING_LUT_097_V1_Msk
#define ERC_T_DROPPING_LUT_098 	(0x00006588UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_098_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_098_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_098_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_098_V0 	ERC_T_DROPPING_LUT_098_V0_Msk
#define 	ERC_T_DROPPING_LUT_098_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_098_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_098_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_098_V1 	ERC_T_DROPPING_LUT_098_V1_Msk
#define ERC_T_DROPPING_LUT_099 	(0x0000658CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_099_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_099_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_099_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_099_V0 	ERC_T_DROPPING_LUT_099_V0_Msk
#define 	ERC_T_DROPPING_LUT_099_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_099_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_099_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_099_V1 	ERC_T_DROPPING_LUT_099_V1_Msk
#define ERC_T_DROPPING_LUT_100 	(0x00006590UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_100_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_100_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_100_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_100_V0 	ERC_T_DROPPING_LUT_100_V0_Msk
#define 	ERC_T_DROPPING_LUT_100_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_100_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_100_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_100_V1 	ERC_T_DROPPING_LUT_100_V1_Msk
#define ERC_T_DROPPING_LUT_101 	(0x00006594UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_101_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_101_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_101_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_101_V0 	ERC_T_DROPPING_LUT_101_V0_Msk
#define 	ERC_T_DROPPING_LUT_101_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_101_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_101_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_101_V1 	ERC_T_DROPPING_LUT_101_V1_Msk
#define ERC_T_DROPPING_LUT_102 	(0x00006598UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_102_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_102_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_102_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_102_V0 	ERC_T_DROPPING_LUT_102_V0_Msk
#define 	ERC_T_DROPPING_LUT_102_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_102_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_102_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_102_V1 	ERC_T_DROPPING_LUT_102_V1_Msk
#define ERC_T_DROPPING_LUT_103 	(0x0000659CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_103_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_103_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_103_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_103_V0 	ERC_T_DROPPING_LUT_103_V0_Msk
#define 	ERC_T_DROPPING_LUT_103_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_103_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_103_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_103_V1 	ERC_T_DROPPING_LUT_103_V1_Msk
#define ERC_T_DROPPING_LUT_104 	(0x000065A0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_104_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_104_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_104_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_104_V0 	ERC_T_DROPPING_LUT_104_V0_Msk
#define 	ERC_T_DROPPING_LUT_104_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_104_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_104_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_104_V1 	ERC_T_DROPPING_LUT_104_V1_Msk
#define ERC_T_DROPPING_LUT_105 	(0x000065A4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_105_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_105_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_105_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_105_V0 	ERC_T_DROPPING_LUT_105_V0_Msk
#define 	ERC_T_DROPPING_LUT_105_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_105_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_105_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_105_V1 	ERC_T_DROPPING_LUT_105_V1_Msk
#define ERC_T_DROPPING_LUT_106 	(0x000065A8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_106_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_106_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_106_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_106_V0 	ERC_T_DROPPING_LUT_106_V0_Msk
#define 	ERC_T_DROPPING_LUT_106_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_106_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_106_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_106_V1 	ERC_T_DROPPING_LUT_106_V1_Msk
#define ERC_T_DROPPING_LUT_107 	(0x000065ACUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_107_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_107_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_107_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_107_V0 	ERC_T_DROPPING_LUT_107_V0_Msk
#define 	ERC_T_DROPPING_LUT_107_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_107_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_107_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_107_V1 	ERC_T_DROPPING_LUT_107_V1_Msk
#define ERC_T_DROPPING_LUT_108 	(0x000065B0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_108_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_108_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_108_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_108_V0 	ERC_T_DROPPING_LUT_108_V0_Msk
#define 	ERC_T_DROPPING_LUT_108_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_108_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_108_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_108_V1 	ERC_T_DROPPING_LUT_108_V1_Msk
#define ERC_T_DROPPING_LUT_109 	(0x000065B4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_109_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_109_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_109_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_109_V0 	ERC_T_DROPPING_LUT_109_V0_Msk
#define 	ERC_T_DROPPING_LUT_109_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_109_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_109_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_109_V1 	ERC_T_DROPPING_LUT_109_V1_Msk
#define ERC_T_DROPPING_LUT_110 	(0x000065B8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_110_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_110_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_110_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_110_V0 	ERC_T_DROPPING_LUT_110_V0_Msk
#define 	ERC_T_DROPPING_LUT_110_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_110_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_110_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_110_V1 	ERC_T_DROPPING_LUT_110_V1_Msk
#define ERC_T_DROPPING_LUT_111 	(0x000065BCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_111_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_111_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_111_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_111_V0 	ERC_T_DROPPING_LUT_111_V0_Msk
#define 	ERC_T_DROPPING_LUT_111_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_111_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_111_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_111_V1 	ERC_T_DROPPING_LUT_111_V1_Msk
#define ERC_T_DROPPING_LUT_112 	(0x000065C0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_112_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_112_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_112_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_112_V0 	ERC_T_DROPPING_LUT_112_V0_Msk
