jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_T_DROPPING_LUT_112_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_112_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_112_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_112_V1 	ERC_T_DROPPING_LUT_112_V1_Msk
#define ERC_T_DROPPING_LUT_113 	(0x000065C4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_113_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_113_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_113_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_113_V0 	ERC_T_DROPPING_LUT_113_V0_Msk
#define 	ERC_T_DROPPING_LUT_113_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_113_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_113_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_113_V1 	ERC_T_DROPPING_LUT_113_V1_Msk
#define ERC_T_DROPPING_LUT_114 	(0x000065C8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_114_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_114_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_114_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_114_V0 	ERC_T_DROPPING_LUT_114_V0_Msk
#define 	ERC_T_DROPPING_LUT_114_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_114_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_114_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_114_V1 	ERC_T_DROPPING_LUT_114_V1_Msk
#define ERC_T_DROPPING_LUT_115 	(0x000065CCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_115_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_115_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_115_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_115_V0 	ERC_T_DROPPING_LUT_115_V0_Msk
#define 	ERC_T_DROPPING_LUT_115_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_115_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_115_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_115_V1 	ERC_T_DROPPING_LUT_115_V1_Msk
#define ERC_T_DROPPING_LUT_116 	(0x000065D0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_116_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_116_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_116_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_116_V0 	ERC_T_DROPPING_LUT_116_V0_Msk
#define 	ERC_T_DROPPING_LUT_116_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_116_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_116_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_116_V1 	ERC_T_DROPPING_LUT_116_V1_Msk
#define ERC_T_DROPPING_LUT_117 	(0x000065D4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_117_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_117_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_117_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_117_V0 	ERC_T_DROPPING_LUT_117_V0_Msk
#define 	ERC_T_DROPPING_LUT_117_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_117_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_117_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_117_V1 	ERC_T_DROPPING_LUT_117_V1_Msk
#define ERC_T_DROPPING_LUT_118 	(0x000065D8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_118_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_118_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_118_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_118_V0 	ERC_T_DROPPING_LUT_118_V0_Msk
#define 	ERC_T_DROPPING_LUT_118_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_118_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_118_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_118_V1 	ERC_T_DROPPING_LUT_118_V1_Msk
#define ERC_T_DROPPING_LUT_119 	(0x000065DCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_119_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_119_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_119_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_119_V0 	ERC_T_DROPPING_LUT_119_V0_Msk
#define 	ERC_T_DROPPING_LUT_119_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_119_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_119_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_119_V1 	ERC_T_DROPPING_LUT_119_V1_Msk
#define ERC_T_DROPPING_LUT_120 	(0x000065E0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_120_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_120_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_120_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_120_V0 	ERC_T_DROPPING_LUT_120_V0_Msk
#define 	ERC_T_DROPPING_LUT_120_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_120_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_120_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_120_V1 	ERC_T_DROPPING_LUT_120_V1_Msk
#define ERC_T_DROPPING_LUT_121 	(0x000065E4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_121_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_121_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_121_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_121_V0 	ERC_T_DROPPING_LUT_121_V0_Msk
#define 	ERC_T_DROPPING_LUT_121_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_121_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_121_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_121_V1 	ERC_T_DROPPING_LUT_121_V1_Msk
#define ERC_T_DROPPING_LUT_122 	(0x000065E8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_122_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_122_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_122_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_122_V0 	ERC_T_DROPPING_LUT_122_V0_Msk
#define 	ERC_T_DROPPING_LUT_122_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_122_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_122_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_122_V1 	ERC_T_DROPPING_LUT_122_V1_Msk
#define ERC_T_DROPPING_LUT_123 	(0x000065ECUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_123_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_123_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_123_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_123_V0 	ERC_T_DROPPING_LUT_123_V0_Msk
#define 	ERC_T_DROPPING_LUT_123_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_123_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_123_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_123_V1 	ERC_T_DROPPING_LUT_123_V1_Msk
#define ERC_T_DROPPING_LUT_124 	(0x000065F0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_124_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_124_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_124_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_124_V0 	ERC_T_DROPPING_LUT_124_V0_Msk
#define 	ERC_T_DROPPING_LUT_124_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_124_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_124_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_124_V1 	ERC_T_DROPPING_LUT_124_V1_Msk
#define ERC_T_DROPPING_LUT_125 	(0x000065F4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_125_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_125_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_125_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_125_V0 	ERC_T_DROPPING_LUT_125_V0_Msk
#define 	ERC_T_DROPPING_LUT_125_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_125_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_125_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_125_V1 	ERC_T_DROPPING_LUT_125_V1_Msk
#define ERC_T_DROPPING_LUT_126 	(0x000065F8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_126_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_126_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_126_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_126_V0 	ERC_T_DROPPING_LUT_126_V0_Msk
#define 	ERC_T_DROPPING_LUT_126_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_126_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_126_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_126_V1 	ERC_T_DROPPING_LUT_126_V1_Msk
#define ERC_T_DROPPING_LUT_127 	(0x000065FCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_127_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_127_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_127_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_127_V0 	ERC_T_DROPPING_LUT_127_V0_Msk
#define 	ERC_T_DROPPING_LUT_127_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_127_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_127_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_127_V1 	ERC_T_DROPPING_LUT_127_V1_Msk
#define ERC_T_DROPPING_LUT_128 	(0x00006600UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_128_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_128_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_128_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_128_V0 	ERC_T_DROPPING_LUT_128_V0_Msk
#define 	ERC_T_DROPPING_LUT_128_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_128_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_128_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_128_V1 	ERC_T_DROPPING_LUT_128_V1_Msk
#define ERC_T_DROPPING_LUT_129 	(0x00006604UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_129_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_129_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_129_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_129_V0 	ERC_T_DROPPING_LUT_129_V0_Msk
#define 	ERC_T_DROPPING_LUT_129_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_129_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_129_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_129_V1 	ERC_T_DROPPING_LUT_129_V1_Msk
#define ERC_T_DROPPING_LUT_130 	(0x00006608UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_130_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_130_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_130_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_130_V0 	ERC_T_DROPPING_LUT_130_V0_Msk
#define 	ERC_T_DROPPING_LUT_130_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_130_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_130_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_130_V1 	ERC_T_DROPPING_LUT_130_V1_Msk
#define ERC_T_DROPPING_LUT_131 	(0x0000660CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_131_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_131_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_131_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_131_V0 	ERC_T_DROPPING_LUT_131_V0_Msk
#define 	ERC_T_DROPPING_LUT_131_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_131_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_131_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_131_V1 	ERC_T_DROPPING_LUT_131_V1_Msk
#define ERC_T_DROPPING_LUT_132 	(0x00006610UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_132_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_132_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_132_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_132_V0 	ERC_T_DROPPING_LUT_132_V0_Msk
#define 	ERC_T_DROPPING_LUT_132_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_132_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_132_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_132_V1 	ERC_T_DROPPING_LUT_132_V1_Msk
#define ERC_T_DROPPING_LUT_133 	(0x00006614UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_133_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_133_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_133_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_133_V0 	ERC_T_DROPPING_LUT_133_V0_Msk
#define 	ERC_T_DROPPING_LUT_133_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_133_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_133_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_133_V1 	ERC_T_DROPPING_LUT_133_V1_Msk
#define ERC_T_DROPPING_LUT_134 	(0x00006618UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_134_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_134_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_134_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_134_V0 	ERC_T_DROPPING_LUT_134_V0_Msk
#define 	ERC_T_DROPPING_LUT_134_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_134_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_134_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_134_V1 	ERC_T_DROPPING_LUT_134_V1_Msk
#define ERC_T_DROPPING_LUT_135 	(0x0000661CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_135_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_135_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_135_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_135_V0 	ERC_T_DROPPING_LUT_135_V0_Msk
#define 	ERC_T_DROPPING_LUT_135_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_135_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_135_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_135_V1 	ERC_T_DROPPING_LUT_135_V1_Msk
#define ERC_T_DROPPING_LUT_136 	(0x00006620UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_136_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_136_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_136_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_136_V0 	ERC_T_DROPPING_LUT_136_V0_Msk
#define 	ERC_T_DROPPING_LUT_136_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_136_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_136_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_136_V1 	ERC_T_DROPPING_LUT_136_V1_Msk
#define ERC_T_DROPPING_LUT_137 	(0x00006624UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_137_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_137_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_137_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_137_V0 	ERC_T_DROPPING_LUT_137_V0_Msk
#define 	ERC_T_DROPPING_LUT_137_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_137_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_137_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_137_V1 	ERC_T_DROPPING_LUT_137_V1_Msk
#define ERC_T_DROPPING_LUT_138 	(0x00006628UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_138_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_138_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_138_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_138_V0 	ERC_T_DROPPING_LUT_138_V0_Msk
#define 	ERC_T_DROPPING_LUT_138_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_138_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_138_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_138_V1 	ERC_T_DROPPING_LUT_138_V1_Msk
#define ERC_T_DROPPING_LUT_139 	(0x0000662CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_139_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_139_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_139_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_139_V0 	ERC_T_DROPPING_LUT_139_V0_Msk
#define 	ERC_T_DROPPING_LUT_139_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_139_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_139_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_139_V1 	ERC_T_DROPPING_LUT_139_V1_Msk
#define ERC_T_DROPPING_LUT_140 	(0x00006630UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_140_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_140_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_140_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_140_V0 	ERC_T_DROPPING_LUT_140_V0_Msk
#define 	ERC_T_DROPPING_LUT_140_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_140_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_140_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_140_V1 	ERC_T_DROPPING_LUT_140_V1_Msk
#define ERC_T_DROPPING_LUT_141 	(0x00006634UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_141_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_141_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_141_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_141_V0 	ERC_T_DROPPING_LUT_141_V0_Msk
#define 	ERC_T_DROPPING_LUT_141_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_141_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_141_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_141_V1 	ERC_T_DROPPING_LUT_141_V1_Msk
#define ERC_T_DROPPING_LUT_142 	(0x00006638UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_142_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_142_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_142_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_142_V0 	ERC_T_DROPPING_LUT_142_V0_Msk
#define 	ERC_T_DROPPING_LUT_142_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_142_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_142_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_142_V1 	ERC_T_DROPPING_LUT_142_V1_Msk
#define ERC_T_DROPPING_LUT_143 	(0x0000663CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_143_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_143_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_143_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_143_V0 	ERC_T_DROPPING_LUT_143_V0_Msk
#define 	ERC_T_DROPPING_LUT_143_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_143_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_143_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_143_V1 	ERC_T_DROPPING_LUT_143_V1_Msk
#define ERC_T_DROPPING_LUT_144 	(0x00006640UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_144_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_144_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_144_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_144_V0 	ERC_T_DROPPING_LUT_144_V0_Msk
#define 	ERC_T_DROPPING_LUT_144_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_144_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_144_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_144_V1 	ERC_T_DROPPING_LUT_144_V1_Msk
#define ERC_T_DROPPING_LUT_145 	(0x00006644UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_145_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_145_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_145_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_145_V0 	ERC_T_DROPPING_LUT_145_V0_Msk
#define 	ERC_T_DROPPING_LUT_145_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_145_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_145_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_145_V1 	ERC_T_DROPPING_LUT_145_V1_Msk
#define ERC_T_DROPPING_LUT_146 	(0x00006648UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_146_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_146_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_146_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_146_V0 	ERC_T_DROPPING_LUT_146_V0_Msk
#define 	ERC_T_DROPPING_LUT_146_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_146_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_146_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_146_V1 	ERC_T_DROPPING_LUT_146_V1_Msk
#define ERC_T_DROPPING_LUT_147 	(0x0000664CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_147_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_147_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_147_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_147_V0 	ERC_T_DROPPING_LUT_147_V0_Msk
#define 	ERC_T_DROPPING_LUT_147_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_147_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_147_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_147_V1 	ERC_T_DROPPING_LUT_147_V1_Msk
#define ERC_T_DROPPING_LUT_148 	(0x00006650UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_148_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_148_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_148_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_148_V0 	ERC_T_DROPPING_LUT_148_V0_Msk
#define 	ERC_T_DROPPING_LUT_148_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_148_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_148_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_148_V1 	ERC_T_DROPPING_LUT_148_V1_Msk
#define ERC_T_DROPPING_LUT_149 	(0x00006654UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_149_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_149_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_149_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_149_V0 	ERC_T_DROPPING_LUT_149_V0_Msk
#define 	ERC_T_DROPPING_LUT_149_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_149_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_149_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_149_V1 	ERC_T_DROPPING_LUT_149_V1_Msk
#define ERC_T_DROPPING_LUT_150 	(0x00006658UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_150_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_150_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_150_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_150_V0 	ERC_T_DROPPING_LUT_150_V0_Msk
#define 	ERC_T_DROPPING_LUT_150_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_150_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_150_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_150_V1 	ERC_T_DROPPING_LUT_150_V1_Msk
#define ERC_T_DROPPING_LUT_151 	(0x0000665CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_151_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_151_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_151_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_151_V0 	ERC_T_DROPPING_LUT_151_V0_Msk
#define 	ERC_T_DROPPING_LUT_151_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_151_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_151_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_151_V1 	ERC_T_DROPPING_LUT_151_V1_Msk
#define ERC_T_DROPPING_LUT_152 	(0x00006660UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_152_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_152_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_152_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_152_V0 	ERC_T_DROPPING_LUT_152_V0_Msk
#define 	ERC_T_DROPPING_LUT_152_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_152_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_152_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_152_V1 	ERC_T_DROPPING_LUT_152_V1_Msk
#define ERC_T_DROPPING_LUT_153 	(0x00006664UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_153_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_153_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_153_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_153_V0 	ERC_T_DROPPING_LUT_153_V0_Msk
#define 	ERC_T_DROPPING_LUT_153_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_153_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_153_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_153_V1 	ERC_T_DROPPING_LUT_153_V1_Msk
#define ERC_T_DROPPING_LUT_154 	(0x00006668UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_154_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_154_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_154_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_154_V0 	ERC_T_DROPPING_LUT_154_V0_Msk
#define 	ERC_T_DROPPING_LUT_154_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_154_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_154_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_154_V1 	ERC_T_DROPPING_LUT_154_V1_Msk
#define ERC_T_DROPPING_LUT_155 	(0x0000666CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_155_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_155_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_155_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_155_V0 	ERC_T_DROPPING_LUT_155_V0_Msk
#define 	ERC_T_DROPPING_LUT_155_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_155_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_155_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_155_V1 	ERC_T_DROPPING_LUT_155_V1_Msk
#define ERC_T_DROPPING_LUT_156 	(0x00006670UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_156_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_156_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_156_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_156_V0 	ERC_T_DROPPING_LUT_156_V0_Msk
#define 	ERC_T_DROPPING_LUT_156_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_156_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_156_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_156_V1 	ERC_T_DROPPING_LUT_156_V1_Msk
#define ERC_T_DROPPING_LUT_157 	(0x00006674UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_157_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_157_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_157_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_157_V0 	ERC_T_DROPPING_LUT_157_V0_Msk
#define 	ERC_T_DROPPING_LUT_157_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_157_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_157_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_157_V1 	ERC_T_DROPPING_LUT_157_V1_Msk
#define ERC_T_DROPPING_LUT_158 	(0x00006678UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_158_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_158_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_158_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_158_V0 	ERC_T_DROPPING_LUT_158_V0_Msk
#define 	ERC_T_DROPPING_LUT_158_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_158_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_158_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_158_V1 	ERC_T_DROPPING_LUT_158_V1_Msk
#define ERC_T_DROPPING_LUT_159 	(0x0000667CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_159_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_159_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_159_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_159_V0 	ERC_T_DROPPING_LUT_159_V0_Msk
#define 	ERC_T_DROPPING_LUT_159_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_159_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_159_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_159_V1 	ERC_T_DROPPING_LUT_159_V1_Msk
#define ERC_T_DROPPING_LUT_160 	(0x00006680UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_160_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_160_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_160_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_160_V0 	ERC_T_DROPPING_LUT_160_V0_Msk
#define 	ERC_T_DROPPING_LUT_160_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_160_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_160_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_160_V1 	ERC_T_DROPPING_LUT_160_V1_Msk
#define ERC_T_DROPPING_LUT_161 	(0x00006684UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_161_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_161_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_161_V0_Pos) 	/*!< 0x000001FF */
