jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_T_DROPPING_LUT_161_V0 	ERC_T_DROPPING_LUT_161_V0_Msk
#define 	ERC_T_DROPPING_LUT_161_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_161_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_161_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_161_V1 	ERC_T_DROPPING_LUT_161_V1_Msk
#define ERC_T_DROPPING_LUT_162 	(0x00006688UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_162_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_162_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_162_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_162_V0 	ERC_T_DROPPING_LUT_162_V0_Msk
#define 	ERC_T_DROPPING_LUT_162_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_162_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_162_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_162_V1 	ERC_T_DROPPING_LUT_162_V1_Msk
#define ERC_T_DROPPING_LUT_163 	(0x0000668CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_163_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_163_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_163_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_163_V0 	ERC_T_DROPPING_LUT_163_V0_Msk
#define 	ERC_T_DROPPING_LUT_163_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_163_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_163_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_163_V1 	ERC_T_DROPPING_LUT_163_V1_Msk
#define ERC_T_DROPPING_LUT_164 	(0x00006690UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_164_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_164_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_164_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_164_V0 	ERC_T_DROPPING_LUT_164_V0_Msk
#define 	ERC_T_DROPPING_LUT_164_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_164_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_164_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_164_V1 	ERC_T_DROPPING_LUT_164_V1_Msk
#define ERC_T_DROPPING_LUT_165 	(0x00006694UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_165_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_165_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_165_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_165_V0 	ERC_T_DROPPING_LUT_165_V0_Msk
#define 	ERC_T_DROPPING_LUT_165_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_165_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_165_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_165_V1 	ERC_T_DROPPING_LUT_165_V1_Msk
#define ERC_T_DROPPING_LUT_166 	(0x00006698UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_166_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_166_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_166_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_166_V0 	ERC_T_DROPPING_LUT_166_V0_Msk
#define 	ERC_T_DROPPING_LUT_166_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_166_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_166_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_166_V1 	ERC_T_DROPPING_LUT_166_V1_Msk
#define ERC_T_DROPPING_LUT_167 	(0x0000669CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_167_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_167_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_167_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_167_V0 	ERC_T_DROPPING_LUT_167_V0_Msk
#define 	ERC_T_DROPPING_LUT_167_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_167_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_167_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_167_V1 	ERC_T_DROPPING_LUT_167_V1_Msk
#define ERC_T_DROPPING_LUT_168 	(0x000066A0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_168_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_168_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_168_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_168_V0 	ERC_T_DROPPING_LUT_168_V0_Msk
#define 	ERC_T_DROPPING_LUT_168_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_168_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_168_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_168_V1 	ERC_T_DROPPING_LUT_168_V1_Msk
#define ERC_T_DROPPING_LUT_169 	(0x000066A4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_169_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_169_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_169_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_169_V0 	ERC_T_DROPPING_LUT_169_V0_Msk
#define 	ERC_T_DROPPING_LUT_169_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_169_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_169_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_169_V1 	ERC_T_DROPPING_LUT_169_V1_Msk
#define ERC_T_DROPPING_LUT_170 	(0x000066A8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_170_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_170_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_170_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_170_V0 	ERC_T_DROPPING_LUT_170_V0_Msk
#define 	ERC_T_DROPPING_LUT_170_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_170_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_170_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_170_V1 	ERC_T_DROPPING_LUT_170_V1_Msk
#define ERC_T_DROPPING_LUT_171 	(0x000066ACUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_171_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_171_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_171_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_171_V0 	ERC_T_DROPPING_LUT_171_V0_Msk
#define 	ERC_T_DROPPING_LUT_171_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_171_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_171_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_171_V1 	ERC_T_DROPPING_LUT_171_V1_Msk
#define ERC_T_DROPPING_LUT_172 	(0x000066B0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_172_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_172_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_172_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_172_V0 	ERC_T_DROPPING_LUT_172_V0_Msk
#define 	ERC_T_DROPPING_LUT_172_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_172_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_172_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_172_V1 	ERC_T_DROPPING_LUT_172_V1_Msk
#define ERC_T_DROPPING_LUT_173 	(0x000066B4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_173_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_173_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_173_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_173_V0 	ERC_T_DROPPING_LUT_173_V0_Msk
#define 	ERC_T_DROPPING_LUT_173_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_173_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_173_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_173_V1 	ERC_T_DROPPING_LUT_173_V1_Msk
#define ERC_T_DROPPING_LUT_174 	(0x000066B8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_174_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_174_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_174_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_174_V0 	ERC_T_DROPPING_LUT_174_V0_Msk
#define 	ERC_T_DROPPING_LUT_174_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_174_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_174_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_174_V1 	ERC_T_DROPPING_LUT_174_V1_Msk
#define ERC_T_DROPPING_LUT_175 	(0x000066BCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_175_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_175_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_175_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_175_V0 	ERC_T_DROPPING_LUT_175_V0_Msk
#define 	ERC_T_DROPPING_LUT_175_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_175_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_175_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_175_V1 	ERC_T_DROPPING_LUT_175_V1_Msk
#define ERC_T_DROPPING_LUT_176 	(0x000066C0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_176_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_176_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_176_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_176_V0 	ERC_T_DROPPING_LUT_176_V0_Msk
#define 	ERC_T_DROPPING_LUT_176_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_176_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_176_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_176_V1 	ERC_T_DROPPING_LUT_176_V1_Msk
#define ERC_T_DROPPING_LUT_177 	(0x000066C4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_177_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_177_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_177_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_177_V0 	ERC_T_DROPPING_LUT_177_V0_Msk
#define 	ERC_T_DROPPING_LUT_177_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_177_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_177_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_177_V1 	ERC_T_DROPPING_LUT_177_V1_Msk
#define ERC_T_DROPPING_LUT_178 	(0x000066C8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_178_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_178_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_178_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_178_V0 	ERC_T_DROPPING_LUT_178_V0_Msk
#define 	ERC_T_DROPPING_LUT_178_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_178_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_178_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_178_V1 	ERC_T_DROPPING_LUT_178_V1_Msk
#define ERC_T_DROPPING_LUT_179 	(0x000066CCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_179_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_179_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_179_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_179_V0 	ERC_T_DROPPING_LUT_179_V0_Msk
#define 	ERC_T_DROPPING_LUT_179_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_179_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_179_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_179_V1 	ERC_T_DROPPING_LUT_179_V1_Msk
#define ERC_T_DROPPING_LUT_180 	(0x000066D0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_180_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_180_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_180_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_180_V0 	ERC_T_DROPPING_LUT_180_V0_Msk
#define 	ERC_T_DROPPING_LUT_180_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_180_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_180_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_180_V1 	ERC_T_DROPPING_LUT_180_V1_Msk
#define ERC_T_DROPPING_LUT_181 	(0x000066D4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_181_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_181_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_181_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_181_V0 	ERC_T_DROPPING_LUT_181_V0_Msk
#define 	ERC_T_DROPPING_LUT_181_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_181_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_181_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_181_V1 	ERC_T_DROPPING_LUT_181_V1_Msk
#define ERC_T_DROPPING_LUT_182 	(0x000066D8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_182_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_182_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_182_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_182_V0 	ERC_T_DROPPING_LUT_182_V0_Msk
#define 	ERC_T_DROPPING_LUT_182_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_182_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_182_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_182_V1 	ERC_T_DROPPING_LUT_182_V1_Msk
#define ERC_T_DROPPING_LUT_183 	(0x000066DCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_183_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_183_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_183_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_183_V0 	ERC_T_DROPPING_LUT_183_V0_Msk
#define 	ERC_T_DROPPING_LUT_183_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_183_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_183_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_183_V1 	ERC_T_DROPPING_LUT_183_V1_Msk
#define ERC_T_DROPPING_LUT_184 	(0x000066E0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_184_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_184_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_184_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_184_V0 	ERC_T_DROPPING_LUT_184_V0_Msk
#define 	ERC_T_DROPPING_LUT_184_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_184_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_184_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_184_V1 	ERC_T_DROPPING_LUT_184_V1_Msk
#define ERC_T_DROPPING_LUT_185 	(0x000066E4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_185_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_185_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_185_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_185_V0 	ERC_T_DROPPING_LUT_185_V0_Msk
#define 	ERC_T_DROPPING_LUT_185_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_185_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_185_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_185_V1 	ERC_T_DROPPING_LUT_185_V1_Msk
#define ERC_T_DROPPING_LUT_186 	(0x000066E8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_186_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_186_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_186_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_186_V0 	ERC_T_DROPPING_LUT_186_V0_Msk
#define 	ERC_T_DROPPING_LUT_186_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_186_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_186_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_186_V1 	ERC_T_DROPPING_LUT_186_V1_Msk
#define ERC_T_DROPPING_LUT_187 	(0x000066ECUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_187_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_187_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_187_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_187_V0 	ERC_T_DROPPING_LUT_187_V0_Msk
#define 	ERC_T_DROPPING_LUT_187_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_187_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_187_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_187_V1 	ERC_T_DROPPING_LUT_187_V1_Msk
#define ERC_T_DROPPING_LUT_188 	(0x000066F0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_188_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_188_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_188_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_188_V0 	ERC_T_DROPPING_LUT_188_V0_Msk
#define 	ERC_T_DROPPING_LUT_188_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_188_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_188_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_188_V1 	ERC_T_DROPPING_LUT_188_V1_Msk
#define ERC_T_DROPPING_LUT_189 	(0x000066F4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_189_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_189_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_189_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_189_V0 	ERC_T_DROPPING_LUT_189_V0_Msk
#define 	ERC_T_DROPPING_LUT_189_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_189_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_189_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_189_V1 	ERC_T_DROPPING_LUT_189_V1_Msk
#define ERC_T_DROPPING_LUT_190 	(0x000066F8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_190_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_190_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_190_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_190_V0 	ERC_T_DROPPING_LUT_190_V0_Msk
#define 	ERC_T_DROPPING_LUT_190_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_190_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_190_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_190_V1 	ERC_T_DROPPING_LUT_190_V1_Msk
#define ERC_T_DROPPING_LUT_191 	(0x000066FCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_191_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_191_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_191_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_191_V0 	ERC_T_DROPPING_LUT_191_V0_Msk
#define 	ERC_T_DROPPING_LUT_191_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_191_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_191_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_191_V1 	ERC_T_DROPPING_LUT_191_V1_Msk
#define ERC_T_DROPPING_LUT_192 	(0x00006700UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_192_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_192_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_192_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_192_V0 	ERC_T_DROPPING_LUT_192_V0_Msk
#define 	ERC_T_DROPPING_LUT_192_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_192_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_192_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_192_V1 	ERC_T_DROPPING_LUT_192_V1_Msk
#define ERC_T_DROPPING_LUT_193 	(0x00006704UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_193_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_193_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_193_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_193_V0 	ERC_T_DROPPING_LUT_193_V0_Msk
#define 	ERC_T_DROPPING_LUT_193_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_193_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_193_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_193_V1 	ERC_T_DROPPING_LUT_193_V1_Msk
#define ERC_T_DROPPING_LUT_194 	(0x00006708UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_194_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_194_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_194_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_194_V0 	ERC_T_DROPPING_LUT_194_V0_Msk
#define 	ERC_T_DROPPING_LUT_194_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_194_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_194_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_194_V1 	ERC_T_DROPPING_LUT_194_V1_Msk
#define ERC_T_DROPPING_LUT_195 	(0x0000670CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_195_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_195_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_195_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_195_V0 	ERC_T_DROPPING_LUT_195_V0_Msk
#define 	ERC_T_DROPPING_LUT_195_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_195_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_195_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_195_V1 	ERC_T_DROPPING_LUT_195_V1_Msk
#define ERC_T_DROPPING_LUT_196 	(0x00006710UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_196_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_196_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_196_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_196_V0 	ERC_T_DROPPING_LUT_196_V0_Msk
#define 	ERC_T_DROPPING_LUT_196_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_196_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_196_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_196_V1 	ERC_T_DROPPING_LUT_196_V1_Msk
#define ERC_T_DROPPING_LUT_197 	(0x00006714UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_197_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_197_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_197_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_197_V0 	ERC_T_DROPPING_LUT_197_V0_Msk
#define 	ERC_T_DROPPING_LUT_197_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_197_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_197_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_197_V1 	ERC_T_DROPPING_LUT_197_V1_Msk
#define ERC_T_DROPPING_LUT_198 	(0x00006718UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_198_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_198_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_198_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_198_V0 	ERC_T_DROPPING_LUT_198_V0_Msk
#define 	ERC_T_DROPPING_LUT_198_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_198_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_198_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_198_V1 	ERC_T_DROPPING_LUT_198_V1_Msk
#define ERC_T_DROPPING_LUT_199 	(0x0000671CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_199_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_199_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_199_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_199_V0 	ERC_T_DROPPING_LUT_199_V0_Msk
#define 	ERC_T_DROPPING_LUT_199_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_199_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_199_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_199_V1 	ERC_T_DROPPING_LUT_199_V1_Msk
#define ERC_T_DROPPING_LUT_200 	(0x00006720UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_200_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_200_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_200_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_200_V0 	ERC_T_DROPPING_LUT_200_V0_Msk
#define 	ERC_T_DROPPING_LUT_200_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_200_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_200_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_200_V1 	ERC_T_DROPPING_LUT_200_V1_Msk
#define ERC_T_DROPPING_LUT_201 	(0x00006724UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_201_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_201_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_201_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_201_V0 	ERC_T_DROPPING_LUT_201_V0_Msk
#define 	ERC_T_DROPPING_LUT_201_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_201_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_201_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_201_V1 	ERC_T_DROPPING_LUT_201_V1_Msk
#define ERC_T_DROPPING_LUT_202 	(0x00006728UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_202_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_202_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_202_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_202_V0 	ERC_T_DROPPING_LUT_202_V0_Msk
#define 	ERC_T_DROPPING_LUT_202_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_202_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_202_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_202_V1 	ERC_T_DROPPING_LUT_202_V1_Msk
#define ERC_T_DROPPING_LUT_203 	(0x0000672CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_203_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_203_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_203_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_203_V0 	ERC_T_DROPPING_LUT_203_V0_Msk
#define 	ERC_T_DROPPING_LUT_203_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_203_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_203_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_203_V1 	ERC_T_DROPPING_LUT_203_V1_Msk
#define ERC_T_DROPPING_LUT_204 	(0x00006730UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_204_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_204_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_204_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_204_V0 	ERC_T_DROPPING_LUT_204_V0_Msk
#define 	ERC_T_DROPPING_LUT_204_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_204_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_204_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_204_V1 	ERC_T_DROPPING_LUT_204_V1_Msk
#define ERC_T_DROPPING_LUT_205 	(0x00006734UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_205_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_205_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_205_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_205_V0 	ERC_T_DROPPING_LUT_205_V0_Msk
#define 	ERC_T_DROPPING_LUT_205_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_205_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_205_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_205_V1 	ERC_T_DROPPING_LUT_205_V1_Msk
#define ERC_T_DROPPING_LUT_206 	(0x00006738UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_206_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_206_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_206_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_206_V0 	ERC_T_DROPPING_LUT_206_V0_Msk
#define 	ERC_T_DROPPING_LUT_206_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_206_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_206_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_206_V1 	ERC_T_DROPPING_LUT_206_V1_Msk
#define ERC_T_DROPPING_LUT_207 	(0x0000673CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_207_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_207_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_207_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_207_V0 	ERC_T_DROPPING_LUT_207_V0_Msk
#define 	ERC_T_DROPPING_LUT_207_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_207_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_207_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_207_V1 	ERC_T_DROPPING_LUT_207_V1_Msk
#define ERC_T_DROPPING_LUT_208 	(0x00006740UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_208_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_208_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_208_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_208_V0 	ERC_T_DROPPING_LUT_208_V0_Msk
#define 	ERC_T_DROPPING_LUT_208_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_208_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_208_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_208_V1 	ERC_T_DROPPING_LUT_208_V1_Msk
#define ERC_T_DROPPING_LUT_209 	(0x00006744UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_209_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_209_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_209_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_209_V0 	ERC_T_DROPPING_LUT_209_V0_Msk
#define 	ERC_T_DROPPING_LUT_209_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_209_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_209_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_209_V1 	ERC_T_DROPPING_LUT_209_V1_Msk
#define ERC_T_DROPPING_LUT_210 	(0x00006748UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_210_V0_Pos 	(0x0U)
