jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_T_DROPPING_LUT_210_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_210_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_210_V0 	ERC_T_DROPPING_LUT_210_V0_Msk
#define 	ERC_T_DROPPING_LUT_210_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_210_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_210_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_210_V1 	ERC_T_DROPPING_LUT_210_V1_Msk
#define ERC_T_DROPPING_LUT_211 	(0x0000674CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_211_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_211_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_211_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_211_V0 	ERC_T_DROPPING_LUT_211_V0_Msk
#define 	ERC_T_DROPPING_LUT_211_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_211_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_211_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_211_V1 	ERC_T_DROPPING_LUT_211_V1_Msk
#define ERC_T_DROPPING_LUT_212 	(0x00006750UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_212_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_212_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_212_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_212_V0 	ERC_T_DROPPING_LUT_212_V0_Msk
#define 	ERC_T_DROPPING_LUT_212_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_212_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_212_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_212_V1 	ERC_T_DROPPING_LUT_212_V1_Msk
#define ERC_T_DROPPING_LUT_213 	(0x00006754UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_213_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_213_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_213_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_213_V0 	ERC_T_DROPPING_LUT_213_V0_Msk
#define 	ERC_T_DROPPING_LUT_213_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_213_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_213_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_213_V1 	ERC_T_DROPPING_LUT_213_V1_Msk
#define ERC_T_DROPPING_LUT_214 	(0x00006758UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_214_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_214_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_214_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_214_V0 	ERC_T_DROPPING_LUT_214_V0_Msk
#define 	ERC_T_DROPPING_LUT_214_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_214_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_214_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_214_V1 	ERC_T_DROPPING_LUT_214_V1_Msk
#define ERC_T_DROPPING_LUT_215 	(0x0000675CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_215_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_215_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_215_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_215_V0 	ERC_T_DROPPING_LUT_215_V0_Msk
#define 	ERC_T_DROPPING_LUT_215_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_215_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_215_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_215_V1 	ERC_T_DROPPING_LUT_215_V1_Msk
#define ERC_T_DROPPING_LUT_216 	(0x00006760UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_216_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_216_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_216_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_216_V0 	ERC_T_DROPPING_LUT_216_V0_Msk
#define 	ERC_T_DROPPING_LUT_216_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_216_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_216_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_216_V1 	ERC_T_DROPPING_LUT_216_V1_Msk
#define ERC_T_DROPPING_LUT_217 	(0x00006764UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_217_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_217_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_217_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_217_V0 	ERC_T_DROPPING_LUT_217_V0_Msk
#define 	ERC_T_DROPPING_LUT_217_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_217_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_217_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_217_V1 	ERC_T_DROPPING_LUT_217_V1_Msk
#define ERC_T_DROPPING_LUT_218 	(0x00006768UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_218_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_218_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_218_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_218_V0 	ERC_T_DROPPING_LUT_218_V0_Msk
#define 	ERC_T_DROPPING_LUT_218_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_218_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_218_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_218_V1 	ERC_T_DROPPING_LUT_218_V1_Msk
#define ERC_T_DROPPING_LUT_219 	(0x0000676CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_219_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_219_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_219_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_219_V0 	ERC_T_DROPPING_LUT_219_V0_Msk
#define 	ERC_T_DROPPING_LUT_219_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_219_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_219_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_219_V1 	ERC_T_DROPPING_LUT_219_V1_Msk
#define ERC_T_DROPPING_LUT_220 	(0x00006770UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_220_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_220_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_220_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_220_V0 	ERC_T_DROPPING_LUT_220_V0_Msk
#define 	ERC_T_DROPPING_LUT_220_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_220_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_220_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_220_V1 	ERC_T_DROPPING_LUT_220_V1_Msk
#define ERC_T_DROPPING_LUT_221 	(0x00006774UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_221_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_221_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_221_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_221_V0 	ERC_T_DROPPING_LUT_221_V0_Msk
#define 	ERC_T_DROPPING_LUT_221_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_221_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_221_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_221_V1 	ERC_T_DROPPING_LUT_221_V1_Msk
#define ERC_T_DROPPING_LUT_222 	(0x00006778UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_222_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_222_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_222_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_222_V0 	ERC_T_DROPPING_LUT_222_V0_Msk
#define 	ERC_T_DROPPING_LUT_222_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_222_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_222_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_222_V1 	ERC_T_DROPPING_LUT_222_V1_Msk
#define ERC_T_DROPPING_LUT_223 	(0x0000677CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_223_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_223_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_223_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_223_V0 	ERC_T_DROPPING_LUT_223_V0_Msk
#define 	ERC_T_DROPPING_LUT_223_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_223_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_223_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_223_V1 	ERC_T_DROPPING_LUT_223_V1_Msk
#define ERC_T_DROPPING_LUT_224 	(0x00006780UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_224_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_224_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_224_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_224_V0 	ERC_T_DROPPING_LUT_224_V0_Msk
#define 	ERC_T_DROPPING_LUT_224_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_224_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_224_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_224_V1 	ERC_T_DROPPING_LUT_224_V1_Msk
#define ERC_T_DROPPING_LUT_225 	(0x00006784UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_225_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_225_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_225_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_225_V0 	ERC_T_DROPPING_LUT_225_V0_Msk
#define 	ERC_T_DROPPING_LUT_225_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_225_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_225_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_225_V1 	ERC_T_DROPPING_LUT_225_V1_Msk
#define ERC_T_DROPPING_LUT_226 	(0x00006788UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_226_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_226_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_226_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_226_V0 	ERC_T_DROPPING_LUT_226_V0_Msk
#define 	ERC_T_DROPPING_LUT_226_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_226_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_226_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_226_V1 	ERC_T_DROPPING_LUT_226_V1_Msk
#define ERC_T_DROPPING_LUT_227 	(0x0000678CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_227_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_227_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_227_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_227_V0 	ERC_T_DROPPING_LUT_227_V0_Msk
#define 	ERC_T_DROPPING_LUT_227_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_227_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_227_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_227_V1 	ERC_T_DROPPING_LUT_227_V1_Msk
#define ERC_T_DROPPING_LUT_228 	(0x00006790UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_228_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_228_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_228_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_228_V0 	ERC_T_DROPPING_LUT_228_V0_Msk
#define 	ERC_T_DROPPING_LUT_228_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_228_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_228_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_228_V1 	ERC_T_DROPPING_LUT_228_V1_Msk
#define ERC_T_DROPPING_LUT_229 	(0x00006794UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_229_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_229_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_229_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_229_V0 	ERC_T_DROPPING_LUT_229_V0_Msk
#define 	ERC_T_DROPPING_LUT_229_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_229_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_229_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_229_V1 	ERC_T_DROPPING_LUT_229_V1_Msk
#define ERC_T_DROPPING_LUT_230 	(0x00006798UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_230_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_230_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_230_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_230_V0 	ERC_T_DROPPING_LUT_230_V0_Msk
#define 	ERC_T_DROPPING_LUT_230_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_230_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_230_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_230_V1 	ERC_T_DROPPING_LUT_230_V1_Msk
#define ERC_T_DROPPING_LUT_231 	(0x0000679CUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_231_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_231_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_231_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_231_V0 	ERC_T_DROPPING_LUT_231_V0_Msk
#define 	ERC_T_DROPPING_LUT_231_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_231_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_231_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_231_V1 	ERC_T_DROPPING_LUT_231_V1_Msk
#define ERC_T_DROPPING_LUT_232 	(0x000067A0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_232_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_232_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_232_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_232_V0 	ERC_T_DROPPING_LUT_232_V0_Msk
#define 	ERC_T_DROPPING_LUT_232_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_232_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_232_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_232_V1 	ERC_T_DROPPING_LUT_232_V1_Msk
#define ERC_T_DROPPING_LUT_233 	(0x000067A4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_233_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_233_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_233_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_233_V0 	ERC_T_DROPPING_LUT_233_V0_Msk
#define 	ERC_T_DROPPING_LUT_233_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_233_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_233_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_233_V1 	ERC_T_DROPPING_LUT_233_V1_Msk
#define ERC_T_DROPPING_LUT_234 	(0x000067A8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_234_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_234_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_234_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_234_V0 	ERC_T_DROPPING_LUT_234_V0_Msk
#define 	ERC_T_DROPPING_LUT_234_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_234_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_234_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_234_V1 	ERC_T_DROPPING_LUT_234_V1_Msk
#define ERC_T_DROPPING_LUT_235 	(0x000067ACUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_235_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_235_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_235_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_235_V0 	ERC_T_DROPPING_LUT_235_V0_Msk
#define 	ERC_T_DROPPING_LUT_235_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_235_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_235_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_235_V1 	ERC_T_DROPPING_LUT_235_V1_Msk
#define ERC_T_DROPPING_LUT_236 	(0x000067B0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_236_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_236_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_236_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_236_V0 	ERC_T_DROPPING_LUT_236_V0_Msk
#define 	ERC_T_DROPPING_LUT_236_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_236_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_236_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_236_V1 	ERC_T_DROPPING_LUT_236_V1_Msk
#define ERC_T_DROPPING_LUT_237 	(0x000067B4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_237_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_237_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_237_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_237_V0 	ERC_T_DROPPING_LUT_237_V0_Msk
#define 	ERC_T_DROPPING_LUT_237_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_237_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_237_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_237_V1 	ERC_T_DROPPING_LUT_237_V1_Msk
#define ERC_T_DROPPING_LUT_238 	(0x000067B8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_238_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_238_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_238_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_238_V0 	ERC_T_DROPPING_LUT_238_V0_Msk
#define 	ERC_T_DROPPING_LUT_238_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_238_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_238_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_238_V1 	ERC_T_DROPPING_LUT_238_V1_Msk
#define ERC_T_DROPPING_LUT_239 	(0x000067BCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_239_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_239_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_239_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_239_V0 	ERC_T_DROPPING_LUT_239_V0_Msk
#define 	ERC_T_DROPPING_LUT_239_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_239_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_239_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_239_V1 	ERC_T_DROPPING_LUT_239_V1_Msk
#define ERC_T_DROPPING_LUT_240 	(0x000067C0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_240_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_240_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_240_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_240_V0 	ERC_T_DROPPING_LUT_240_V0_Msk
#define 	ERC_T_DROPPING_LUT_240_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_240_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_240_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_240_V1 	ERC_T_DROPPING_LUT_240_V1_Msk
#define ERC_T_DROPPING_LUT_241 	(0x000067C4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_241_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_241_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_241_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_241_V0 	ERC_T_DROPPING_LUT_241_V0_Msk
#define 	ERC_T_DROPPING_LUT_241_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_241_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_241_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_241_V1 	ERC_T_DROPPING_LUT_241_V1_Msk
#define ERC_T_DROPPING_LUT_242 	(0x000067C8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_242_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_242_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_242_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_242_V0 	ERC_T_DROPPING_LUT_242_V0_Msk
#define 	ERC_T_DROPPING_LUT_242_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_242_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_242_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_242_V1 	ERC_T_DROPPING_LUT_242_V1_Msk
#define ERC_T_DROPPING_LUT_243 	(0x000067CCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_243_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_243_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_243_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_243_V0 	ERC_T_DROPPING_LUT_243_V0_Msk
#define 	ERC_T_DROPPING_LUT_243_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_243_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_243_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_243_V1 	ERC_T_DROPPING_LUT_243_V1_Msk
#define ERC_T_DROPPING_LUT_244 	(0x000067D0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_244_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_244_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_244_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_244_V0 	ERC_T_DROPPING_LUT_244_V0_Msk
#define 	ERC_T_DROPPING_LUT_244_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_244_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_244_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_244_V1 	ERC_T_DROPPING_LUT_244_V1_Msk
#define ERC_T_DROPPING_LUT_245 	(0x000067D4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_245_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_245_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_245_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_245_V0 	ERC_T_DROPPING_LUT_245_V0_Msk
#define 	ERC_T_DROPPING_LUT_245_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_245_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_245_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_245_V1 	ERC_T_DROPPING_LUT_245_V1_Msk
#define ERC_T_DROPPING_LUT_246 	(0x000067D8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_246_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_246_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_246_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_246_V0 	ERC_T_DROPPING_LUT_246_V0_Msk
#define 	ERC_T_DROPPING_LUT_246_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_246_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_246_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_246_V1 	ERC_T_DROPPING_LUT_246_V1_Msk
#define ERC_T_DROPPING_LUT_247 	(0x000067DCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_247_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_247_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_247_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_247_V0 	ERC_T_DROPPING_LUT_247_V0_Msk
#define 	ERC_T_DROPPING_LUT_247_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_247_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_247_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_247_V1 	ERC_T_DROPPING_LUT_247_V1_Msk
#define ERC_T_DROPPING_LUT_248 	(0x000067E0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_248_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_248_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_248_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_248_V0 	ERC_T_DROPPING_LUT_248_V0_Msk
#define 	ERC_T_DROPPING_LUT_248_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_248_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_248_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_248_V1 	ERC_T_DROPPING_LUT_248_V1_Msk
#define ERC_T_DROPPING_LUT_249 	(0x000067E4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_249_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_249_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_249_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_249_V0 	ERC_T_DROPPING_LUT_249_V0_Msk
#define 	ERC_T_DROPPING_LUT_249_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_249_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_249_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_249_V1 	ERC_T_DROPPING_LUT_249_V1_Msk
#define ERC_T_DROPPING_LUT_250 	(0x000067E8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_250_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_250_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_250_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_250_V0 	ERC_T_DROPPING_LUT_250_V0_Msk
#define 	ERC_T_DROPPING_LUT_250_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_250_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_250_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_250_V1 	ERC_T_DROPPING_LUT_250_V1_Msk
#define ERC_T_DROPPING_LUT_251 	(0x000067ECUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_251_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_251_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_251_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_251_V0 	ERC_T_DROPPING_LUT_251_V0_Msk
#define 	ERC_T_DROPPING_LUT_251_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_251_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_251_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_251_V1 	ERC_T_DROPPING_LUT_251_V1_Msk
#define ERC_T_DROPPING_LUT_252 	(0x000067F0UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_252_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_252_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_252_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_252_V0 	ERC_T_DROPPING_LUT_252_V0_Msk
#define 	ERC_T_DROPPING_LUT_252_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_252_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_252_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_252_V1 	ERC_T_DROPPING_LUT_252_V1_Msk
#define ERC_T_DROPPING_LUT_253 	(0x000067F4UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_253_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_253_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_253_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_253_V0 	ERC_T_DROPPING_LUT_253_V0_Msk
#define 	ERC_T_DROPPING_LUT_253_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_253_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_253_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_253_V1 	ERC_T_DROPPING_LUT_253_V1_Msk
#define ERC_T_DROPPING_LUT_254 	(0x000067F8UL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_254_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_254_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_254_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_254_V0 	ERC_T_DROPPING_LUT_254_V0_Msk
#define 	ERC_T_DROPPING_LUT_254_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_254_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_254_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_254_V1 	ERC_T_DROPPING_LUT_254_V1_Msk
#define ERC_T_DROPPING_LUT_255 	(0x000067FCUL) 	/*<!  */
#define 	ERC_T_DROPPING_LUT_255_V0_Pos 	(0x0U)
#define 	ERC_T_DROPPING_LUT_255_V0_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_255_V0_Pos) 	/*!< 0x000001FF */
#define 	ERC_T_DROPPING_LUT_255_V0 	ERC_T_DROPPING_LUT_255_V0_Msk
#define 	ERC_T_DROPPING_LUT_255_V1_Pos 	(0x10U)
#define 	ERC_T_DROPPING_LUT_255_V1_Msk 	(0x1FFUL << ERC_T_DROPPING_LUT_255_V1_Pos) 	/*!< 0x01FF0000 */
#define 	ERC_T_DROPPING_LUT_255_V1 	ERC_T_DROPPING_LUT_255_V1_Msk
#define ERC_PONG_DROP_INTLEVEL_000 	(0x00006800UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_000_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_000_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_000_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_000_V0 	ERC_PONG_DROP_INTLEVEL_000_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_000_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_000_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_000_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_000_V1 	ERC_PONG_DROP_INTLEVEL_000_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_000_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_000_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_000_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_000_V2 	ERC_PONG_DROP_INTLEVEL_000_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_000_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_000_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_000_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_000_V3 	ERC_PONG_DROP_INTLEVEL_000_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_000_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_000_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_000_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_000_V4 	ERC_PONG_DROP_INTLEVEL_000_V4_Msk
#define ERC_PING_DROP_INTLEVEL_000 	(0x00006800UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
