jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_PING_DROP_INTLEVEL_000_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_000_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_000_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_000_V0 	ERC_PING_DROP_INTLEVEL_000_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_000_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_000_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_000_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_000_V1 	ERC_PING_DROP_INTLEVEL_000_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_000_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_000_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_000_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_000_V2 	ERC_PING_DROP_INTLEVEL_000_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_000_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_000_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_000_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_000_V3 	ERC_PING_DROP_INTLEVEL_000_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_000_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_000_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_000_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_000_V4 	ERC_PING_DROP_INTLEVEL_000_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_001 	(0x00006804UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_001_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_001_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_001_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_001_V0 	ERC_PONG_DROP_INTLEVEL_001_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_001_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_001_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_001_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_001_V1 	ERC_PONG_DROP_INTLEVEL_001_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_001_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_001_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_001_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_001_V2 	ERC_PONG_DROP_INTLEVEL_001_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_001_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_001_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_001_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_001_V3 	ERC_PONG_DROP_INTLEVEL_001_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_001_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_001_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_001_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_001_V4 	ERC_PONG_DROP_INTLEVEL_001_V4_Msk
#define ERC_PING_DROP_INTLEVEL_001 	(0x00006804UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_001_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_001_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_001_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_001_V0 	ERC_PING_DROP_INTLEVEL_001_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_001_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_001_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_001_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_001_V1 	ERC_PING_DROP_INTLEVEL_001_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_001_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_001_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_001_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_001_V2 	ERC_PING_DROP_INTLEVEL_001_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_001_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_001_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_001_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_001_V3 	ERC_PING_DROP_INTLEVEL_001_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_001_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_001_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_001_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_001_V4 	ERC_PING_DROP_INTLEVEL_001_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_002 	(0x00006808UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_002_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_002_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_002_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_002_V0 	ERC_PONG_DROP_INTLEVEL_002_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_002_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_002_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_002_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_002_V1 	ERC_PONG_DROP_INTLEVEL_002_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_002_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_002_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_002_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_002_V2 	ERC_PONG_DROP_INTLEVEL_002_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_002_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_002_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_002_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_002_V3 	ERC_PONG_DROP_INTLEVEL_002_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_002_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_002_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_002_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_002_V4 	ERC_PONG_DROP_INTLEVEL_002_V4_Msk
#define ERC_PING_DROP_INTLEVEL_002 	(0x00006808UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_002_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_002_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_002_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_002_V0 	ERC_PING_DROP_INTLEVEL_002_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_002_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_002_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_002_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_002_V1 	ERC_PING_DROP_INTLEVEL_002_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_002_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_002_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_002_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_002_V2 	ERC_PING_DROP_INTLEVEL_002_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_002_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_002_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_002_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_002_V3 	ERC_PING_DROP_INTLEVEL_002_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_002_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_002_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_002_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_002_V4 	ERC_PING_DROP_INTLEVEL_002_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_003 	(0x0000680CUL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_003_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_003_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_003_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_003_V0 	ERC_PONG_DROP_INTLEVEL_003_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_003_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_003_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_003_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_003_V1 	ERC_PONG_DROP_INTLEVEL_003_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_003_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_003_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_003_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_003_V2 	ERC_PONG_DROP_INTLEVEL_003_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_003_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_003_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_003_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_003_V3 	ERC_PONG_DROP_INTLEVEL_003_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_003_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_003_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_003_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_003_V4 	ERC_PONG_DROP_INTLEVEL_003_V4_Msk
#define ERC_PING_DROP_INTLEVEL_003 	(0x0000680CUL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_003_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_003_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_003_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_003_V0 	ERC_PING_DROP_INTLEVEL_003_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_003_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_003_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_003_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_003_V1 	ERC_PING_DROP_INTLEVEL_003_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_003_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_003_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_003_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_003_V2 	ERC_PING_DROP_INTLEVEL_003_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_003_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_003_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_003_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_003_V3 	ERC_PING_DROP_INTLEVEL_003_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_003_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_003_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_003_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_003_V4 	ERC_PING_DROP_INTLEVEL_003_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_004 	(0x00006810UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_004_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_004_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_004_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_004_V0 	ERC_PONG_DROP_INTLEVEL_004_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_004_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_004_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_004_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_004_V1 	ERC_PONG_DROP_INTLEVEL_004_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_004_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_004_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_004_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_004_V2 	ERC_PONG_DROP_INTLEVEL_004_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_004_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_004_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_004_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_004_V3 	ERC_PONG_DROP_INTLEVEL_004_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_004_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_004_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_004_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_004_V4 	ERC_PONG_DROP_INTLEVEL_004_V4_Msk
#define ERC_PING_DROP_INTLEVEL_004 	(0x00006810UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_004_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_004_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_004_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_004_V0 	ERC_PING_DROP_INTLEVEL_004_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_004_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_004_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_004_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_004_V1 	ERC_PING_DROP_INTLEVEL_004_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_004_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_004_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_004_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_004_V2 	ERC_PING_DROP_INTLEVEL_004_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_004_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_004_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_004_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_004_V3 	ERC_PING_DROP_INTLEVEL_004_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_004_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_004_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_004_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_004_V4 	ERC_PING_DROP_INTLEVEL_004_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_005 	(0x00006814UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_005_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_005_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_005_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_005_V0 	ERC_PONG_DROP_INTLEVEL_005_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_005_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_005_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_005_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_005_V1 	ERC_PONG_DROP_INTLEVEL_005_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_005_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_005_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_005_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_005_V2 	ERC_PONG_DROP_INTLEVEL_005_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_005_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_005_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_005_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_005_V3 	ERC_PONG_DROP_INTLEVEL_005_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_005_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_005_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_005_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_005_V4 	ERC_PONG_DROP_INTLEVEL_005_V4_Msk
#define ERC_PING_DROP_INTLEVEL_005 	(0x00006814UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_005_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_005_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_005_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_005_V0 	ERC_PING_DROP_INTLEVEL_005_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_005_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_005_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_005_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_005_V1 	ERC_PING_DROP_INTLEVEL_005_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_005_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_005_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_005_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_005_V2 	ERC_PING_DROP_INTLEVEL_005_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_005_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_005_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_005_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_005_V3 	ERC_PING_DROP_INTLEVEL_005_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_005_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_005_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_005_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_005_V4 	ERC_PING_DROP_INTLEVEL_005_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_006 	(0x00006818UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_006_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_006_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_006_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_006_V0 	ERC_PONG_DROP_INTLEVEL_006_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_006_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_006_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_006_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_006_V1 	ERC_PONG_DROP_INTLEVEL_006_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_006_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_006_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_006_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_006_V2 	ERC_PONG_DROP_INTLEVEL_006_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_006_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_006_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_006_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_006_V3 	ERC_PONG_DROP_INTLEVEL_006_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_006_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_006_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_006_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_006_V4 	ERC_PONG_DROP_INTLEVEL_006_V4_Msk
#define ERC_PING_DROP_INTLEVEL_006 	(0x00006818UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_006_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_006_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_006_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_006_V0 	ERC_PING_DROP_INTLEVEL_006_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_006_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_006_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_006_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_006_V1 	ERC_PING_DROP_INTLEVEL_006_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_006_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_006_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_006_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_006_V2 	ERC_PING_DROP_INTLEVEL_006_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_006_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_006_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_006_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_006_V3 	ERC_PING_DROP_INTLEVEL_006_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_006_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_006_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_006_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_006_V4 	ERC_PING_DROP_INTLEVEL_006_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_007 	(0x0000681CUL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_007_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_007_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_007_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_007_V0 	ERC_PONG_DROP_INTLEVEL_007_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_007_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_007_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_007_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_007_V1 	ERC_PONG_DROP_INTLEVEL_007_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_007_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_007_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_007_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_007_V2 	ERC_PONG_DROP_INTLEVEL_007_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_007_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_007_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_007_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_007_V3 	ERC_PONG_DROP_INTLEVEL_007_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_007_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_007_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_007_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_007_V4 	ERC_PONG_DROP_INTLEVEL_007_V4_Msk
#define ERC_PING_DROP_INTLEVEL_007 	(0x0000681CUL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_007_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_007_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_007_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_007_V0 	ERC_PING_DROP_INTLEVEL_007_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_007_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_007_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_007_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_007_V1 	ERC_PING_DROP_INTLEVEL_007_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_007_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_007_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_007_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_007_V2 	ERC_PING_DROP_INTLEVEL_007_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_007_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_007_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_007_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_007_V3 	ERC_PING_DROP_INTLEVEL_007_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_007_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_007_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_007_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_007_V4 	ERC_PING_DROP_INTLEVEL_007_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_008 	(0x00006820UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_008_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_008_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_008_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_008_V0 	ERC_PONG_DROP_INTLEVEL_008_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_008_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_008_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_008_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_008_V1 	ERC_PONG_DROP_INTLEVEL_008_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_008_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_008_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_008_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_008_V2 	ERC_PONG_DROP_INTLEVEL_008_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_008_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_008_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_008_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_008_V3 	ERC_PONG_DROP_INTLEVEL_008_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_008_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_008_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_008_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_008_V4 	ERC_PONG_DROP_INTLEVEL_008_V4_Msk
#define ERC_PING_DROP_INTLEVEL_008 	(0x00006820UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_008_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_008_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_008_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_008_V0 	ERC_PING_DROP_INTLEVEL_008_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_008_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_008_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_008_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_008_V1 	ERC_PING_DROP_INTLEVEL_008_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_008_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_008_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_008_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_008_V2 	ERC_PING_DROP_INTLEVEL_008_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_008_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_008_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_008_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_008_V3 	ERC_PING_DROP_INTLEVEL_008_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_008_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_008_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_008_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_008_V4 	ERC_PING_DROP_INTLEVEL_008_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_009 	(0x00006824UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_009_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_009_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_009_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_009_V0 	ERC_PONG_DROP_INTLEVEL_009_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_009_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_009_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_009_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_009_V1 	ERC_PONG_DROP_INTLEVEL_009_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_009_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_009_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_009_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_009_V2 	ERC_PONG_DROP_INTLEVEL_009_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_009_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_009_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_009_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_009_V3 	ERC_PONG_DROP_INTLEVEL_009_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_009_V4_Pos 	(0x10U)
