jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_PONG_DROP_INTLEVEL_009_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_009_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_009_V4 	ERC_PONG_DROP_INTLEVEL_009_V4_Msk
#define ERC_PING_DROP_INTLEVEL_009 	(0x00006824UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_009_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_009_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_009_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_009_V0 	ERC_PING_DROP_INTLEVEL_009_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_009_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_009_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_009_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_009_V1 	ERC_PING_DROP_INTLEVEL_009_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_009_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_009_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_009_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_009_V2 	ERC_PING_DROP_INTLEVEL_009_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_009_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_009_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_009_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_009_V3 	ERC_PING_DROP_INTLEVEL_009_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_009_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_009_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_009_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_009_V4 	ERC_PING_DROP_INTLEVEL_009_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_010 	(0x00006828UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_010_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_010_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_010_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_010_V0 	ERC_PONG_DROP_INTLEVEL_010_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_010_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_010_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_010_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_010_V1 	ERC_PONG_DROP_INTLEVEL_010_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_010_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_010_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_010_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_010_V2 	ERC_PONG_DROP_INTLEVEL_010_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_010_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_010_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_010_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_010_V3 	ERC_PONG_DROP_INTLEVEL_010_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_010_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_010_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_010_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_010_V4 	ERC_PONG_DROP_INTLEVEL_010_V4_Msk
#define ERC_PING_DROP_INTLEVEL_010 	(0x00006828UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_010_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_010_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_010_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_010_V0 	ERC_PING_DROP_INTLEVEL_010_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_010_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_010_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_010_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_010_V1 	ERC_PING_DROP_INTLEVEL_010_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_010_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_010_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_010_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_010_V2 	ERC_PING_DROP_INTLEVEL_010_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_010_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_010_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_010_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_010_V3 	ERC_PING_DROP_INTLEVEL_010_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_010_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_010_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_010_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_010_V4 	ERC_PING_DROP_INTLEVEL_010_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_011 	(0x0000682CUL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_011_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_011_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_011_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_011_V0 	ERC_PONG_DROP_INTLEVEL_011_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_011_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_011_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_011_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_011_V1 	ERC_PONG_DROP_INTLEVEL_011_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_011_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_011_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_011_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_011_V2 	ERC_PONG_DROP_INTLEVEL_011_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_011_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_011_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_011_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_011_V3 	ERC_PONG_DROP_INTLEVEL_011_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_011_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_011_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_011_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_011_V4 	ERC_PONG_DROP_INTLEVEL_011_V4_Msk
#define ERC_PING_DROP_INTLEVEL_011 	(0x0000682CUL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_011_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_011_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_011_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_011_V0 	ERC_PING_DROP_INTLEVEL_011_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_011_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_011_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_011_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_011_V1 	ERC_PING_DROP_INTLEVEL_011_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_011_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_011_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_011_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_011_V2 	ERC_PING_DROP_INTLEVEL_011_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_011_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_011_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_011_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_011_V3 	ERC_PING_DROP_INTLEVEL_011_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_011_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_011_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_011_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_011_V4 	ERC_PING_DROP_INTLEVEL_011_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_012 	(0x00006830UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_012_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_012_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_012_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_012_V0 	ERC_PONG_DROP_INTLEVEL_012_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_012_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_012_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_012_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_012_V1 	ERC_PONG_DROP_INTLEVEL_012_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_012_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_012_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_012_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_012_V2 	ERC_PONG_DROP_INTLEVEL_012_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_012_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_012_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_012_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_012_V3 	ERC_PONG_DROP_INTLEVEL_012_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_012_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_012_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_012_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_012_V4 	ERC_PONG_DROP_INTLEVEL_012_V4_Msk
#define ERC_PING_DROP_INTLEVEL_012 	(0x00006830UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_012_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_012_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_012_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_012_V0 	ERC_PING_DROP_INTLEVEL_012_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_012_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_012_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_012_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_012_V1 	ERC_PING_DROP_INTLEVEL_012_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_012_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_012_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_012_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_012_V2 	ERC_PING_DROP_INTLEVEL_012_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_012_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_012_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_012_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_012_V3 	ERC_PING_DROP_INTLEVEL_012_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_012_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_012_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_012_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_012_V4 	ERC_PING_DROP_INTLEVEL_012_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_013 	(0x00006834UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_013_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_013_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_013_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_013_V0 	ERC_PONG_DROP_INTLEVEL_013_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_013_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_013_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_013_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_013_V1 	ERC_PONG_DROP_INTLEVEL_013_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_013_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_013_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_013_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_013_V2 	ERC_PONG_DROP_INTLEVEL_013_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_013_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_013_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_013_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_013_V3 	ERC_PONG_DROP_INTLEVEL_013_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_013_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_013_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_013_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_013_V4 	ERC_PONG_DROP_INTLEVEL_013_V4_Msk
#define ERC_PING_DROP_INTLEVEL_013 	(0x00006834UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_013_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_013_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_013_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_013_V0 	ERC_PING_DROP_INTLEVEL_013_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_013_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_013_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_013_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_013_V1 	ERC_PING_DROP_INTLEVEL_013_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_013_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_013_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_013_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_013_V2 	ERC_PING_DROP_INTLEVEL_013_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_013_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_013_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_013_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_013_V3 	ERC_PING_DROP_INTLEVEL_013_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_013_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_013_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_013_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_013_V4 	ERC_PING_DROP_INTLEVEL_013_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_014 	(0x00006838UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_014_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_014_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_014_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_014_V0 	ERC_PONG_DROP_INTLEVEL_014_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_014_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_014_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_014_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_014_V1 	ERC_PONG_DROP_INTLEVEL_014_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_014_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_014_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_014_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_014_V2 	ERC_PONG_DROP_INTLEVEL_014_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_014_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_014_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_014_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_014_V3 	ERC_PONG_DROP_INTLEVEL_014_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_014_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_014_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_014_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_014_V4 	ERC_PONG_DROP_INTLEVEL_014_V4_Msk
#define ERC_PING_DROP_INTLEVEL_014 	(0x00006838UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_014_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_014_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_014_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_014_V0 	ERC_PING_DROP_INTLEVEL_014_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_014_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_014_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_014_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_014_V1 	ERC_PING_DROP_INTLEVEL_014_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_014_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_014_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_014_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_014_V2 	ERC_PING_DROP_INTLEVEL_014_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_014_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_014_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_014_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_014_V3 	ERC_PING_DROP_INTLEVEL_014_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_014_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_014_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_014_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_014_V4 	ERC_PING_DROP_INTLEVEL_014_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_015 	(0x0000683CUL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_015_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_015_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_015_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_015_V0 	ERC_PONG_DROP_INTLEVEL_015_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_015_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_015_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_015_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_015_V1 	ERC_PONG_DROP_INTLEVEL_015_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_015_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_015_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_015_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_015_V2 	ERC_PONG_DROP_INTLEVEL_015_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_015_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_015_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_015_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_015_V3 	ERC_PONG_DROP_INTLEVEL_015_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_015_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_015_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_015_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_015_V4 	ERC_PONG_DROP_INTLEVEL_015_V4_Msk
#define ERC_PING_DROP_INTLEVEL_015 	(0x0000683CUL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_015_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_015_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_015_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_015_V0 	ERC_PING_DROP_INTLEVEL_015_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_015_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_015_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_015_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_015_V1 	ERC_PING_DROP_INTLEVEL_015_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_015_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_015_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_015_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_015_V2 	ERC_PING_DROP_INTLEVEL_015_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_015_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_015_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_015_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_015_V3 	ERC_PING_DROP_INTLEVEL_015_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_015_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_015_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_015_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_015_V4 	ERC_PING_DROP_INTLEVEL_015_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_016 	(0x00006840UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_016_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_016_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_016_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_016_V0 	ERC_PONG_DROP_INTLEVEL_016_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_016_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_016_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_016_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_016_V1 	ERC_PONG_DROP_INTLEVEL_016_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_016_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_016_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_016_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_016_V2 	ERC_PONG_DROP_INTLEVEL_016_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_016_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_016_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_016_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_016_V3 	ERC_PONG_DROP_INTLEVEL_016_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_016_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_016_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_016_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_016_V4 	ERC_PONG_DROP_INTLEVEL_016_V4_Msk
#define ERC_PING_DROP_INTLEVEL_016 	(0x00006840UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_016_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_016_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_016_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_016_V0 	ERC_PING_DROP_INTLEVEL_016_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_016_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_016_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_016_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_016_V1 	ERC_PING_DROP_INTLEVEL_016_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_016_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_016_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_016_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_016_V2 	ERC_PING_DROP_INTLEVEL_016_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_016_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_016_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_016_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_016_V3 	ERC_PING_DROP_INTLEVEL_016_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_016_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_016_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_016_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_016_V4 	ERC_PING_DROP_INTLEVEL_016_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_017 	(0x00006844UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_017_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_017_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_017_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_017_V0 	ERC_PONG_DROP_INTLEVEL_017_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_017_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_017_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_017_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_017_V1 	ERC_PONG_DROP_INTLEVEL_017_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_017_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_017_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_017_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_017_V2 	ERC_PONG_DROP_INTLEVEL_017_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_017_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_017_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_017_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_017_V3 	ERC_PONG_DROP_INTLEVEL_017_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_017_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_017_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_017_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_017_V4 	ERC_PONG_DROP_INTLEVEL_017_V4_Msk
#define ERC_PING_DROP_INTLEVEL_017 	(0x00006844UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_017_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_017_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_017_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_017_V0 	ERC_PING_DROP_INTLEVEL_017_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_017_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_017_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_017_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_017_V1 	ERC_PING_DROP_INTLEVEL_017_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_017_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_017_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_017_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_017_V2 	ERC_PING_DROP_INTLEVEL_017_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_017_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_017_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_017_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_017_V3 	ERC_PING_DROP_INTLEVEL_017_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_017_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_017_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_017_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_017_V4 	ERC_PING_DROP_INTLEVEL_017_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_018 	(0x00006848UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_018_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_018_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_018_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_018_V0 	ERC_PONG_DROP_INTLEVEL_018_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_018_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_018_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_018_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_018_V1 	ERC_PONG_DROP_INTLEVEL_018_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_018_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_018_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_018_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_018_V2 	ERC_PONG_DROP_INTLEVEL_018_V2_Msk
