jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_PONG_DROP_INTLEVEL_018_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_018_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_018_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_018_V3 	ERC_PONG_DROP_INTLEVEL_018_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_018_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_018_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_018_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_018_V4 	ERC_PONG_DROP_INTLEVEL_018_V4_Msk
#define ERC_PING_DROP_INTLEVEL_018 	(0x00006848UL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_018_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_018_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_018_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_018_V0 	ERC_PING_DROP_INTLEVEL_018_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_018_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_018_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_018_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_018_V1 	ERC_PING_DROP_INTLEVEL_018_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_018_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_018_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_018_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_018_V2 	ERC_PING_DROP_INTLEVEL_018_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_018_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_018_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_018_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_018_V3 	ERC_PING_DROP_INTLEVEL_018_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_018_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_018_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_018_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_018_V4 	ERC_PING_DROP_INTLEVEL_018_V4_Msk
#define ERC_PONG_DROP_INTLEVEL_019 	(0x0000684CUL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PONG_DROP_INTLEVEL_019_V0_Pos 	(0x0U)
#define 	ERC_PONG_DROP_INTLEVEL_019_V0_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_019_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PONG_DROP_INTLEVEL_019_V0 	ERC_PONG_DROP_INTLEVEL_019_V0_Msk
#define 	ERC_PONG_DROP_INTLEVEL_019_V1_Pos 	(0x4U)
#define 	ERC_PONG_DROP_INTLEVEL_019_V1_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_019_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PONG_DROP_INTLEVEL_019_V1 	ERC_PONG_DROP_INTLEVEL_019_V1_Msk
#define 	ERC_PONG_DROP_INTLEVEL_019_V2_Pos 	(0x8U)
#define 	ERC_PONG_DROP_INTLEVEL_019_V2_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_019_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PONG_DROP_INTLEVEL_019_V2 	ERC_PONG_DROP_INTLEVEL_019_V2_Msk
#define 	ERC_PONG_DROP_INTLEVEL_019_V3_Pos 	(0xCU)
#define 	ERC_PONG_DROP_INTLEVEL_019_V3_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_019_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PONG_DROP_INTLEVEL_019_V3 	ERC_PONG_DROP_INTLEVEL_019_V3_Msk
#define 	ERC_PONG_DROP_INTLEVEL_019_V4_Pos 	(0x10U)
#define 	ERC_PONG_DROP_INTLEVEL_019_V4_Msk 	(0xFUL << ERC_PONG_DROP_INTLEVEL_019_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PONG_DROP_INTLEVEL_019_V4 	ERC_PONG_DROP_INTLEVEL_019_V4_Msk
#define ERC_PING_DROP_INTLEVEL_019 	(0x0000684CUL) 	/*<! Interest Level: Q1.3. Value should be in range [0x0..0x8] or equal to 0xF (0xF is vital interest, forcing Di,j to 0). */
#define 	ERC_PING_DROP_INTLEVEL_019_V0_Pos 	(0x0U)
#define 	ERC_PING_DROP_INTLEVEL_019_V0_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_019_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_PING_DROP_INTLEVEL_019_V0 	ERC_PING_DROP_INTLEVEL_019_V0_Msk
#define 	ERC_PING_DROP_INTLEVEL_019_V1_Pos 	(0x4U)
#define 	ERC_PING_DROP_INTLEVEL_019_V1_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_019_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_PING_DROP_INTLEVEL_019_V1 	ERC_PING_DROP_INTLEVEL_019_V1_Msk
#define 	ERC_PING_DROP_INTLEVEL_019_V2_Pos 	(0x8U)
#define 	ERC_PING_DROP_INTLEVEL_019_V2_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_019_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_PING_DROP_INTLEVEL_019_V2 	ERC_PING_DROP_INTLEVEL_019_V2_Msk
#define 	ERC_PING_DROP_INTLEVEL_019_V3_Pos 	(0xCU)
#define 	ERC_PING_DROP_INTLEVEL_019_V3_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_019_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_PING_DROP_INTLEVEL_019_V3 	ERC_PING_DROP_INTLEVEL_019_V3_Msk
#define 	ERC_PING_DROP_INTLEVEL_019_V4_Pos 	(0x10U)
#define 	ERC_PING_DROP_INTLEVEL_019_V4_Msk 	(0xFUL << ERC_PING_DROP_INTLEVEL_019_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_PING_DROP_INTLEVEL_019_V4 	ERC_PING_DROP_INTLEVEL_019_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_000 	(0x00006880UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_000_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_000_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_000_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_000_V0 	ERC_INTLEVEL_READONLY_BANK_000_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_000_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_000_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_000_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_000_V1 	ERC_INTLEVEL_READONLY_BANK_000_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_000_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_000_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_000_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_000_V2 	ERC_INTLEVEL_READONLY_BANK_000_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_000_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_000_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_000_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_000_V3 	ERC_INTLEVEL_READONLY_BANK_000_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_000_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_000_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_000_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_000_V4 	ERC_INTLEVEL_READONLY_BANK_000_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_001 	(0x00006884UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_001_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_001_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_001_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_001_V0 	ERC_INTLEVEL_READONLY_BANK_001_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_001_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_001_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_001_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_001_V1 	ERC_INTLEVEL_READONLY_BANK_001_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_001_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_001_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_001_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_001_V2 	ERC_INTLEVEL_READONLY_BANK_001_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_001_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_001_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_001_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_001_V3 	ERC_INTLEVEL_READONLY_BANK_001_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_001_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_001_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_001_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_001_V4 	ERC_INTLEVEL_READONLY_BANK_001_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_002 	(0x00006888UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_002_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_002_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_002_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_002_V0 	ERC_INTLEVEL_READONLY_BANK_002_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_002_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_002_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_002_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_002_V1 	ERC_INTLEVEL_READONLY_BANK_002_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_002_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_002_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_002_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_002_V2 	ERC_INTLEVEL_READONLY_BANK_002_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_002_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_002_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_002_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_002_V3 	ERC_INTLEVEL_READONLY_BANK_002_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_002_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_002_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_002_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_002_V4 	ERC_INTLEVEL_READONLY_BANK_002_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_003 	(0x0000688CUL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_003_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_003_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_003_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_003_V0 	ERC_INTLEVEL_READONLY_BANK_003_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_003_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_003_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_003_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_003_V1 	ERC_INTLEVEL_READONLY_BANK_003_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_003_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_003_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_003_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_003_V2 	ERC_INTLEVEL_READONLY_BANK_003_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_003_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_003_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_003_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_003_V3 	ERC_INTLEVEL_READONLY_BANK_003_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_003_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_003_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_003_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_003_V4 	ERC_INTLEVEL_READONLY_BANK_003_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_004 	(0x00006890UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_004_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_004_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_004_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_004_V0 	ERC_INTLEVEL_READONLY_BANK_004_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_004_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_004_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_004_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_004_V1 	ERC_INTLEVEL_READONLY_BANK_004_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_004_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_004_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_004_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_004_V2 	ERC_INTLEVEL_READONLY_BANK_004_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_004_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_004_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_004_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_004_V3 	ERC_INTLEVEL_READONLY_BANK_004_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_004_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_004_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_004_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_004_V4 	ERC_INTLEVEL_READONLY_BANK_004_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_005 	(0x00006894UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_005_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_005_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_005_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_005_V0 	ERC_INTLEVEL_READONLY_BANK_005_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_005_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_005_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_005_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_005_V1 	ERC_INTLEVEL_READONLY_BANK_005_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_005_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_005_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_005_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_005_V2 	ERC_INTLEVEL_READONLY_BANK_005_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_005_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_005_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_005_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_005_V3 	ERC_INTLEVEL_READONLY_BANK_005_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_005_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_005_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_005_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_005_V4 	ERC_INTLEVEL_READONLY_BANK_005_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_006 	(0x00006898UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_006_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_006_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_006_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_006_V0 	ERC_INTLEVEL_READONLY_BANK_006_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_006_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_006_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_006_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_006_V1 	ERC_INTLEVEL_READONLY_BANK_006_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_006_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_006_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_006_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_006_V2 	ERC_INTLEVEL_READONLY_BANK_006_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_006_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_006_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_006_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_006_V3 	ERC_INTLEVEL_READONLY_BANK_006_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_006_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_006_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_006_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_006_V4 	ERC_INTLEVEL_READONLY_BANK_006_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_007 	(0x0000689CUL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_007_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_007_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_007_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_007_V0 	ERC_INTLEVEL_READONLY_BANK_007_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_007_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_007_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_007_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_007_V1 	ERC_INTLEVEL_READONLY_BANK_007_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_007_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_007_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_007_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_007_V2 	ERC_INTLEVEL_READONLY_BANK_007_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_007_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_007_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_007_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_007_V3 	ERC_INTLEVEL_READONLY_BANK_007_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_007_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_007_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_007_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_007_V4 	ERC_INTLEVEL_READONLY_BANK_007_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_008 	(0x000068A0UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_008_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_008_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_008_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_008_V0 	ERC_INTLEVEL_READONLY_BANK_008_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_008_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_008_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_008_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_008_V1 	ERC_INTLEVEL_READONLY_BANK_008_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_008_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_008_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_008_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_008_V2 	ERC_INTLEVEL_READONLY_BANK_008_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_008_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_008_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_008_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_008_V3 	ERC_INTLEVEL_READONLY_BANK_008_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_008_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_008_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_008_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_008_V4 	ERC_INTLEVEL_READONLY_BANK_008_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_009 	(0x000068A4UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_009_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_009_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_009_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_009_V0 	ERC_INTLEVEL_READONLY_BANK_009_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_009_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_009_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_009_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_009_V1 	ERC_INTLEVEL_READONLY_BANK_009_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_009_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_009_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_009_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_009_V2 	ERC_INTLEVEL_READONLY_BANK_009_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_009_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_009_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_009_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_009_V3 	ERC_INTLEVEL_READONLY_BANK_009_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_009_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_009_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_009_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_009_V4 	ERC_INTLEVEL_READONLY_BANK_009_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_010 	(0x000068A8UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_010_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_010_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_010_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_010_V0 	ERC_INTLEVEL_READONLY_BANK_010_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_010_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_010_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_010_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_010_V1 	ERC_INTLEVEL_READONLY_BANK_010_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_010_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_010_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_010_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_010_V2 	ERC_INTLEVEL_READONLY_BANK_010_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_010_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_010_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_010_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_010_V3 	ERC_INTLEVEL_READONLY_BANK_010_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_010_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_010_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_010_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_010_V4 	ERC_INTLEVEL_READONLY_BANK_010_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_011 	(0x000068ACUL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_011_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_011_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_011_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_011_V0 	ERC_INTLEVEL_READONLY_BANK_011_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_011_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_011_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_011_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_011_V1 	ERC_INTLEVEL_READONLY_BANK_011_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_011_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_011_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_011_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_011_V2 	ERC_INTLEVEL_READONLY_BANK_011_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_011_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_011_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_011_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_011_V3 	ERC_INTLEVEL_READONLY_BANK_011_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_011_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_011_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_011_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_011_V4 	ERC_INTLEVEL_READONLY_BANK_011_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_012 	(0x000068B0UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_012_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_012_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_012_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_012_V0 	ERC_INTLEVEL_READONLY_BANK_012_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_012_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_012_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_012_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_012_V1 	ERC_INTLEVEL_READONLY_BANK_012_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_012_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_012_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_012_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_012_V2 	ERC_INTLEVEL_READONLY_BANK_012_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_012_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_012_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_012_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_012_V3 	ERC_INTLEVEL_READONLY_BANK_012_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_012_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_012_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_012_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_012_V4 	ERC_INTLEVEL_READONLY_BANK_012_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_013 	(0x000068B4UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_013_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_013_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_013_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_013_V0 	ERC_INTLEVEL_READONLY_BANK_013_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_013_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_013_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_013_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_013_V1 	ERC_INTLEVEL_READONLY_BANK_013_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_013_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_013_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_013_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_013_V2 	ERC_INTLEVEL_READONLY_BANK_013_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_013_V3_Pos 	(0xCU)
