jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	ERC_INTLEVEL_READONLY_BANK_013_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_013_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_013_V3 	ERC_INTLEVEL_READONLY_BANK_013_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_013_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_013_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_013_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_013_V4 	ERC_INTLEVEL_READONLY_BANK_013_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_014 	(0x000068B8UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_014_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_014_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_014_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_014_V0 	ERC_INTLEVEL_READONLY_BANK_014_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_014_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_014_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_014_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_014_V1 	ERC_INTLEVEL_READONLY_BANK_014_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_014_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_014_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_014_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_014_V2 	ERC_INTLEVEL_READONLY_BANK_014_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_014_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_014_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_014_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_014_V3 	ERC_INTLEVEL_READONLY_BANK_014_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_014_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_014_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_014_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_014_V4 	ERC_INTLEVEL_READONLY_BANK_014_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_015 	(0x000068BCUL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_015_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_015_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_015_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_015_V0 	ERC_INTLEVEL_READONLY_BANK_015_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_015_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_015_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_015_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_015_V1 	ERC_INTLEVEL_READONLY_BANK_015_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_015_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_015_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_015_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_015_V2 	ERC_INTLEVEL_READONLY_BANK_015_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_015_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_015_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_015_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_015_V3 	ERC_INTLEVEL_READONLY_BANK_015_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_015_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_015_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_015_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_015_V4 	ERC_INTLEVEL_READONLY_BANK_015_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_016 	(0x000068C0UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_016_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_016_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_016_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_016_V0 	ERC_INTLEVEL_READONLY_BANK_016_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_016_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_016_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_016_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_016_V1 	ERC_INTLEVEL_READONLY_BANK_016_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_016_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_016_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_016_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_016_V2 	ERC_INTLEVEL_READONLY_BANK_016_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_016_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_016_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_016_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_016_V3 	ERC_INTLEVEL_READONLY_BANK_016_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_016_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_016_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_016_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_016_V4 	ERC_INTLEVEL_READONLY_BANK_016_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_017 	(0x000068C4UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_017_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_017_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_017_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_017_V0 	ERC_INTLEVEL_READONLY_BANK_017_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_017_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_017_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_017_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_017_V1 	ERC_INTLEVEL_READONLY_BANK_017_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_017_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_017_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_017_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_017_V2 	ERC_INTLEVEL_READONLY_BANK_017_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_017_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_017_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_017_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_017_V3 	ERC_INTLEVEL_READONLY_BANK_017_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_017_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_017_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_017_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_017_V4 	ERC_INTLEVEL_READONLY_BANK_017_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_018 	(0x000068C8UL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_018_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_018_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_018_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_018_V0 	ERC_INTLEVEL_READONLY_BANK_018_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_018_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_018_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_018_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_018_V1 	ERC_INTLEVEL_READONLY_BANK_018_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_018_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_018_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_018_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_018_V2 	ERC_INTLEVEL_READONLY_BANK_018_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_018_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_018_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_018_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_018_V3 	ERC_INTLEVEL_READONLY_BANK_018_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_018_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_018_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_018_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_018_V4 	ERC_INTLEVEL_READONLY_BANK_018_V4_Msk
#define ERC_INTLEVEL_READONLY_BANK_019 	(0x000068CCUL) 	/*<! Content of the (ping/pong,EDR/ADR) sram selected through intlvl_read_bank_sel register. */
#define 	ERC_INTLEVEL_READONLY_BANK_019_V0_Pos 	(0x0U)
#define 	ERC_INTLEVEL_READONLY_BANK_019_V0_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_019_V0_Pos) 	/*!< 0x0000000F */
#define 	ERC_INTLEVEL_READONLY_BANK_019_V0 	ERC_INTLEVEL_READONLY_BANK_019_V0_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_019_V1_Pos 	(0x4U)
#define 	ERC_INTLEVEL_READONLY_BANK_019_V1_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_019_V1_Pos) 	/*!< 0x000000F0 */
#define 	ERC_INTLEVEL_READONLY_BANK_019_V1 	ERC_INTLEVEL_READONLY_BANK_019_V1_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_019_V2_Pos 	(0x8U)
#define 	ERC_INTLEVEL_READONLY_BANK_019_V2_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_019_V2_Pos) 	/*!< 0x00000F00 */
#define 	ERC_INTLEVEL_READONLY_BANK_019_V2 	ERC_INTLEVEL_READONLY_BANK_019_V2_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_019_V3_Pos 	(0xCU)
#define 	ERC_INTLEVEL_READONLY_BANK_019_V3_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_019_V3_Pos) 	/*!< 0x0000F000 */
#define 	ERC_INTLEVEL_READONLY_BANK_019_V3 	ERC_INTLEVEL_READONLY_BANK_019_V3_Msk
#define 	ERC_INTLEVEL_READONLY_BANK_019_V4_Pos 	(0x10U)
#define 	ERC_INTLEVEL_READONLY_BANK_019_V4_Msk 	(0xFUL << ERC_INTLEVEL_READONLY_BANK_019_V4_Pos) 	/*!< 0x000F0000 */
#define 	ERC_INTLEVEL_READONLY_BANK_019_V4 	ERC_INTLEVEL_READONLY_BANK_019_V4_Msk

