jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * EDF: Event Data Formatter Register Map
 * ------------------------------------------------------ */

#define EDF_PIPELINE_CONTROL 	(0x00007000UL) 	/*<! Block Control register, Control Hardware pipeline block behaviour.
This register is synchronized, meaning that changing its value will imply waiting for its pipe to empty before applying new configuration so as to keep the configuration homogene along the block */
#define 	EDF_PIPELINE_CONTROL_ENABLE_Pos 	(0x0U)
#define 	EDF_PIPELINE_CONTROL_ENABLE_Msk 	(0x1UL << EDF_PIPELINE_CONTROL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	EDF_PIPELINE_CONTROL_ENABLE 	EDF_PIPELINE_CONTROL_ENABLE_Msk
#define 	EDF_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos 	(0x1U)
#define 	EDF_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk 	(0x1UL << EDF_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos) 	/*!< 0x00000002 */
#define 	EDF_PIPELINE_CONTROL_DROP_NBACKPRESSURE 	EDF_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk
#define 	EDF_PIPELINE_CONTROL_BYPASS_Pos 	(0x2U)
#define 	EDF_PIPELINE_CONTROL_BYPASS_Msk 	(0x1UL << EDF_PIPELINE_CONTROL_BYPASS_Pos) 	/*!< 0x00000004 */
#define 	EDF_PIPELINE_CONTROL_BYPASS 	EDF_PIPELINE_CONTROL_BYPASS_Msk
#define EDF_PIPELINE_STATUS 	(0x00007004UL) 	/*<! Block Status Register: This register give information about the internal status of the block. */
#define 	EDF_PIPELINE_STATUS_EMPTY_Pos 	(0x0U)
#define 	EDF_PIPELINE_STATUS_EMPTY_Msk 	(0x1UL << EDF_PIPELINE_STATUS_EMPTY_Pos) 	/*!< 0x00000001 */
#define 	EDF_PIPELINE_STATUS_EMPTY 	EDF_PIPELINE_STATUS_EMPTY_Msk
#define 	EDF_PIPELINE_STATUS_BUSY_Pos 	(0x1U)
#define 	EDF_PIPELINE_STATUS_BUSY_Msk 	(0x1UL << EDF_PIPELINE_STATUS_BUSY_Pos) 	/*!< 0x00000002 */
#define 	EDF_PIPELINE_STATUS_BUSY 	EDF_PIPELINE_STATUS_BUSY_Msk
#define 	EDF_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Pos 	(0x2U)
#define 	EDF_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << EDF_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00000004 */
#define 	EDF_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN 	EDF_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Msk
#define EDF_EVENT_TYPE_EN 	(0x00007040UL) 	/*<! Event Type enable or event type filtering. This register is used to filter events EVT2.1 from their bare type(special case for 'others' and 'continued', this is applied except if block is in bypass, in this case everything go through */
#define 	EDF_EVENT_TYPE_EN_LEFT_TD_LOW_Pos 	(0x0U)
#define 	EDF_EVENT_TYPE_EN_LEFT_TD_LOW_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_LEFT_TD_LOW_Pos) 	/*!< 0x00000001 */
#define 	EDF_EVENT_TYPE_EN_LEFT_TD_LOW 	EDF_EVENT_TYPE_EN_LEFT_TD_LOW_Msk
#define 	EDF_EVENT_TYPE_EN_LEFT_TD_HIGH_Pos 	(0x1U)
#define 	EDF_EVENT_TYPE_EN_LEFT_TD_HIGH_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_LEFT_TD_HIGH_Pos) 	/*!< 0x00000002 */
#define 	EDF_EVENT_TYPE_EN_LEFT_TD_HIGH 	EDF_EVENT_TYPE_EN_LEFT_TD_HIGH_Msk
#define 	EDF_EVENT_TYPE_EN_LEFT_APS_LOW_Pos 	(0x2U)
#define 	EDF_EVENT_TYPE_EN_LEFT_APS_LOW_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_LEFT_APS_LOW_Pos) 	/*!< 0x00000004 */
#define 	EDF_EVENT_TYPE_EN_LEFT_APS_LOW 	EDF_EVENT_TYPE_EN_LEFT_APS_LOW_Msk
#define 	EDF_EVENT_TYPE_EN_LEFT_APS_HIGH_Pos 	(0x3U)
#define 	EDF_EVENT_TYPE_EN_LEFT_APS_HIGH_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_LEFT_APS_HIGH_Pos) 	/*!< 0x00000008 */
#define 	EDF_EVENT_TYPE_EN_LEFT_APS_HIGH 	EDF_EVENT_TYPE_EN_LEFT_APS_HIGH_Msk
#define 	EDF_EVENT_TYPE_EN_RIGHT_TD_LOW_Pos 	(0x4U)
#define 	EDF_EVENT_TYPE_EN_RIGHT_TD_LOW_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_RIGHT_TD_LOW_Pos) 	/*!< 0x00000010 */
#define 	EDF_EVENT_TYPE_EN_RIGHT_TD_LOW 	EDF_EVENT_TYPE_EN_RIGHT_TD_LOW_Msk
#define 	EDF_EVENT_TYPE_EN_RIGHT_TD_HIGH_Pos 	(0x5U)
#define 	EDF_EVENT_TYPE_EN_RIGHT_TD_HIGH_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_RIGHT_TD_HIGH_Pos) 	/*!< 0x00000020 */
#define 	EDF_EVENT_TYPE_EN_RIGHT_TD_HIGH 	EDF_EVENT_TYPE_EN_RIGHT_TD_HIGH_Msk
#define 	EDF_EVENT_TYPE_EN_RIGHT_APS_LOW_Pos 	(0x6U)
#define 	EDF_EVENT_TYPE_EN_RIGHT_APS_LOW_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_RIGHT_APS_LOW_Pos) 	/*!< 0x00000040 */
#define 	EDF_EVENT_TYPE_EN_RIGHT_APS_LOW 	EDF_EVENT_TYPE_EN_RIGHT_APS_LOW_Msk
#define 	EDF_EVENT_TYPE_EN_RIGHT_APS_HIGH_Pos 	(0x7U)
#define 	EDF_EVENT_TYPE_EN_RIGHT_APS_HIGH_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_RIGHT_APS_HIGH_Pos) 	/*!< 0x00000080 */
#define 	EDF_EVENT_TYPE_EN_RIGHT_APS_HIGH 	EDF_EVENT_TYPE_EN_RIGHT_APS_HIGH_Msk
#define 	EDF_EVENT_TYPE_EN_TIME_HIGH_Pos 	(0x8U)
#define 	EDF_EVENT_TYPE_EN_TIME_HIGH_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_TIME_HIGH_Pos) 	/*!< 0x00000100 */
#define 	EDF_EVENT_TYPE_EN_TIME_HIGH 	EDF_EVENT_TYPE_EN_TIME_HIGH_Msk
#define 	EDF_EVENT_TYPE_EN_STEREO_DISP_Pos 	(0x9U)
#define 	EDF_EVENT_TYPE_EN_STEREO_DISP_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_STEREO_DISP_Pos) 	/*!< 0x00000200 */
#define 	EDF_EVENT_TYPE_EN_STEREO_DISP 	EDF_EVENT_TYPE_EN_STEREO_DISP_Msk
#define 	EDF_EVENT_TYPE_EN_EXT_TRIGGER_Pos 	(0xAU)
#define 	EDF_EVENT_TYPE_EN_EXT_TRIGGER_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_EXT_TRIGGER_Pos) 	/*!< 0x00000400 */
#define 	EDF_EVENT_TYPE_EN_EXT_TRIGGER 	EDF_EVENT_TYPE_EN_EXT_TRIGGER_Msk
#define 	EDF_EVENT_TYPE_EN_GRAY_LEVEL_Pos 	(0xBU)
#define 	EDF_EVENT_TYPE_EN_GRAY_LEVEL_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_GRAY_LEVEL_Pos) 	/*!< 0x00000800 */
#define 	EDF_EVENT_TYPE_EN_GRAY_LEVEL 	EDF_EVENT_TYPE_EN_GRAY_LEVEL_Msk
#define 	EDF_EVENT_TYPE_EN_OPT_FLOW_Pos 	(0xCU)
#define 	EDF_EVENT_TYPE_EN_OPT_FLOW_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_OPT_FLOW_Pos) 	/*!< 0x00001000 */
#define 	EDF_EVENT_TYPE_EN_OPT_FLOW 	EDF_EVENT_TYPE_EN_OPT_FLOW_Msk
#define 	EDF_EVENT_TYPE_EN_ORIENTATION_Pos 	(0xDU)
#define 	EDF_EVENT_TYPE_EN_ORIENTATION_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_ORIENTATION_Pos) 	/*!< 0x00002000 */
#define 	EDF_EVENT_TYPE_EN_ORIENTATION 	EDF_EVENT_TYPE_EN_ORIENTATION_Msk
#define 	EDF_EVENT_TYPE_EN_OTHERS_AND_LINKED_CONTINUED_Pos 	(0xEU)
#define 	EDF_EVENT_TYPE_EN_OTHERS_AND_LINKED_CONTINUED_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_OTHERS_AND_LINKED_CONTINUED_Pos) 	/*!< 0x00004000 */
#define 	EDF_EVENT_TYPE_EN_OTHERS_AND_LINKED_CONTINUED 	EDF_EVENT_TYPE_EN_OTHERS_AND_LINKED_CONTINUED_Msk
#define 	EDF_EVENT_TYPE_EN_CONTINUED_ALONE_Pos 	(0xFU)
#define 	EDF_EVENT_TYPE_EN_CONTINUED_ALONE_Msk 	(0x1UL << EDF_EVENT_TYPE_EN_CONTINUED_ALONE_Pos) 	/*!< 0x00008000 */
#define 	EDF_EVENT_TYPE_EN_CONTINUED_ALONE 	EDF_EVENT_TYPE_EN_CONTINUED_ALONE_Msk
#define EDF_CONTROL 	(0x00007044UL) 	/*<! Event format Control, if block enabled and not in bypass this register controls event formatting and endianness. if in bypass format is assimilated 2.1 and endianness is little.
This register is synchronized, meaning that changing its value will imply waiting for its pipe to empty before applying new configuration so as to keep the configuration homogene along the block */
#define 	EDF_CONTROL_FORMAT_Pos 	(0x0U)
#define 	EDF_CONTROL_FORMAT_Msk 	(0x3UL << EDF_CONTROL_FORMAT_Pos) 	/*!< 0x00000003 */
#define 	EDF_CONTROL_FORMAT 	EDF_CONTROL_FORMAT_Msk
#define 	EDF_CONTROL_ENDIANNESS_Pos 	(0x4U)
#define 	EDF_CONTROL_ENDIANNESS_Msk 	(0x1UL << EDF_CONTROL_ENDIANNESS_Pos) 	/*!< 0x00000010 */
#define 	EDF_CONTROL_ENDIANNESS 	EDF_CONTROL_ENDIANNESS_Msk
#define EDF_EVENT_INJECTION 	(0x00007048UL) 	/*<! Register to enable/disable Event Injection from the EDF */
#define 	EDF_EVENT_INJECTION_SYSMON_END_OF_FRAME_EN_Pos 	(0x0U)
#define 	EDF_EVENT_INJECTION_SYSMON_END_OF_FRAME_EN_Msk 	(0x1UL << EDF_EVENT_INJECTION_SYSMON_END_OF_FRAME_EN_Pos) 	/*!< 0x00000001 */
#define 	EDF_EVENT_INJECTION_SYSMON_END_OF_FRAME_EN 	EDF_EVENT_INJECTION_SYSMON_END_OF_FRAME_EN_Msk
#define EDF_OUTPUT_INTERFACE_CONTROL 	(0x0000704CUL) 	/*<! Special register for Start of Frame function */
#define 	EDF_OUTPUT_INTERFACE_CONTROL_START_OF_FRAME_TIMEOUT_Pos 	(0x4U)
#define 	EDF_OUTPUT_INTERFACE_CONTROL_START_OF_FRAME_TIMEOUT_Msk 	(0xFFFUL << EDF_OUTPUT_INTERFACE_CONTROL_START_OF_FRAME_TIMEOUT_Pos) 	/*!< 0x0000FFF0 */
#define 	EDF_OUTPUT_INTERFACE_CONTROL_START_OF_FRAME_TIMEOUT 	EDF_OUTPUT_INTERFACE_CONTROL_START_OF_FRAME_TIMEOUT_Msk
#define EDF_EXTERNAL_OUTPUT_ADAPTER 	(0x00007100UL) 	/*<! This register is dedicated to help controling optional 'External Output Adapter'(EOA) IP that can help adapting EventFlow on VRD128F interface onto another interface type */
#define 	EDF_EXTERNAL_OUTPUT_ADAPTER_QOS_TIMEOUT_Pos 	(0x0U)
#define 	EDF_EXTERNAL_OUTPUT_ADAPTER_QOS_TIMEOUT_Msk 	(0xFFFFUL << EDF_EXTERNAL_OUTPUT_ADAPTER_QOS_TIMEOUT_Pos) 	/*!< 0x0000FFFF */
#define 	EDF_EXTERNAL_OUTPUT_ADAPTER_QOS_TIMEOUT 	EDF_EXTERNAL_OUTPUT_ADAPTER_QOS_TIMEOUT_Msk
#define 	EDF_EXTERNAL_OUTPUT_ADAPTER_ATOMIC_QOS_MODE_Pos 	(0x10U)
#define 	EDF_EXTERNAL_OUTPUT_ADAPTER_ATOMIC_QOS_MODE_Msk 	(0x1UL << EDF_EXTERNAL_OUTPUT_ADAPTER_ATOMIC_QOS_MODE_Pos) 	/*!< 0x00010000 */
#define 	EDF_EXTERNAL_OUTPUT_ADAPTER_ATOMIC_QOS_MODE 	EDF_EXTERNAL_OUTPUT_ADAPTER_ATOMIC_QOS_MODE_Msk
#define EDF_CHICKEN0_BITS 	(0x000071C0UL) 	/*<! Private register 1. It's design related, and should be used with care */
#define 	EDF_CHICKEN0_BITS_LEGACY_EVT21_ENDIANNESS_Pos 	(0x0U)
#define 	EDF_CHICKEN0_BITS_LEGACY_EVT21_ENDIANNESS_Msk 	(0x1UL << EDF_CHICKEN0_BITS_LEGACY_EVT21_ENDIANNESS_Pos) 	/*!< 0x00000001 */
#define 	EDF_CHICKEN0_BITS_LEGACY_EVT21_ENDIANNESS 	EDF_CHICKEN0_BITS_LEGACY_EVT21_ENDIANNESS_Msk

