jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * CPI: Event Output Interface Register Map
 * ------------------------------------------------------ */

#define CPI_PIPELINE_CONTROL 	(0x00008000UL) 	/*<!  */
#define 	CPI_PIPELINE_CONTROL_ENABLE_Pos 	(0x0U)
#define 	CPI_PIPELINE_CONTROL_ENABLE_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	CPI_PIPELINE_CONTROL_ENABLE 	CPI_PIPELINE_CONTROL_ENABLE_Msk
#define 	CPI_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos 	(0x1U)
#define 	CPI_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos) 	/*!< 0x00000002 */
#define 	CPI_PIPELINE_CONTROL_DROP_NBACKPRESSURE 	CPI_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk
#define 	CPI_PIPELINE_CONTROL_OUTPUT_FIFO_BYPASS_Pos 	(0x3U)
#define 	CPI_PIPELINE_CONTROL_OUTPUT_FIFO_BYPASS_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_OUTPUT_FIFO_BYPASS_Pos) 	/*!< 0x00000008 */
#define 	CPI_PIPELINE_CONTROL_OUTPUT_FIFO_BYPASS 	CPI_PIPELINE_CONTROL_OUTPUT_FIFO_BYPASS_Msk
#define 	CPI_PIPELINE_CONTROL_OUTPUT_DATA_FORMAT_Pos 	(0x4U)
#define 	CPI_PIPELINE_CONTROL_OUTPUT_DATA_FORMAT_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_OUTPUT_DATA_FORMAT_Pos) 	/*!< 0x00000010 */
#define 	CPI_PIPELINE_CONTROL_OUTPUT_DATA_FORMAT 	CPI_PIPELINE_CONTROL_OUTPUT_DATA_FORMAT_Msk
#define 	CPI_PIPELINE_CONTROL_OUTPUT_IF_MODE_Pos 	(0x5U)
#define 	CPI_PIPELINE_CONTROL_OUTPUT_IF_MODE_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_OUTPUT_IF_MODE_Pos) 	/*!< 0x00000020 */
#define 	CPI_PIPELINE_CONTROL_OUTPUT_IF_MODE 	CPI_PIPELINE_CONTROL_OUTPUT_IF_MODE_Msk
#define 	CPI_PIPELINE_CONTROL_OUTPUT_WIDTH_Pos 	(0x6U)
#define 	CPI_PIPELINE_CONTROL_OUTPUT_WIDTH_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_OUTPUT_WIDTH_Pos) 	/*!< 0x00000040 */
#define 	CPI_PIPELINE_CONTROL_OUTPUT_WIDTH 	CPI_PIPELINE_CONTROL_OUTPUT_WIDTH_Msk
#define 	CPI_PIPELINE_CONTROL_PACKET_FIXED_SIZE_ENABLE_Pos 	(0x7U)
#define 	CPI_PIPELINE_CONTROL_PACKET_FIXED_SIZE_ENABLE_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_PACKET_FIXED_SIZE_ENABLE_Pos) 	/*!< 0x00000080 */
#define 	CPI_PIPELINE_CONTROL_PACKET_FIXED_SIZE_ENABLE 	CPI_PIPELINE_CONTROL_PACKET_FIXED_SIZE_ENABLE_Msk
#define 	CPI_PIPELINE_CONTROL_PACKET_FIXED_RATE_ENABLE_Pos 	(0x8U)
#define 	CPI_PIPELINE_CONTROL_PACKET_FIXED_RATE_ENABLE_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_PACKET_FIXED_RATE_ENABLE_Pos) 	/*!< 0x00000100 */
#define 	CPI_PIPELINE_CONTROL_PACKET_FIXED_RATE_ENABLE 	CPI_PIPELINE_CONTROL_PACKET_FIXED_RATE_ENABLE_Msk
#define 	CPI_PIPELINE_CONTROL_FRAME_FIXED_SIZE_ENABLE_Pos 	(0x9U)
#define 	CPI_PIPELINE_CONTROL_FRAME_FIXED_SIZE_ENABLE_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_FRAME_FIXED_SIZE_ENABLE_Pos) 	/*!< 0x00000200 */
#define 	CPI_PIPELINE_CONTROL_FRAME_FIXED_SIZE_ENABLE 	CPI_PIPELINE_CONTROL_FRAME_FIXED_SIZE_ENABLE_Msk
#define 	CPI_PIPELINE_CONTROL_CLK_OUT_EN_Pos 	(0xAU)
#define 	CPI_PIPELINE_CONTROL_CLK_OUT_EN_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_CLK_OUT_EN_Pos) 	/*!< 0x00000400 */
#define 	CPI_PIPELINE_CONTROL_CLK_OUT_EN 	CPI_PIPELINE_CONTROL_CLK_OUT_EN_Msk
#define 	CPI_PIPELINE_CONTROL_CLK_INVERSION_Pos 	(0xBU)
#define 	CPI_PIPELINE_CONTROL_CLK_INVERSION_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_CLK_INVERSION_Pos) 	/*!< 0x00000800 */
#define 	CPI_PIPELINE_CONTROL_CLK_INVERSION 	CPI_PIPELINE_CONTROL_CLK_INVERSION_Msk
#define 	CPI_PIPELINE_CONTROL_CLK_OUT_GATING_ENABLE_Pos 	(0xCU)
#define 	CPI_PIPELINE_CONTROL_CLK_OUT_GATING_ENABLE_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_CLK_OUT_GATING_ENABLE_Pos) 	/*!< 0x00001000 */
#define 	CPI_PIPELINE_CONTROL_CLK_OUT_GATING_ENABLE 	CPI_PIPELINE_CONTROL_CLK_OUT_GATING_ENABLE_Msk
#define 	CPI_PIPELINE_CONTROL_CLK_TIMEOUT_Pos 	(0xDU)
#define 	CPI_PIPELINE_CONTROL_CLK_TIMEOUT_Msk 	(0xFFUL << CPI_PIPELINE_CONTROL_CLK_TIMEOUT_Pos) 	/*!< 0x001FE000 */
#define 	CPI_PIPELINE_CONTROL_CLK_TIMEOUT 	CPI_PIPELINE_CONTROL_CLK_TIMEOUT_Msk
#define 	CPI_PIPELINE_CONTROL_PACKET_PAD_EMPTY_ENABLE_Pos 	(0x15U)
#define 	CPI_PIPELINE_CONTROL_PACKET_PAD_EMPTY_ENABLE_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_PACKET_PAD_EMPTY_ENABLE_Pos) 	/*!< 0x00200000 */
#define 	CPI_PIPELINE_CONTROL_PACKET_PAD_EMPTY_ENABLE 	CPI_PIPELINE_CONTROL_PACKET_PAD_EMPTY_ENABLE_Msk
#define 	CPI_PIPELINE_CONTROL_HOT_DISABLE_ENABLE_Pos 	(0x16U)
#define 	CPI_PIPELINE_CONTROL_HOT_DISABLE_ENABLE_Msk 	(0x1UL << CPI_PIPELINE_CONTROL_HOT_DISABLE_ENABLE_Pos) 	/*!< 0x00400000 */
#define 	CPI_PIPELINE_CONTROL_HOT_DISABLE_ENABLE 	CPI_PIPELINE_CONTROL_HOT_DISABLE_ENABLE_Msk
#define CPI_PIPELINE_STATUS 	(0x00008004UL) 	/*<! Block Status Register: This register give information about the internal status of the block. */
#define 	CPI_PIPELINE_STATUS_EMPTY_Pos 	(0x0U)
#define 	CPI_PIPELINE_STATUS_EMPTY_Msk 	(0x1UL << CPI_PIPELINE_STATUS_EMPTY_Pos) 	/*!< 0x00000001 */
#define 	CPI_PIPELINE_STATUS_EMPTY 	CPI_PIPELINE_STATUS_EMPTY_Msk
#define 	CPI_PIPELINE_STATUS_BUSY_Pos 	(0x1U)
#define 	CPI_PIPELINE_STATUS_BUSY_Msk 	(0x1UL << CPI_PIPELINE_STATUS_BUSY_Pos) 	/*!< 0x00000002 */
#define 	CPI_PIPELINE_STATUS_BUSY 	CPI_PIPELINE_STATUS_BUSY_Msk
#define 	CPI_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Pos 	(0x2U)
#define 	CPI_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Msk 	(0x1UL << CPI_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Pos) 	/*!< 0x00000004 */
#define 	CPI_PIPELINE_STATUS_DEEP_LOW_POWER_READY 	CPI_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Msk
#define 	CPI_PIPELINE_STATUS_NO_ATOMIC_PACKET_Pos 	(0x3U)
#define 	CPI_PIPELINE_STATUS_NO_ATOMIC_PACKET_Msk 	(0x1UL << CPI_PIPELINE_STATUS_NO_ATOMIC_PACKET_Pos) 	/*!< 0x00000008 */
#define 	CPI_PIPELINE_STATUS_NO_ATOMIC_PACKET 	CPI_PIPELINE_STATUS_NO_ATOMIC_PACKET_Msk
#define CPI_PACKET_SIZE_CONTROL 	(0x00008008UL) 	/*<!  */
#define 	CPI_PACKET_SIZE_CONTROL_Pos 	(0x0U)
#define 	CPI_PACKET_SIZE_CONTROL_Msk 	(0x1FFFUL << CPI_PACKET_SIZE_CONTROL_Pos) 	/*!< 0x00001FFF */
#define CPI_PACKET_TIME_CONTROL 	(0x0000800CUL) 	/*<! Packet timing control */
#define 	CPI_PACKET_TIME_CONTROL_PERIOD_Pos 	(0x0U)
#define 	CPI_PACKET_TIME_CONTROL_PERIOD_Msk 	(0xFFFFUL << CPI_PACKET_TIME_CONTROL_PERIOD_Pos) 	/*!< 0x0000FFFF */
#define 	CPI_PACKET_TIME_CONTROL_PERIOD 	CPI_PACKET_TIME_CONTROL_PERIOD_Msk
#define 	CPI_PACKET_TIME_CONTROL_BLANKING_Pos 	(0x10U)
#define 	CPI_PACKET_TIME_CONTROL_BLANKING_Msk 	(0xFFFFUL << CPI_PACKET_TIME_CONTROL_BLANKING_Pos) 	/*!< 0xFFFF0000 */
#define 	CPI_PACKET_TIME_CONTROL_BLANKING 	CPI_PACKET_TIME_CONTROL_BLANKING_Msk
#define CPI_FRAME_SIZE_CONTROL 	(0x00008010UL) 	/*<! Frame size control */
#define 	CPI_FRAME_SIZE_CONTROL_Pos 	(0x0U)
#define 	CPI_FRAME_SIZE_CONTROL_Msk 	(0xFFFFUL << CPI_FRAME_SIZE_CONTROL_Pos) 	/*!< 0x0000FFFF */
#define CPI_FRAME_TIME_CONTROL 	(0x00008014UL) 	/*<! Frame timing control */
#define 	CPI_FRAME_TIME_CONTROL_BLANKING_Pos 	(0x0U)
#define 	CPI_FRAME_TIME_CONTROL_BLANKING_Msk 	(0xFFFFUL << CPI_FRAME_TIME_CONTROL_BLANKING_Pos) 	/*!< 0x0000FFFF */
#define 	CPI_FRAME_TIME_CONTROL_BLANKING 	CPI_FRAME_TIME_CONTROL_BLANKING_Msk
#define CPI_OUTPUT_IF_CONTROL 	(0x00008018UL) 	/*<! output interface control in DCIMI IF */
#define 	CPI_OUTPUT_IF_CONTROL_HSYNC_POL_Pos 	(0x0U)
#define 	CPI_OUTPUT_IF_CONTROL_HSYNC_POL_Msk 	(0x1UL << CPI_OUTPUT_IF_CONTROL_HSYNC_POL_Pos) 	/*!< 0x00000001 */
#define 	CPI_OUTPUT_IF_CONTROL_HSYNC_POL 	CPI_OUTPUT_IF_CONTROL_HSYNC_POL_Msk
#define 	CPI_OUTPUT_IF_CONTROL_VSYNC_POL_Pos 	(0x1U)
#define 	CPI_OUTPUT_IF_CONTROL_VSYNC_POL_Msk 	(0x1UL << CPI_OUTPUT_IF_CONTROL_VSYNC_POL_Pos) 	/*!< 0x00000002 */
#define 	CPI_OUTPUT_IF_CONTROL_VSYNC_POL 	CPI_OUTPUT_IF_CONTROL_VSYNC_POL_Msk
#define CPI_PKT_SELF_TEST 	(0x0000801CUL) 	/*<! Self test control for parallel interface */
#define 	CPI_PKT_SELF_TEST_CTRL_Pos 	(0x0U)
#define 	CPI_PKT_SELF_TEST_CTRL_Msk 	(0x7UL << CPI_PKT_SELF_TEST_CTRL_Pos) 	/*!< 0x00000007 */
#define 	CPI_PKT_SELF_TEST_CTRL 	CPI_PKT_SELF_TEST_CTRL_Msk
#define 	CPI_PKT_SELF_TEST_RATE_Pos 	(0x3U)
#define 	CPI_PKT_SELF_TEST_RATE_Msk 	(0x3FFUL << CPI_PKT_SELF_TEST_RATE_Pos) 	/*!< 0x00001FF8 */
#define 	CPI_PKT_SELF_TEST_RATE 	CPI_PKT_SELF_TEST_RATE_Msk
#define 	CPI_PKT_SELF_TEST_REPEAT_Pos 	(0x10U)
#define 	CPI_PKT_SELF_TEST_REPEAT_Msk 	(0x1FFFUL << CPI_PKT_SELF_TEST_REPEAT_Pos) 	/*!< 0x1FFF0000 */
#define 	CPI_PKT_SELF_TEST_REPEAT 	CPI_PKT_SELF_TEST_REPEAT_Msk
#define CPI_PKT_SELF_TEST_DATA 	(0x00008020UL) 	/*<!  */
#define 	CPI_PKT_SELF_TEST_DATA_Pos 	(0x0U)
#define 	CPI_PKT_SELF_TEST_DATA_Msk 	(0xFFUL << CPI_PKT_SELF_TEST_DATA_Pos) 	/*!< 0x000000FF */

