jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * RO: Read Out Register Map
 * ------------------------------------------------------ */

#define RO_READOUT_CTRL 	(0x00009000UL) 	/*<! Analog readout control. */
#define 	RO_READOUT_CTRL_TEST_PIXEL_MUX_EN_Pos 	(0x0U)
#define 	RO_READOUT_CTRL_TEST_PIXEL_MUX_EN_Msk 	(0x1UL << RO_READOUT_CTRL_TEST_PIXEL_MUX_EN_Pos) 	/*!< 0x00000001 */
#define 	RO_READOUT_CTRL_TEST_PIXEL_MUX_EN 	RO_READOUT_CTRL_TEST_PIXEL_MUX_EN_Msk
#define 	RO_READOUT_CTRL_SELF_TEST_EN_Pos 	(0x1U)
#define 	RO_READOUT_CTRL_SELF_TEST_EN_Msk 	(0x1UL << RO_READOUT_CTRL_SELF_TEST_EN_Pos) 	/*!< 0x00000002 */
#define 	RO_READOUT_CTRL_SELF_TEST_EN 	RO_READOUT_CTRL_SELF_TEST_EN_Msk
#define 	RO_READOUT_CTRL_CPM_RECORD_MODE_EN_Pos 	(0x2U)
#define 	RO_READOUT_CTRL_CPM_RECORD_MODE_EN_Msk 	(0x1UL << RO_READOUT_CTRL_CPM_RECORD_MODE_EN_Pos) 	/*!< 0x00000004 */
#define 	RO_READOUT_CTRL_CPM_RECORD_MODE_EN 	RO_READOUT_CTRL_CPM_RECORD_MODE_EN_Msk
#define 	RO_READOUT_CTRL_ANALOG_PIPE_EN_Pos 	(0x3U)
#define 	RO_READOUT_CTRL_ANALOG_PIPE_EN_Msk 	(0x1UL << RO_READOUT_CTRL_ANALOG_PIPE_EN_Pos) 	/*!< 0x00000008 */
#define 	RO_READOUT_CTRL_ANALOG_PIPE_EN 	RO_READOUT_CTRL_ANALOG_PIPE_EN_Msk
#define 	RO_READOUT_CTRL_ERC_SELF_TEST_EN_Pos 	(0x4U)
#define 	RO_READOUT_CTRL_ERC_SELF_TEST_EN_Msk 	(0x1UL << RO_READOUT_CTRL_ERC_SELF_TEST_EN_Pos) 	/*!< 0x00000010 */
#define 	RO_READOUT_CTRL_ERC_SELF_TEST_EN 	RO_READOUT_CTRL_ERC_SELF_TEST_EN_Msk
#define 	RO_READOUT_CTRL_INV_POL_TD_Pos 	(0x5U)
#define 	RO_READOUT_CTRL_INV_POL_TD_Msk 	(0x1UL << RO_READOUT_CTRL_INV_POL_TD_Pos) 	/*!< 0x00000020 */
#define 	RO_READOUT_CTRL_INV_POL_TD 	RO_READOUT_CTRL_INV_POL_TD_Msk
#define 	RO_READOUT_CTRL_FLIP_X_Pos 	(0x6U)
#define 	RO_READOUT_CTRL_FLIP_X_Msk 	(0x1UL << RO_READOUT_CTRL_FLIP_X_Pos) 	/*!< 0x00000040 */
#define 	RO_READOUT_CTRL_FLIP_X 	RO_READOUT_CTRL_FLIP_X_Msk
#define 	RO_READOUT_CTRL_FLIP_Y_Pos 	(0x7U)
#define 	RO_READOUT_CTRL_FLIP_Y_Msk 	(0x1UL << RO_READOUT_CTRL_FLIP_Y_Pos) 	/*!< 0x00000080 */
#define 	RO_READOUT_CTRL_FLIP_Y 	RO_READOUT_CTRL_FLIP_Y_Msk
#define 	RO_READOUT_CTRL_DIGITAL_PIPE_EN_Pos 	(0x9U)
#define 	RO_READOUT_CTRL_DIGITAL_PIPE_EN_Msk 	(0x1UL << RO_READOUT_CTRL_DIGITAL_PIPE_EN_Pos) 	/*!< 0x00000200 */
#define 	RO_READOUT_CTRL_DIGITAL_PIPE_EN 	RO_READOUT_CTRL_DIGITAL_PIPE_EN_Msk
#define 	RO_READOUT_CTRL_AVOID_BPRESS_TD_Pos 	(0xAU)
#define 	RO_READOUT_CTRL_AVOID_BPRESS_TD_Msk 	(0x1UL << RO_READOUT_CTRL_AVOID_BPRESS_TD_Pos) 	/*!< 0x00000400 */
#define 	RO_READOUT_CTRL_AVOID_BPRESS_TD 	RO_READOUT_CTRL_AVOID_BPRESS_TD_Msk
#define 	RO_READOUT_CTRL_DROP_EN_Pos 	(0xCU)
#define 	RO_READOUT_CTRL_DROP_EN_Msk 	(0x1UL << RO_READOUT_CTRL_DROP_EN_Pos) 	/*!< 0x00001000 */
#define 	RO_READOUT_CTRL_DROP_EN 	RO_READOUT_CTRL_DROP_EN_Msk
#define 	RO_READOUT_CTRL_DROP_ON_FULL_EN_Pos 	(0xDU)
#define 	RO_READOUT_CTRL_DROP_ON_FULL_EN_Msk 	(0x1UL << RO_READOUT_CTRL_DROP_ON_FULL_EN_Pos) 	/*!< 0x00002000 */
#define 	RO_READOUT_CTRL_DROP_ON_FULL_EN 	RO_READOUT_CTRL_DROP_ON_FULL_EN_Msk
#define 	RO_READOUT_CTRL_DELAY_TD_INT_X_ACT_FAL_Pos 	(0xEU)
#define 	RO_READOUT_CTRL_DELAY_TD_INT_X_ACT_FAL_Msk 	(0xFUL << RO_READOUT_CTRL_DELAY_TD_INT_X_ACT_FAL_Pos) 	/*!< 0x0003C000 */
#define 	RO_READOUT_CTRL_DELAY_TD_INT_X_ACT_FAL 	RO_READOUT_CTRL_DELAY_TD_INT_X_ACT_FAL_Msk
#define 	RO_READOUT_CTRL_DELAY_TD_INT_X_ACT_RIS_Pos 	(0x12U)
#define 	RO_READOUT_CTRL_DELAY_TD_INT_X_ACT_RIS_Msk 	(0xFUL << RO_READOUT_CTRL_DELAY_TD_INT_X_ACT_RIS_Pos) 	/*!< 0x003C0000 */
#define 	RO_READOUT_CTRL_DELAY_TD_INT_X_ACT_RIS 	RO_READOUT_CTRL_DELAY_TD_INT_X_ACT_RIS_Msk
#define RO_RO_FSM_CTRL 	(0x00009004UL) 	/*<! Readout state machine delays. */
#define 	RO_FSM_CTRL_DELAY_SAMPLE_LINE_Pos 	(0x0U)
#define 	RO_FSM_CTRL_DELAY_SAMPLE_LINE_Msk 	(0x1FFUL << RO_FSM_CTRL_DELAY_SAMPLE_LINE_Pos) 	/*!< 0x000001FF */
#define 	RO_FSM_CTRL_DELAY_SAMPLE_LINE 	RO_FSM_CTRL_DELAY_SAMPLE_LINE_Msk
#define 	RO_FSM_CTRL_DELAY_RELEASE_ACK_Pos 	(0x9U)
#define 	RO_FSM_CTRL_DELAY_RELEASE_ACK_Msk 	(0x1FFUL << RO_FSM_CTRL_DELAY_RELEASE_ACK_Pos) 	/*!< 0x0003FE00 */
#define 	RO_FSM_CTRL_DELAY_RELEASE_ACK 	RO_FSM_CTRL_DELAY_RELEASE_ACK_Msk
#define RO_TIME_BASE_CTRL 	(0x00009008UL) 	/*<! Time Base Configuration. */
#define 	RO_TIME_BASE_CTRL_ENABLE_Pos 	(0x0U)
#define 	RO_TIME_BASE_CTRL_ENABLE_Msk 	(0x1UL << RO_TIME_BASE_CTRL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	RO_TIME_BASE_CTRL_ENABLE 	RO_TIME_BASE_CTRL_ENABLE_Msk
#define 	RO_TIME_BASE_CTRL_MODE_Pos 	(0x1U)
#define 	RO_TIME_BASE_CTRL_MODE_Msk 	(0x1UL << RO_TIME_BASE_CTRL_MODE_Pos) 	/*!< 0x00000002 */
#define 	RO_TIME_BASE_CTRL_MODE 	RO_TIME_BASE_CTRL_MODE_Msk
#define 	RO_TIME_BASE_CTRL_EXTERNAL_MODE_Pos 	(0x2U)
#define 	RO_TIME_BASE_CTRL_EXTERNAL_MODE_Msk 	(0x1UL << RO_TIME_BASE_CTRL_EXTERNAL_MODE_Pos) 	/*!< 0x00000004 */
#define 	RO_TIME_BASE_CTRL_EXTERNAL_MODE 	RO_TIME_BASE_CTRL_EXTERNAL_MODE_Msk
#define 	RO_TIME_BASE_CTRL_EXTERNAL_MODE_ENABLE_Pos 	(0x3U)
#define 	RO_TIME_BASE_CTRL_EXTERNAL_MODE_ENABLE_Msk 	(0x1UL << RO_TIME_BASE_CTRL_EXTERNAL_MODE_ENABLE_Pos) 	/*!< 0x00000008 */
#define 	RO_TIME_BASE_CTRL_EXTERNAL_MODE_ENABLE 	RO_TIME_BASE_CTRL_EXTERNAL_MODE_ENABLE_Msk
#define 	RO_TIME_BASE_CTRL_US_COUNTER_MAX_Pos 	(0x4U)
#define 	RO_TIME_BASE_CTRL_US_COUNTER_MAX_Msk 	(0x7FUL << RO_TIME_BASE_CTRL_US_COUNTER_MAX_Pos) 	/*!< 0x000007F0 */
#define 	RO_TIME_BASE_CTRL_US_COUNTER_MAX 	RO_TIME_BASE_CTRL_US_COUNTER_MAX_Msk
#define 	RO_TIME_BASE_CTRL_TH_EVERY_64US_EN_Pos 	(0xBU)
#define 	RO_TIME_BASE_CTRL_TH_EVERY_64US_EN_Msk 	(0x1UL << RO_TIME_BASE_CTRL_TH_EVERY_64US_EN_Pos) 	/*!< 0x00000800 */
#define 	RO_TIME_BASE_CTRL_TH_EVERY_64US_EN 	RO_TIME_BASE_CTRL_TH_EVERY_64US_EN_Msk
#define 	RO_TIME_BASE_CTRL_SRST_Pos 	(0x10U)
#define 	RO_TIME_BASE_CTRL_SRST_Msk 	(0x1UL << RO_TIME_BASE_CTRL_SRST_Pos) 	/*!< 0x00010000 */
#define 	RO_TIME_BASE_CTRL_SRST 	RO_TIME_BASE_CTRL_SRST_Msk
#define RO_OOR_CTRL 	(0x0000900CUL) 	/*<!  */
#define 	RO_OOR_CTRL_CROP_ENABLE_Pos 	(0x0U)
#define 	RO_OOR_CTRL_CROP_ENABLE_Msk 	(0x1UL << RO_OOR_CTRL_CROP_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	RO_OOR_CTRL_CROP_ENABLE 	RO_OOR_CTRL_CROP_ENABLE_Msk
#define 	RO_OOR_CTRL_DETECT_ENABLE_Pos 	(0x1U)
#define 	RO_OOR_CTRL_DETECT_ENABLE_Msk 	(0x1UL << RO_OOR_CTRL_DETECT_ENABLE_Pos) 	/*!< 0x00000002 */
#define 	RO_OOR_CTRL_DETECT_ENABLE 	RO_OOR_CTRL_DETECT_ENABLE_Msk
#define 	RO_OOR_CTRL_RM_TD_Pos 	(0x2U)
#define 	RO_OOR_CTRL_RM_TD_Msk 	(0x1UL << RO_OOR_CTRL_RM_TD_Pos) 	/*!< 0x00000004 */
#define 	RO_OOR_CTRL_RM_TD 	RO_OOR_CTRL_RM_TD_Msk
#define 	RO_OOR_CTRL_CROP_RESET_ORIG_Pos 	(0x4U)
#define 	RO_OOR_CTRL_CROP_RESET_ORIG_Msk 	(0x1UL << RO_OOR_CTRL_CROP_RESET_ORIG_Pos) 	/*!< 0x00000010 */
#define 	RO_OOR_CTRL_CROP_RESET_ORIG 	RO_OOR_CTRL_CROP_RESET_ORIG_Msk
#define RO_OOR_START_POS 	(0x00009010UL) 	/*<! Window start position */
#define 	RO_OOR_START_POS_CROP_X_Pos 	(0x0U)
#define 	RO_OOR_START_POS_CROP_X_Msk 	(0x1FFUL << RO_OOR_START_POS_CROP_X_Pos) 	/*!< 0x000001FF */
#define 	RO_OOR_START_POS_CROP_X 	RO_OOR_START_POS_CROP_X_Msk
#define 	RO_OOR_START_POS_CROP_Y_Pos 	(0x10U)
#define 	RO_OOR_START_POS_CROP_Y_Msk 	(0x1FFUL << RO_OOR_START_POS_CROP_Y_Pos) 	/*!< 0x01FF0000 */
#define 	RO_OOR_START_POS_CROP_Y 	RO_OOR_START_POS_CROP_Y_Msk
#define RO_OOR_END_POS 	(0x00009014UL) 	/*<! Window end position */
#define 	RO_OOR_END_POS_CROP_X_Pos 	(0x0U)
#define 	RO_OOR_END_POS_CROP_X_Msk 	(0x1FFUL << RO_OOR_END_POS_CROP_X_Pos) 	/*!< 0x000001FF */
#define 	RO_OOR_END_POS_CROP_X 	RO_OOR_END_POS_CROP_X_Msk
#define 	RO_OOR_END_POS_CROP_Y_Pos 	(0x10U)
#define 	RO_OOR_END_POS_CROP_Y_Msk 	(0x1FFUL << RO_OOR_END_POS_CROP_Y_Pos) 	/*!< 0x01FF0000 */
#define 	RO_OOR_END_POS_CROP_Y 	RO_OOR_END_POS_CROP_Y_Msk
#define RO_OOR_TD_CNT 	(0x00009018UL) 	/*<! TD out of range counter */
#define 	RO_OOR_TD_CNT_VAL_Pos 	(0x0U)
#define 	RO_OOR_TD_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_OOR_TD_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_OOR_TD_CNT_VAL 	RO_OOR_TD_CNT_VAL_Msk
#define RO_SELF_TEST_DATA 	(0x0000901CUL) 	/*<! RO or ESP self test EVT21 data */
#define 	RO_SELF_TEST_DATA_Pos 	(0x0U)
#define 	RO_SELF_TEST_DATA_Msk 	(0xFFFFFFFFUL << RO_SELF_TEST_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define RO_OOR_TD_ADDR 	(0x00009020UL) 	/*<! Out of range TD event information */
#define 	RO_OOR_TD_ADDR_X_Pos 	(0x0U)
#define 	RO_OOR_TD_ADDR_X_Msk 	(0x7FFUL << RO_OOR_TD_ADDR_X_Pos) 	/*!< 0x000007FF */
#define 	RO_OOR_TD_ADDR_X 	RO_OOR_TD_ADDR_X_Msk
#define 	RO_OOR_TD_ADDR_Y_Pos 	(0xBU)
#define 	RO_OOR_TD_ADDR_Y_Msk 	(0x3FFUL << RO_OOR_TD_ADDR_Y_Pos) 	/*!< 0x001FF800 */
#define 	RO_OOR_TD_ADDR_Y 	RO_OOR_TD_ADDR_Y_Msk
#define 	RO_OOR_TD_ADDR_POL_Pos 	(0x15U)
#define 	RO_OOR_TD_ADDR_POL_Msk 	(0x1UL << RO_OOR_TD_ADDR_POL_Pos) 	/*!< 0x00200000 */
#define 	RO_OOR_TD_ADDR_POL 	RO_OOR_TD_ADDR_POL_Msk
#define RO_PIPELINE_STATUS 	(0x00009024UL) 	/*<! Readout status */
#define 	RO_PIPELINE_STATUS_EMPTY_Pos 	(0x0U)
#define 	RO_PIPELINE_STATUS_EMPTY_Msk 	(0x1UL << RO_PIPELINE_STATUS_EMPTY_Pos) 	/*!< 0x00000001 */
#define 	RO_PIPELINE_STATUS_EMPTY 	RO_PIPELINE_STATUS_EMPTY_Msk
#define 	RO_PIPELINE_STATUS_BUSY_Pos 	(0x1U)
#define 	RO_PIPELINE_STATUS_BUSY_Msk 	(0x1UL << RO_PIPELINE_STATUS_BUSY_Pos) 	/*!< 0x00000002 */
#define 	RO_PIPELINE_STATUS_BUSY 	RO_PIPELINE_STATUS_BUSY_Msk
#define 	RO_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Pos 	(0x2U)
#define 	RO_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Msk 	(0x1UL << RO_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Pos) 	/*!< 0x00000004 */
#define 	RO_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN 	RO_PIPELINE_STATUS_DEEP_LOW_POWER_SEEN_Msk
#define RO_RO_LP_CTRL 	(0x00009028UL) 	/*<! Activity map and low power ctrl */
#define 	RO_LP_CTRL_CNT_EN_Pos 	(0x0U)
#define 	RO_LP_CTRL_CNT_EN_Msk 	(0x1UL << RO_LP_CTRL_CNT_EN_Pos) 	/*!< 0x00000001 */
#define 	RO_LP_CTRL_CNT_EN 	RO_LP_CTRL_CNT_EN_Msk
#define 	RO_LP_CTRL_OUTPUT_DISABLE_Pos 	(0x1U)
#define 	RO_LP_CTRL_OUTPUT_DISABLE_Msk 	(0x1UL << RO_LP_CTRL_OUTPUT_DISABLE_Pos) 	/*!< 0x00000002 */
#define 	RO_LP_CTRL_OUTPUT_DISABLE 	RO_LP_CTRL_OUTPUT_DISABLE_Msk
#define 	RO_LP_CTRL_KEEP_TH_Pos 	(0x2U)
#define 	RO_LP_CTRL_KEEP_TH_Msk 	(0x1UL << RO_LP_CTRL_KEEP_TH_Pos) 	/*!< 0x00000004 */
#define 	RO_LP_CTRL_KEEP_TH 	RO_LP_CTRL_KEEP_TH_Msk
#define RO_LP_X0 	(0x0000902CUL) 	/*<!  */
#define 	RO_LP_X0_ADDR_Pos 	(0x0U)
#define 	RO_LP_X0_ADDR_Msk 	(0x1FFUL << RO_LP_X0_ADDR_Pos) 	/*!< 0x000001FF */
#define 	RO_LP_X0_ADDR 	RO_LP_X0_ADDR_Msk
#define RO_LP_X1 	(0x00009030UL) 	/*<!  */
#define 	RO_LP_X1_ADDR_Pos 	(0x0U)
#define 	RO_LP_X1_ADDR_Msk 	(0x1FFUL << RO_LP_X1_ADDR_Pos) 	/*!< 0x000001FF */
#define 	RO_LP_X1_ADDR 	RO_LP_X1_ADDR_Msk
#define RO_LP_X2 	(0x00009034UL) 	/*<!  */
#define 	RO_LP_X2_ADDR_Pos 	(0x0U)
#define 	RO_LP_X2_ADDR_Msk 	(0x1FFUL << RO_LP_X2_ADDR_Pos) 	/*!< 0x000001FF */
#define 	RO_LP_X2_ADDR 	RO_LP_X2_ADDR_Msk
#define RO_LP_X3 	(0x00009038UL) 	/*<!  */
#define 	RO_LP_X3_ADDR_Pos 	(0x0U)
#define 	RO_LP_X3_ADDR_Msk 	(0x1FFUL << RO_LP_X3_ADDR_Pos) 	/*!< 0x000001FF */
#define 	RO_LP_X3_ADDR 	RO_LP_X3_ADDR_Msk
#define RO_LP_X4 	(0x0000903CUL) 	/*<!  */
#define 	RO_LP_X4_ADDR_Pos 	(0x0U)
#define 	RO_LP_X4_ADDR_Msk 	(0x1FFUL << RO_LP_X4_ADDR_Pos) 	/*!< 0x000001FF */
#define 	RO_LP_X4_ADDR 	RO_LP_X4_ADDR_Msk
#define RO_LP_Y0 	(0x00009040UL) 	/*<!  */
#define 	RO_LP_Y0_ADDR_Pos 	(0x0U)
#define 	RO_LP_Y0_ADDR_Msk 	(0x1FFUL << RO_LP_Y0_ADDR_Pos) 	/*!< 0x000001FF */
#define 	RO_LP_Y0_ADDR 	RO_LP_Y0_ADDR_Msk
#define RO_LP_Y1 	(0x00009044UL) 	/*<!  */
#define 	RO_LP_Y1_ADDR_Pos 	(0x0U)
#define 	RO_LP_Y1_ADDR_Msk 	(0x1FFUL << RO_LP_Y1_ADDR_Pos) 	/*!< 0x000001FF */
#define 	RO_LP_Y1_ADDR 	RO_LP_Y1_ADDR_Msk
#define RO_LP_Y2 	(0x00009048UL) 	/*<!  */
#define 	RO_LP_Y2_ADDR_Pos 	(0x0U)
#define 	RO_LP_Y2_ADDR_Msk 	(0x1FFUL << RO_LP_Y2_ADDR_Pos) 	/*!< 0x000001FF */
#define 	RO_LP_Y2_ADDR 	RO_LP_Y2_ADDR_Msk
#define RO_LP_Y3 	(0x0000904CUL) 	/*<!  */
#define 	RO_LP_Y3_ADDR_Pos 	(0x0U)
#define 	RO_LP_Y3_ADDR_Msk 	(0x1FFUL << RO_LP_Y3_ADDR_Pos) 	/*!< 0x000001FF */
#define 	RO_LP_Y3_ADDR 	RO_LP_Y3_ADDR_Msk
#define RO_LP_Y4 	(0x00009050UL) 	/*<!  */
#define 	RO_LP_Y4_ADDR_Pos 	(0x0U)
#define 	RO_LP_Y4_ADDR_Msk 	(0x1FFUL << RO_LP_Y4_ADDR_Pos) 	/*!< 0x000001FF */
#define 	RO_LP_Y4_ADDR 	RO_LP_Y4_ADDR_Msk
#define RO_SHADOW_CTRL 	(0x00009054UL) 	/*<! Atomic register read ctrl */
#define 	RO_SHADOW_CTRL_TIMER_EN_Pos 	(0x0U)
#define 	RO_SHADOW_CTRL_TIMER_EN_Msk 	(0x1UL << RO_SHADOW_CTRL_TIMER_EN_Pos) 	/*!< 0x00000001 */
#define 	RO_SHADOW_CTRL_TIMER_EN 	RO_SHADOW_CTRL_TIMER_EN_Msk
#define 	RO_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos 	(0x1U)
#define 	RO_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk 	(0x1UL << RO_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos) 	/*!< 0x00000002 */
#define 	RO_SHADOW_CTRL_IRQ_SW_OVERRIDE 	RO_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk
#define 	RO_SHADOW_CTRL_RESET_ON_COPY_Pos 	(0x2U)
#define 	RO_SHADOW_CTRL_RESET_ON_COPY_Msk 	(0x1UL << RO_SHADOW_CTRL_RESET_ON_COPY_Pos) 	/*!< 0x00000004 */
#define 	RO_SHADOW_CTRL_RESET_ON_COPY 	RO_SHADOW_CTRL_RESET_ON_COPY_Msk
#define RO_SHADOW_TIMER_THRESHOLD 	(0x00009058UL) 	/*<! Atomic register timer */
#define 	RO_SHADOW_TIMER_THRESHOLD_Pos 	(0x0U)
#define 	RO_SHADOW_TIMER_THRESHOLD_Msk 	(0xFFFFFFFFUL << RO_SHADOW_TIMER_THRESHOLD_Pos) 	/*!< 0xFFFFFFFF */
#define RO_SHADOW_STATUS 	(0x0000905CUL) 	/*<! Atomic register read ctrl */
#define 	RO_SHADOW_STATUS_VALID_Pos 	(0x0U)
#define 	RO_SHADOW_STATUS_VALID_Msk 	(0x1UL << RO_SHADOW_STATUS_VALID_Pos) 	/*!< 0x00000001 */
#define 	RO_SHADOW_STATUS_VALID 	RO_SHADOW_STATUS_VALID_Msk
#define 	RO_SHADOW_STATUS_OVERRUN_Pos 	(0x1U)
#define 	RO_SHADOW_STATUS_OVERRUN_Msk 	(0x1UL << RO_SHADOW_STATUS_OVERRUN_Pos) 	/*!< 0x00000002 */
#define 	RO_SHADOW_STATUS_OVERRUN 	RO_SHADOW_STATUS_OVERRUN_Msk
#define RO_SW_EVT_BYPASS_MSB 	(0x00009060UL) 	/*<!  */
#define 	RO_SW_EVT_BYPASS_MSB_VAL_Pos 	(0x0U)
#define 	RO_SW_EVT_BYPASS_MSB_VAL_Msk 	(0xFFFFFFFFUL << RO_SW_EVT_BYPASS_MSB_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_SW_EVT_BYPASS_MSB_VAL 	RO_SW_EVT_BYPASS_MSB_VAL_Msk
#define RO_SW_EVT_BYPASS_LSB 	(0x00009064UL) 	/*<!  */
#define 	RO_SW_EVT_BYPASS_LSB_VAL_Pos 	(0x0U)
#define 	RO_SW_EVT_BYPASS_LSB_VAL_Msk 	(0xFFFFFFFFUL << RO_SW_EVT_BYPASS_LSB_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_SW_EVT_BYPASS_LSB_VAL 	RO_SW_EVT_BYPASS_LSB_VAL_Msk
#define RO_SW_EVT_BYPASS_CTRL 	(0x00009068UL) 	/*<! Software event bypass control */
#define 	RO_SW_EVT_BYPASS_CTRL_EN_Pos 	(0x0U)
#define 	RO_SW_EVT_BYPASS_CTRL_EN_Msk 	(0x1UL << RO_SW_EVT_BYPASS_CTRL_EN_Pos) 	/*!< 0x00000001 */
#define 	RO_SW_EVT_BYPASS_CTRL_EN 	RO_SW_EVT_BYPASS_CTRL_EN_Msk
#define 	RO_SW_EVT_BYPASS_CTRL_TRIG_Pos 	(0x1U)
#define 	RO_SW_EVT_BYPASS_CTRL_TRIG_Msk 	(0x1UL << RO_SW_EVT_BYPASS_CTRL_TRIG_Pos) 	/*!< 0x00000002 */
#define 	RO_SW_EVT_BYPASS_CTRL_TRIG 	RO_SW_EVT_BYPASS_CTRL_TRIG_Msk
#define 	RO_SW_EVT_BYPASS_CTRL_FIRST_Pos 	(0x2U)
#define 	RO_SW_EVT_BYPASS_CTRL_FIRST_Msk 	(0x1UL << RO_SW_EVT_BYPASS_CTRL_FIRST_Pos) 	/*!< 0x00000004 */
#define 	RO_SW_EVT_BYPASS_CTRL_FIRST 	RO_SW_EVT_BYPASS_CTRL_FIRST_Msk
#define 	RO_SW_EVT_BYPASS_CTRL_STATUS_Pos 	(0x3U)
#define 	RO_SW_EVT_BYPASS_CTRL_STATUS_Msk 	(0x1UL << RO_SW_EVT_BYPASS_CTRL_STATUS_Pos) 	/*!< 0x00000008 */
#define 	RO_SW_EVT_BYPASS_CTRL_STATUS 	RO_SW_EVT_BYPASS_CTRL_STATUS_Msk
#define RO_CRAZY_PIXEL_CTRL00 	(0x00009100UL) 	/*<! Coordinates and validity of CPM entry number 00 */
#define 	RO_CRAZY_PIXEL_CTRL00_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL00_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL00_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL00_X_GROUP 	RO_CRAZY_PIXEL_CTRL00_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL00_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL00_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL00_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL00_Y 	RO_CRAZY_PIXEL_CTRL00_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL00_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL00_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL00_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL00_VALID 	RO_CRAZY_PIXEL_CTRL00_VALID_Msk
#define RO_CRAZY_PIXEL_DATA00 	(0x00009104UL) 	/*<! 32-pixel group of CPM entry number 01 */
#define 	RO_CRAZY_PIXEL_DATA00_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA00_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA00_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA00_DATA 	RO_CRAZY_PIXEL_DATA00_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL01 	(0x00009108UL) 	/*<! Coordinates and validity of CPM entry number 02 */
#define 	RO_CRAZY_PIXEL_CTRL01_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL01_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL01_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL01_X_GROUP 	RO_CRAZY_PIXEL_CTRL01_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL01_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL01_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL01_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL01_Y 	RO_CRAZY_PIXEL_CTRL01_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL01_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL01_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL01_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL01_VALID 	RO_CRAZY_PIXEL_CTRL01_VALID_Msk
#define RO_CRAZY_PIXEL_DATA01 	(0x0000910CUL) 	/*<! 32-pixel group of CPM entry number 03 */
#define 	RO_CRAZY_PIXEL_DATA01_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA01_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA01_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA01_DATA 	RO_CRAZY_PIXEL_DATA01_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL02 	(0x00009110UL) 	/*<! Coordinates and validity of CPM entry number 04 */
#define 	RO_CRAZY_PIXEL_CTRL02_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL02_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL02_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL02_X_GROUP 	RO_CRAZY_PIXEL_CTRL02_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL02_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL02_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL02_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL02_Y 	RO_CRAZY_PIXEL_CTRL02_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL02_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL02_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL02_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL02_VALID 	RO_CRAZY_PIXEL_CTRL02_VALID_Msk
#define RO_CRAZY_PIXEL_DATA02 	(0x00009114UL) 	/*<! 32-pixel group of CPM entry number 05 */
#define 	RO_CRAZY_PIXEL_DATA02_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA02_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA02_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA02_DATA 	RO_CRAZY_PIXEL_DATA02_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL03 	(0x00009118UL) 	/*<! Coordinates and validity of CPM entry number 06 */
#define 	RO_CRAZY_PIXEL_CTRL03_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL03_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL03_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL03_X_GROUP 	RO_CRAZY_PIXEL_CTRL03_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL03_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL03_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL03_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL03_Y 	RO_CRAZY_PIXEL_CTRL03_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL03_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL03_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL03_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL03_VALID 	RO_CRAZY_PIXEL_CTRL03_VALID_Msk
#define RO_CRAZY_PIXEL_DATA03 	(0x0000911CUL) 	/*<! 32-pixel group of CPM entry number 07 */
#define 	RO_CRAZY_PIXEL_DATA03_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA03_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA03_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA03_DATA 	RO_CRAZY_PIXEL_DATA03_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL04 	(0x00009120UL) 	/*<! Coordinates and validity of CPM entry number 08 */
#define 	RO_CRAZY_PIXEL_CTRL04_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL04_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL04_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL04_X_GROUP 	RO_CRAZY_PIXEL_CTRL04_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL04_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL04_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL04_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL04_Y 	RO_CRAZY_PIXEL_CTRL04_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL04_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL04_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL04_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL04_VALID 	RO_CRAZY_PIXEL_CTRL04_VALID_Msk
#define RO_CRAZY_PIXEL_DATA04 	(0x00009124UL) 	/*<! 32-pixel group of CPM entry number 09 */
#define 	RO_CRAZY_PIXEL_DATA04_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA04_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA04_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA04_DATA 	RO_CRAZY_PIXEL_DATA04_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL05 	(0x00009128UL) 	/*<! Coordinates and validity of CPM entry number 10 */
#define 	RO_CRAZY_PIXEL_CTRL05_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL05_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL05_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL05_X_GROUP 	RO_CRAZY_PIXEL_CTRL05_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL05_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL05_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL05_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL05_Y 	RO_CRAZY_PIXEL_CTRL05_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL05_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL05_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL05_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL05_VALID 	RO_CRAZY_PIXEL_CTRL05_VALID_Msk
#define RO_CRAZY_PIXEL_DATA05 	(0x0000912CUL) 	/*<! 32-pixel group of CPM entry number 11 */
#define 	RO_CRAZY_PIXEL_DATA05_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA05_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA05_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA05_DATA 	RO_CRAZY_PIXEL_DATA05_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL06 	(0x00009130UL) 	/*<! Coordinates and validity of CPM entry number 12 */
#define 	RO_CRAZY_PIXEL_CTRL06_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL06_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL06_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL06_X_GROUP 	RO_CRAZY_PIXEL_CTRL06_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL06_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL06_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL06_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL06_Y 	RO_CRAZY_PIXEL_CTRL06_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL06_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL06_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL06_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL06_VALID 	RO_CRAZY_PIXEL_CTRL06_VALID_Msk
#define RO_CRAZY_PIXEL_DATA06 	(0x00009134UL) 	/*<! 32-pixel group of CPM entry number 13 */
#define 	RO_CRAZY_PIXEL_DATA06_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA06_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA06_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA06_DATA 	RO_CRAZY_PIXEL_DATA06_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL07 	(0x00009138UL) 	/*<! Coordinates and validity of CPM entry number 14 */
#define 	RO_CRAZY_PIXEL_CTRL07_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL07_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL07_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL07_X_GROUP 	RO_CRAZY_PIXEL_CTRL07_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL07_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL07_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL07_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL07_Y 	RO_CRAZY_PIXEL_CTRL07_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL07_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL07_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL07_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL07_VALID 	RO_CRAZY_PIXEL_CTRL07_VALID_Msk
#define RO_CRAZY_PIXEL_DATA07 	(0x0000913CUL) 	/*<! 32-pixel group of CPM entry number 15 */
#define 	RO_CRAZY_PIXEL_DATA07_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA07_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA07_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA07_DATA 	RO_CRAZY_PIXEL_DATA07_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL08 	(0x00009140UL) 	/*<! Coordinates and validity of CPM entry number 16 */
#define 	RO_CRAZY_PIXEL_CTRL08_X_GROUP_Pos 	(0x0U)
