jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	RO_CRAZY_PIXEL_CTRL08_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL08_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL08_X_GROUP 	RO_CRAZY_PIXEL_CTRL08_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL08_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL08_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL08_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL08_Y 	RO_CRAZY_PIXEL_CTRL08_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL08_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL08_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL08_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL08_VALID 	RO_CRAZY_PIXEL_CTRL08_VALID_Msk
#define RO_CRAZY_PIXEL_DATA08 	(0x00009144UL) 	/*<! 32-pixel group of CPM entry number 17 */
#define 	RO_CRAZY_PIXEL_DATA08_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA08_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA08_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA08_DATA 	RO_CRAZY_PIXEL_DATA08_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL09 	(0x00009148UL) 	/*<! Coordinates and validity of CPM entry number 18 */
#define 	RO_CRAZY_PIXEL_CTRL09_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL09_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL09_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL09_X_GROUP 	RO_CRAZY_PIXEL_CTRL09_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL09_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL09_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL09_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL09_Y 	RO_CRAZY_PIXEL_CTRL09_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL09_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL09_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL09_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL09_VALID 	RO_CRAZY_PIXEL_CTRL09_VALID_Msk
#define RO_CRAZY_PIXEL_DATA09 	(0x0000914CUL) 	/*<! 32-pixel group of CPM entry number 19 */
#define 	RO_CRAZY_PIXEL_DATA09_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA09_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA09_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA09_DATA 	RO_CRAZY_PIXEL_DATA09_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL10 	(0x00009150UL) 	/*<! Coordinates and validity of CPM entry number 20 */
#define 	RO_CRAZY_PIXEL_CTRL10_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL10_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL10_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL10_X_GROUP 	RO_CRAZY_PIXEL_CTRL10_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL10_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL10_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL10_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL10_Y 	RO_CRAZY_PIXEL_CTRL10_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL10_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL10_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL10_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL10_VALID 	RO_CRAZY_PIXEL_CTRL10_VALID_Msk
#define RO_CRAZY_PIXEL_DATA10 	(0x00009154UL) 	/*<! 32-pixel group of CPM entry number 21 */
#define 	RO_CRAZY_PIXEL_DATA10_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA10_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA10_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA10_DATA 	RO_CRAZY_PIXEL_DATA10_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL11 	(0x00009158UL) 	/*<! Coordinates and validity of CPM entry number 22 */
#define 	RO_CRAZY_PIXEL_CTRL11_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL11_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL11_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL11_X_GROUP 	RO_CRAZY_PIXEL_CTRL11_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL11_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL11_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL11_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL11_Y 	RO_CRAZY_PIXEL_CTRL11_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL11_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL11_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL11_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL11_VALID 	RO_CRAZY_PIXEL_CTRL11_VALID_Msk
#define RO_CRAZY_PIXEL_DATA11 	(0x0000915CUL) 	/*<! 32-pixel group of CPM entry number 23 */
#define 	RO_CRAZY_PIXEL_DATA11_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA11_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA11_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA11_DATA 	RO_CRAZY_PIXEL_DATA11_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL12 	(0x00009160UL) 	/*<! Coordinates and validity of CPM entry number 24 */
#define 	RO_CRAZY_PIXEL_CTRL12_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL12_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL12_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL12_X_GROUP 	RO_CRAZY_PIXEL_CTRL12_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL12_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL12_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL12_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL12_Y 	RO_CRAZY_PIXEL_CTRL12_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL12_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL12_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL12_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL12_VALID 	RO_CRAZY_PIXEL_CTRL12_VALID_Msk
#define RO_CRAZY_PIXEL_DATA12 	(0x00009164UL) 	/*<! 32-pixel group of CPM entry number 25 */
#define 	RO_CRAZY_PIXEL_DATA12_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA12_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA12_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA12_DATA 	RO_CRAZY_PIXEL_DATA12_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL13 	(0x00009168UL) 	/*<! Coordinates and validity of CPM entry number 26 */
#define 	RO_CRAZY_PIXEL_CTRL13_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL13_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL13_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL13_X_GROUP 	RO_CRAZY_PIXEL_CTRL13_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL13_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL13_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL13_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL13_Y 	RO_CRAZY_PIXEL_CTRL13_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL13_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL13_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL13_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL13_VALID 	RO_CRAZY_PIXEL_CTRL13_VALID_Msk
#define RO_CRAZY_PIXEL_DATA13 	(0x0000916CUL) 	/*<! 32-pixel group of CPM entry number 27 */
#define 	RO_CRAZY_PIXEL_DATA13_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA13_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA13_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA13_DATA 	RO_CRAZY_PIXEL_DATA13_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL14 	(0x00009170UL) 	/*<! Coordinates and validity of CPM entry number 28 */
#define 	RO_CRAZY_PIXEL_CTRL14_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL14_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL14_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL14_X_GROUP 	RO_CRAZY_PIXEL_CTRL14_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL14_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL14_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL14_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL14_Y 	RO_CRAZY_PIXEL_CTRL14_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL14_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL14_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL14_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL14_VALID 	RO_CRAZY_PIXEL_CTRL14_VALID_Msk
#define RO_CRAZY_PIXEL_DATA14 	(0x00009174UL) 	/*<! 32-pixel group of CPM entry number 29 */
#define 	RO_CRAZY_PIXEL_DATA14_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA14_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA14_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA14_DATA 	RO_CRAZY_PIXEL_DATA14_DATA_Msk
#define RO_CRAZY_PIXEL_CTRL15 	(0x00009178UL) 	/*<! Coordinates and validity of CPM entry number 30 */
#define 	RO_CRAZY_PIXEL_CTRL15_X_GROUP_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_CTRL15_X_GROUP_Msk 	(0xFUL << RO_CRAZY_PIXEL_CTRL15_X_GROUP_Pos) 	/*!< 0x0000000F */
#define 	RO_CRAZY_PIXEL_CTRL15_X_GROUP 	RO_CRAZY_PIXEL_CTRL15_X_GROUP_Msk
#define 	RO_CRAZY_PIXEL_CTRL15_Y_Pos 	(0x4U)
#define 	RO_CRAZY_PIXEL_CTRL15_Y_Msk 	(0x1FFUL << RO_CRAZY_PIXEL_CTRL15_Y_Pos) 	/*!< 0x00001FF0 */
#define 	RO_CRAZY_PIXEL_CTRL15_Y 	RO_CRAZY_PIXEL_CTRL15_Y_Msk
#define 	RO_CRAZY_PIXEL_CTRL15_VALID_Pos 	(0x1FU)
#define 	RO_CRAZY_PIXEL_CTRL15_VALID_Msk 	(0x1UL << RO_CRAZY_PIXEL_CTRL15_VALID_Pos) 	/*!< 0x80000000 */
#define 	RO_CRAZY_PIXEL_CTRL15_VALID 	RO_CRAZY_PIXEL_CTRL15_VALID_Msk
#define RO_CRAZY_PIXEL_DATA15 	(0x0000917CUL) 	/*<! 32-pixel group of CPM entry number 31 */
#define 	RO_CRAZY_PIXEL_DATA15_DATA_Pos 	(0x0U)
#define 	RO_CRAZY_PIXEL_DATA15_DATA_Msk 	(0xFFFFFFFFUL << RO_CRAZY_PIXEL_DATA15_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_CRAZY_PIXEL_DATA15_DATA 	RO_CRAZY_PIXEL_DATA15_DATA_Msk
#define RO_LP_CNT00 	(0x00009200UL) 	/*<! lp_event_counter_00 */
#define 	RO_LP_CNT00_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT00_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT00_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT00_CNT_VAL 	RO_LP_CNT00_CNT_VAL_Msk
#define RO_LP_CNT01 	(0x00009204UL) 	/*<! lp_event_counter_01 */
#define 	RO_LP_CNT01_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT01_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT01_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT01_CNT_VAL 	RO_LP_CNT01_CNT_VAL_Msk
#define RO_LP_CNT02 	(0x00009208UL) 	/*<! lp_event_counter_02 */
#define 	RO_LP_CNT02_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT02_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT02_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT02_CNT_VAL 	RO_LP_CNT02_CNT_VAL_Msk
#define RO_LP_CNT03 	(0x0000920CUL) 	/*<! lp_event_counter_03 */
#define 	RO_LP_CNT03_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT03_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT03_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT03_CNT_VAL 	RO_LP_CNT03_CNT_VAL_Msk
#define RO_LP_CNT04 	(0x00009210UL) 	/*<! lp_event_counter_04 */
#define 	RO_LP_CNT04_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT04_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT04_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT04_CNT_VAL 	RO_LP_CNT04_CNT_VAL_Msk
#define RO_LP_CNT05 	(0x00009214UL) 	/*<! lp_event_counter_05 */
#define 	RO_LP_CNT05_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT05_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT05_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT05_CNT_VAL 	RO_LP_CNT05_CNT_VAL_Msk
#define RO_LP_CNT06 	(0x00009218UL) 	/*<! lp_event_counter_06 */
#define 	RO_LP_CNT06_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT06_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT06_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT06_CNT_VAL 	RO_LP_CNT06_CNT_VAL_Msk
#define RO_LP_CNT07 	(0x0000921CUL) 	/*<! lp_event_counter_07 */
#define 	RO_LP_CNT07_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT07_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT07_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT07_CNT_VAL 	RO_LP_CNT07_CNT_VAL_Msk
#define RO_LP_CNT08 	(0x00009220UL) 	/*<! lp_event_counter_08 */
#define 	RO_LP_CNT08_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT08_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT08_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT08_CNT_VAL 	RO_LP_CNT08_CNT_VAL_Msk
#define RO_LP_CNT09 	(0x00009224UL) 	/*<! lp_event_counter_09 */
#define 	RO_LP_CNT09_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT09_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT09_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT09_CNT_VAL 	RO_LP_CNT09_CNT_VAL_Msk
#define RO_LP_CNT10 	(0x00009228UL) 	/*<! lp_event_counter_10 */
#define 	RO_LP_CNT10_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT10_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT10_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT10_CNT_VAL 	RO_LP_CNT10_CNT_VAL_Msk
#define RO_LP_CNT11 	(0x0000922CUL) 	/*<! lp_event_counter_11 */
#define 	RO_LP_CNT11_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT11_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT11_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT11_CNT_VAL 	RO_LP_CNT11_CNT_VAL_Msk
#define RO_LP_CNT12 	(0x00009230UL) 	/*<! lp_event_counter_12 */
#define 	RO_LP_CNT12_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT12_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT12_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT12_CNT_VAL 	RO_LP_CNT12_CNT_VAL_Msk
#define RO_LP_CNT13 	(0x00009234UL) 	/*<! lp_event_counter_13 */
#define 	RO_LP_CNT13_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT13_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT13_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT13_CNT_VAL 	RO_LP_CNT13_CNT_VAL_Msk
#define RO_LP_CNT14 	(0x00009238UL) 	/*<! lp_event_counter_14 */
#define 	RO_LP_CNT14_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT14_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT14_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT14_CNT_VAL 	RO_LP_CNT14_CNT_VAL_Msk
#define RO_LP_CNT15 	(0x0000923CUL) 	/*<! lp_event_counter_15 */
#define 	RO_LP_CNT15_CNT_VAL_Pos 	(0x0U)
#define 	RO_LP_CNT15_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LP_CNT15_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LP_CNT15_CNT_VAL 	RO_LP_CNT15_CNT_VAL_Msk
#define RO_EVT21_CD_DROPPED_CNT 	(0x00009240UL) 	/*<!  */
#define 	RO_EVT21_CD_DROPPED_CNT_VAL_Pos 	(0x0U)
#define 	RO_EVT21_CD_DROPPED_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_EVT21_CD_DROPPED_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_EVT21_CD_DROPPED_CNT_VAL 	RO_EVT21_CD_DROPPED_CNT_VAL_Msk
#define RO_EVT_CD_CNT 	(0x00009244UL) 	/*<!  */
#define 	RO_EVT_CD_CNT_VAL_Pos 	(0x0U)
#define 	RO_EVT_CD_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_EVT_CD_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_EVT_CD_CNT_VAL 	RO_EVT_CD_CNT_VAL_Msk
#define RO_EVT21_CD_CNT 	(0x00009248UL) 	/*<!  */
#define 	RO_EVT21_CD_CNT_VAL_Pos 	(0x0U)
#define 	RO_EVT21_CD_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_EVT21_CD_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_EVT21_CD_CNT_VAL 	RO_EVT21_CD_CNT_VAL_Msk
#define RO_LINE_CD_CNT 	(0x0000924CUL) 	/*<!  */
#define 	RO_LINE_CD_CNT_VAL_Pos 	(0x0U)
#define 	RO_LINE_CD_CNT_VAL_Msk 	(0xFFFFFFFFUL << RO_LINE_CD_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	RO_LINE_CD_CNT_VAL 	RO_LINE_CD_CNT_VAL_Msk

