jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * LDO: Low Drop Out regulator Register Map
 * ------------------------------------------------------ */

#define LDO_BG 	(0x0000A000UL) 	/*<! BG CTRL */
#define 	LDO_BG_PMU_ULP_EN_Pos 	(0x0U)
#define 	LDO_BG_PMU_ULP_EN_Msk 	(0x1UL << LDO_BG_PMU_ULP_EN_Pos) 	/*!< 0x00000001 */
#define 	LDO_BG_PMU_ULP_EN 	LDO_BG_PMU_ULP_EN_Msk
#define 	LDO_BG_EN_Pos 	(0x1U)
#define 	LDO_BG_EN_Msk 	(0x1UL << LDO_BG_EN_Pos) 	/*!< 0x00000002 */
#define 	LDO_BG_EN 	LDO_BG_EN_Msk
#define 	LDO_BG_BUF_EN_Pos 	(0x2U)
#define 	LDO_BG_BUF_EN_Msk 	(0x1UL << LDO_BG_BUF_EN_Pos) 	/*!< 0x00000004 */
#define 	LDO_BG_BUF_EN 	LDO_BG_BUF_EN_Msk
#define 	LDO_BG_BYPASS_Pos 	(0x3U)
#define 	LDO_BG_BYPASS_Msk 	(0x3UL << LDO_BG_BYPASS_Pos) 	/*!< 0x00000018 */
#define 	LDO_BG_BYPASS 	LDO_BG_BYPASS_Msk
#define 	LDO_BG_ADJ_Pos 	(0x5U)
#define 	LDO_BG_ADJ_Msk 	(0xFFUL << LDO_BG_ADJ_Pos) 	/*!< 0x00001FE0 */
#define 	LDO_BG_ADJ 	LDO_BG_ADJ_Msk
#define 	LDO_BG_TH_Pos 	(0xDU)
#define 	LDO_BG_TH_Msk 	(0x7UL << LDO_BG_TH_Pos) 	/*!< 0x0000E000 */
#define 	LDO_BG_TH 	LDO_BG_TH_Msk
#define 	LDO_BG_FORCE_START_Pos 	(0x10U)
#define 	LDO_BG_FORCE_START_Msk 	(0x1UL << LDO_BG_FORCE_START_Pos) 	/*!< 0x00010000 */
#define 	LDO_BG_FORCE_START 	LDO_BG_FORCE_START_Msk
#define 	LDO_BG_CHK_Pos 	(0x11U)
#define 	LDO_BG_CHK_Msk 	(0x1UL << LDO_BG_CHK_Pos) 	/*!< 0x00020000 */
#define 	LDO_BG_CHK 	LDO_BG_CHK_Msk
#define 	LDO_BG_IND_OUT_DYN_Pos 	(0x12U)
#define 	LDO_BG_IND_OUT_DYN_Msk 	(0x1UL << LDO_BG_IND_OUT_DYN_Pos) 	/*!< 0x00040000 */
#define 	LDO_BG_IND_OUT_DYN 	LDO_BG_IND_OUT_DYN_Msk
#define LDO_LDO_HV 	(0x0000A004UL) 	/*<! LDO_HV CTRL */
#define 	LDO_HV_EN_Pos 	(0x0U)
#define 	LDO_HV_EN_Msk 	(0x1UL << LDO_HV_EN_Pos) 	/*!< 0x00000001 */
#define 	LDO_HV_EN 	LDO_HV_EN_Msk
#define 	LDO_HV_CLIMIT_EN_Pos 	(0x1U)
#define 	LDO_HV_CLIMIT_EN_Msk 	(0x1UL << LDO_HV_CLIMIT_EN_Pos) 	/*!< 0x00000002 */
#define 	LDO_HV_CLIMIT_EN 	LDO_HV_CLIMIT_EN_Msk
#define 	LDO_HV_CLIMIT_Pos 	(0x2U)
#define 	LDO_HV_CLIMIT_Msk 	(0x3UL << LDO_HV_CLIMIT_Pos) 	/*!< 0x0000000C */
#define 	LDO_HV_CLIMIT 	LDO_HV_CLIMIT_Msk
#define 	LDO_HV_ADJ_Pos 	(0x4U)
#define 	LDO_HV_ADJ_Msk 	(0xFUL << LDO_HV_ADJ_Pos) 	/*!< 0x000000F0 */
#define 	LDO_HV_ADJ 	LDO_HV_ADJ_Msk
#define 	LDO_HV_BYPASS_Pos 	(0x8U)
#define 	LDO_HV_BYPASS_Msk 	(0x1UL << LDO_HV_BYPASS_Pos) 	/*!< 0x00000100 */
#define 	LDO_HV_BYPASS 	LDO_HV_BYPASS_Msk
#define 	LDO_HV_RON_Pos 	(0x9U)
#define 	LDO_HV_RON_Msk 	(0x3UL << LDO_HV_RON_Pos) 	/*!< 0x00000600 */
#define 	LDO_HV_RON 	LDO_HV_RON_Msk
#define 	LDO_HV_COMP_Pos 	(0xBU)
#define 	LDO_HV_COMP_Msk 	(0x3UL << LDO_HV_COMP_Pos) 	/*!< 0x00001800 */
#define 	LDO_HV_COMP 	LDO_HV_COMP_Msk
#define 	LDO_HV_PWRUP_Pos 	(0xDU)
#define 	LDO_HV_PWRUP_Msk 	(0x1UL << LDO_HV_PWRUP_Pos) 	/*!< 0x00002000 */
#define 	LDO_HV_PWRUP 	LDO_HV_PWRUP_Msk
#define 	LDO_HV_GAIN_DWN_Pos 	(0xEU)
#define 	LDO_HV_GAIN_DWN_Msk 	(0x1UL << LDO_HV_GAIN_DWN_Pos) 	/*!< 0x00004000 */
#define 	LDO_HV_GAIN_DWN 	LDO_HV_GAIN_DWN_Msk
#define 	LDO_HV_IND_EN_Pos 	(0xFU)
#define 	LDO_HV_IND_EN_Msk 	(0x1UL << LDO_HV_IND_EN_Pos) 	/*!< 0x00008000 */
#define 	LDO_HV_IND_EN 	LDO_HV_IND_EN_Msk
#define 	LDO_HV_IND_SLW_Pos 	(0x10U)
#define 	LDO_HV_IND_SLW_Msk 	(0x1UL << LDO_HV_IND_SLW_Pos) 	/*!< 0x00010000 */
#define 	LDO_HV_IND_SLW 	LDO_HV_IND_SLW_Msk
#define 	LDO_HV_IND_VTH_OK_Pos 	(0x11U)
#define 	LDO_HV_IND_VTH_OK_Msk 	(0x1UL << LDO_HV_IND_VTH_OK_Pos) 	/*!< 0x00020000 */
#define 	LDO_HV_IND_VTH_OK 	LDO_HV_IND_VTH_OK_Msk
#define 	LDO_HV_IND_VTH_BO_Pos 	(0x12U)
#define 	LDO_HV_IND_VTH_BO_Msk 	(0x7UL << LDO_HV_IND_VTH_BO_Pos) 	/*!< 0x001C0000 */
#define 	LDO_HV_IND_VTH_BO 	LDO_HV_IND_VTH_BO_Msk
#define 	LDO_HV_IND_OUT_DYN_Pos 	(0x15U)
#define 	LDO_HV_IND_OUT_DYN_Msk 	(0x1UL << LDO_HV_IND_OUT_DYN_Pos) 	/*!< 0x00200000 */
#define 	LDO_HV_IND_OUT_DYN 	LDO_HV_IND_OUT_DYN_Msk
#define 	LDO_HV_EN_DELAY_Pos 	(0x16U)
#define 	LDO_HV_EN_DELAY_Msk 	(0x1UL << LDO_HV_EN_DELAY_Pos) 	/*!< 0x00400000 */
#define 	LDO_HV_EN_DELAY 	LDO_HV_EN_DELAY_Msk
#define 	LDO_HV_START_PULSE_Pos 	(0x17U)
#define 	LDO_HV_START_PULSE_Msk 	(0x1UL << LDO_HV_START_PULSE_Pos) 	/*!< 0x00800000 */
#define 	LDO_HV_START_PULSE 	LDO_HV_START_PULSE_Msk
#define 	LDO_HV_START_TRIG_Pos 	(0x18U)
#define 	LDO_HV_START_TRIG_Msk 	(0x1UL << LDO_HV_START_TRIG_Pos) 	/*!< 0x01000000 */
#define 	LDO_HV_START_TRIG 	LDO_HV_START_TRIG_Msk
#define LDO_LDO_LV 	(0x0000A008UL) 	/*<! LDO_LV CTRL */
#define 	LDO_LV_EN_Pos 	(0x0U)
#define 	LDO_LV_EN_Msk 	(0x1UL << LDO_LV_EN_Pos) 	/*!< 0x00000001 */
#define 	LDO_LV_EN 	LDO_LV_EN_Msk
#define 	LDO_LV_CLIMIT_EN_Pos 	(0x1U)
#define 	LDO_LV_CLIMIT_EN_Msk 	(0x1UL << LDO_LV_CLIMIT_EN_Pos) 	/*!< 0x00000002 */
#define 	LDO_LV_CLIMIT_EN 	LDO_LV_CLIMIT_EN_Msk
#define 	LDO_LV_CLIMIT_Pos 	(0x2U)
#define 	LDO_LV_CLIMIT_Msk 	(0x3UL << LDO_LV_CLIMIT_Pos) 	/*!< 0x0000000C */
#define 	LDO_LV_CLIMIT 	LDO_LV_CLIMIT_Msk
#define 	LDO_LV_ADJ_Pos 	(0x4U)
#define 	LDO_LV_ADJ_Msk 	(0xFUL << LDO_LV_ADJ_Pos) 	/*!< 0x000000F0 */
#define 	LDO_LV_ADJ 	LDO_LV_ADJ_Msk
#define 	LDO_LV_BYPASS_Pos 	(0x8U)
#define 	LDO_LV_BYPASS_Msk 	(0x1UL << LDO_LV_BYPASS_Pos) 	/*!< 0x00000100 */
#define 	LDO_LV_BYPASS 	LDO_LV_BYPASS_Msk
#define 	LDO_LV_RON_Pos 	(0x9U)
#define 	LDO_LV_RON_Msk 	(0x3UL << LDO_LV_RON_Pos) 	/*!< 0x00000600 */
#define 	LDO_LV_RON 	LDO_LV_RON_Msk
#define 	LDO_LV_COMP_Pos 	(0xBU)
#define 	LDO_LV_COMP_Msk 	(0x3UL << LDO_LV_COMP_Pos) 	/*!< 0x00001800 */
#define 	LDO_LV_COMP 	LDO_LV_COMP_Msk
#define 	LDO_LV_PWRUP_Pos 	(0xDU)
#define 	LDO_LV_PWRUP_Msk 	(0x1UL << LDO_LV_PWRUP_Pos) 	/*!< 0x00002000 */
#define 	LDO_LV_PWRUP 	LDO_LV_PWRUP_Msk
#define 	LDO_LV_GAIN_DWN_Pos 	(0xEU)
#define 	LDO_LV_GAIN_DWN_Msk 	(0x1UL << LDO_LV_GAIN_DWN_Pos) 	/*!< 0x00004000 */
#define 	LDO_LV_GAIN_DWN 	LDO_LV_GAIN_DWN_Msk
#define 	LDO_LV_IND_EN_Pos 	(0xFU)
#define 	LDO_LV_IND_EN_Msk 	(0x1UL << LDO_LV_IND_EN_Pos) 	/*!< 0x00008000 */
#define 	LDO_LV_IND_EN 	LDO_LV_IND_EN_Msk
#define 	LDO_LV_IND_SLW_Pos 	(0x10U)
#define 	LDO_LV_IND_SLW_Msk 	(0x1UL << LDO_LV_IND_SLW_Pos) 	/*!< 0x00010000 */
#define 	LDO_LV_IND_SLW 	LDO_LV_IND_SLW_Msk
#define 	LDO_LV_IND_VTH_OK_Pos 	(0x11U)
#define 	LDO_LV_IND_VTH_OK_Msk 	(0x1UL << LDO_LV_IND_VTH_OK_Pos) 	/*!< 0x00020000 */
#define 	LDO_LV_IND_VTH_OK 	LDO_LV_IND_VTH_OK_Msk
#define 	LDO_LV_IND_VTH_BO_Pos 	(0x12U)
#define 	LDO_LV_IND_VTH_BO_Msk 	(0x7UL << LDO_LV_IND_VTH_BO_Pos) 	/*!< 0x001C0000 */
#define 	LDO_LV_IND_VTH_BO 	LDO_LV_IND_VTH_BO_Msk
#define 	LDO_LV_IND_OUT_DYN_Pos 	(0x15U)
#define 	LDO_LV_IND_OUT_DYN_Msk 	(0x1UL << LDO_LV_IND_OUT_DYN_Pos) 	/*!< 0x00200000 */
#define 	LDO_LV_IND_OUT_DYN 	LDO_LV_IND_OUT_DYN_Msk
#define 	LDO_LV_EN_DELAY_Pos 	(0x16U)
#define 	LDO_LV_EN_DELAY_Msk 	(0x1UL << LDO_LV_EN_DELAY_Pos) 	/*!< 0x00400000 */
#define 	LDO_LV_EN_DELAY 	LDO_LV_EN_DELAY_Msk
#define 	LDO_LV_START_PULSE_Pos 	(0x17U)
#define 	LDO_LV_START_PULSE_Msk 	(0x1UL << LDO_LV_START_PULSE_Pos) 	/*!< 0x00800000 */
#define 	LDO_LV_START_PULSE 	LDO_LV_START_PULSE_Msk
#define 	LDO_LV_START_TRIG_Pos 	(0x18U)
#define 	LDO_LV_START_TRIG_Msk 	(0x1UL << LDO_LV_START_TRIG_Pos) 	/*!< 0x01000000 */
#define 	LDO_LV_START_TRIG 	LDO_LV_START_TRIG_Msk
#define LDO_LDO_HV_EN_DELAY_MAX 	(0x0000A00CUL) 	/*<! ldo_hv_en_dlay CTRL */
#define 	LDO_HV_EN_DELAY_MAX_VAL_Pos 	(0x0U)
#define 	LDO_HV_EN_DELAY_MAX_VAL_Msk 	(0xFFFFUL << LDO_HV_EN_DELAY_MAX_VAL_Pos) 	/*!< 0x0000FFFF */
#define 	LDO_HV_EN_DELAY_MAX_VAL 	LDO_HV_EN_DELAY_MAX_VAL_Msk
#define LDO_LDO_HV_START_PULSE_MAX 	(0x0000A010UL) 	/*<! ldo_hv_start_pulse CTRL */
#define 	LDO_HV_START_PULSE_MAX_VAL_Pos 	(0x0U)
#define 	LDO_HV_START_PULSE_MAX_VAL_Msk 	(0xFFFFUL << LDO_HV_START_PULSE_MAX_VAL_Pos) 	/*!< 0x0000FFFF */
#define 	LDO_HV_START_PULSE_MAX_VAL 	LDO_HV_START_PULSE_MAX_VAL_Msk
#define LDO_LDO_LV_EN_DELAY_MAX 	(0x0000A014UL) 	/*<! ldo_lv_en_dlay CTRL */
#define 	LDO_LV_EN_DELAY_MAX_VAL_Pos 	(0x0U)
#define 	LDO_LV_EN_DELAY_MAX_VAL_Msk 	(0xFFFFUL << LDO_LV_EN_DELAY_MAX_VAL_Pos) 	/*!< 0x0000FFFF */
#define 	LDO_LV_EN_DELAY_MAX_VAL 	LDO_LV_EN_DELAY_MAX_VAL_Msk
#define LDO_LDO_LV_START_PULSE_MAX 	(0x0000A018UL) 	/*<! ldo_lv_start_pulse CTRL */
#define 	LDO_LV_START_PULSE_MAX_VAL_Pos 	(0x0U)
#define 	LDO_LV_START_PULSE_MAX_VAL_Msk 	(0xFFFFUL << LDO_LV_START_PULSE_MAX_VAL_Pos) 	/*!< 0x0000FFFF */
#define 	LDO_LV_START_PULSE_MAX_VAL 	LDO_LV_START_PULSE_MAX_VAL_Msk
#define LDO_PMU 	(0x0000A01CUL) 	/*<! PMU CTRL */
#define 	LDO_PMU_ICGM_EN_Pos 	(0x0U)
#define 	LDO_PMU_ICGM_EN_Msk 	(0x1UL << LDO_PMU_ICGM_EN_Pos) 	/*!< 0x00000001 */
#define 	LDO_PMU_ICGM_EN 	LDO_PMU_ICGM_EN_Msk
#define 	LDO_PMU_V2I_EN_Pos 	(0x1U)
#define 	LDO_PMU_V2I_EN_Msk 	(0x1UL << LDO_PMU_V2I_EN_Pos) 	/*!< 0x00000002 */
#define 	LDO_PMU_V2I_EN 	LDO_PMU_V2I_EN_Msk
#define 	LDO_PMU_V2I_ADJ_Pos 	(0x2U)
#define 	LDO_PMU_V2I_ADJ_Msk 	(0xFUL << LDO_PMU_V2I_ADJ_Pos) 	/*!< 0x0000003C */
#define 	LDO_PMU_V2I_ADJ 	LDO_PMU_V2I_ADJ_Msk
#define 	LDO_PMU_IREF_DFT_CNT_Pos 	(0x6U)
#define 	LDO_PMU_IREF_DFT_CNT_Msk 	(0x3UL << LDO_PMU_IREF_DFT_CNT_Pos) 	/*!< 0x000000C0 */
#define 	LDO_PMU_IREF_DFT_CNT 	LDO_PMU_IREF_DFT_CNT_Msk
#define 	LDO_PMU_TEST_PIXEL_CUR_DAC_Pos 	(0x8U)
#define 	LDO_PMU_TEST_PIXEL_CUR_DAC_Msk 	(0x3UL << LDO_PMU_TEST_PIXEL_CUR_DAC_Pos) 	/*!< 0x00000300 */
#define 	LDO_PMU_TEST_PIXEL_CUR_DAC 	LDO_PMU_TEST_PIXEL_CUR_DAC_Msk
#define 	LDO_PMU_MIPI_V2I_EN_Pos 	(0xAU)
#define 	LDO_PMU_MIPI_V2I_EN_Msk 	(0x1UL << LDO_PMU_MIPI_V2I_EN_Pos) 	/*!< 0x00000400 */
#define 	LDO_PMU_MIPI_V2I_EN 	LDO_PMU_MIPI_V2I_EN_Msk
#define 	LDO_PMU_MIPI_ADJ_Pos 	(0xBU)
#define 	LDO_PMU_MIPI_ADJ_Msk 	(0x7UL << LDO_PMU_MIPI_ADJ_Pos) 	/*!< 0x00003800 */
#define 	LDO_PMU_MIPI_ADJ 	LDO_PMU_MIPI_ADJ_Msk
#define 	LDO_PMU_AUTO_START_Pos 	(0xEU)
#define 	LDO_PMU_AUTO_START_Msk 	(0x1UL << LDO_PMU_AUTO_START_Pos) 	/*!< 0x00004000 */
#define 	LDO_PMU_AUTO_START 	LDO_PMU_AUTO_START_Msk
#define 	LDO_PMU_V2I_CAL_EN_Pos 	(0xFU)
#define 	LDO_PMU_V2I_CAL_EN_Msk 	(0x1UL << LDO_PMU_V2I_CAL_EN_Pos) 	/*!< 0x00008000 */
#define 	LDO_PMU_V2I_CAL_EN 	LDO_PMU_V2I_CAL_EN_Msk
#define 	LDO_PMU_V2I_ADJ_DAC_DYN_Pos 	(0x10U)
#define 	LDO_PMU_V2I_ADJ_DAC_DYN_Msk 	(0xFUL << LDO_PMU_V2I_ADJ_DAC_DYN_Pos) 	/*!< 0x000F0000 */
#define 	LDO_PMU_V2I_ADJ_DAC_DYN 	LDO_PMU_V2I_ADJ_DAC_DYN_Msk
#define 	LDO_PMU_V2I_CAL_DONE_DYN_Pos 	(0x14U)
#define 	LDO_PMU_V2I_CAL_DONE_DYN_Msk 	(0x1UL << LDO_PMU_V2I_CAL_DONE_DYN_Pos) 	/*!< 0x00100000 */
#define 	LDO_PMU_V2I_CAL_DONE_DYN 	LDO_PMU_V2I_CAL_DONE_DYN_Msk

