jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * MIPI_CSI: MIPI-CSI Register Map
 * ------------------------------------------------------ */

#define MIPI_CSI_CSI_CTRL 	(0x0000B000UL) 	/*<!  */
#define 	MIPI_CSI_CTRL_ENABLE_Pos 	(0x0U)
#define 	MIPI_CSI_CTRL_ENABLE_Msk 	(0x1UL << MIPI_CSI_CTRL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_CTRL_ENABLE 	MIPI_CSI_CTRL_ENABLE_Msk
#define 	MIPI_CSI_CTRL_EMPTY_Pos 	(0x1U)
#define 	MIPI_CSI_CTRL_EMPTY_Msk 	(0x1UL << MIPI_CSI_CTRL_EMPTY_Pos) 	/*!< 0x00000002 */
#define 	MIPI_CSI_CTRL_EMPTY 	MIPI_CSI_CTRL_EMPTY_Msk
#define 	MIPI_CSI_CTRL_BUSY_Pos 	(0x2U)
#define 	MIPI_CSI_CTRL_BUSY_Msk 	(0x1UL << MIPI_CSI_CTRL_BUSY_Pos) 	/*!< 0x00000004 */
#define 	MIPI_CSI_CTRL_BUSY 	MIPI_CSI_CTRL_BUSY_Msk
#define 	MIPI_CSI_CTRL_FRAME_SYNC_EN_Pos 	(0x3U)
#define 	MIPI_CSI_CTRL_FRAME_SYNC_EN_Msk 	(0x1UL << MIPI_CSI_CTRL_FRAME_SYNC_EN_Pos) 	/*!< 0x00000008 */
#define 	MIPI_CSI_CTRL_FRAME_SYNC_EN 	MIPI_CSI_CTRL_FRAME_SYNC_EN_Msk
#define 	MIPI_CSI_CTRL_LINE_SYNC_EN_Pos 	(0x4U)
#define 	MIPI_CSI_CTRL_LINE_SYNC_EN_Msk 	(0x1UL << MIPI_CSI_CTRL_LINE_SYNC_EN_Pos) 	/*!< 0x00000010 */
#define 	MIPI_CSI_CTRL_LINE_SYNC_EN 	MIPI_CSI_CTRL_LINE_SYNC_EN_Msk
#define 	MIPI_CSI_CTRL_VCHANNEL_Pos 	(0x8U)
#define 	MIPI_CSI_CTRL_VCHANNEL_Msk 	(0x3UL << MIPI_CSI_CTRL_VCHANNEL_Pos) 	/*!< 0x00000300 */
#define 	MIPI_CSI_CTRL_VCHANNEL 	MIPI_CSI_CTRL_VCHANNEL_Msk
#define 	MIPI_CSI_CTRL_DATA_TYPE_Pos 	(0xAU)
#define 	MIPI_CSI_CTRL_DATA_TYPE_Msk 	(0x3FUL << MIPI_CSI_CTRL_DATA_TYPE_Pos) 	/*!< 0x0000FC00 */
#define 	MIPI_CSI_CTRL_DATA_TYPE 	MIPI_CSI_CTRL_DATA_TYPE_Msk
#define 	MIPI_CSI_CTRL_PKT_SIZE_Pos 	(0x10U)
#define 	MIPI_CSI_CTRL_PKT_SIZE_Msk 	(0x3FFFUL << MIPI_CSI_CTRL_PKT_SIZE_Pos) 	/*!< 0x3FFF0000 */
#define 	MIPI_CSI_CTRL_PKT_SIZE 	MIPI_CSI_CTRL_PKT_SIZE_Msk
#define MIPI_CSI_CPU_CTRL 	(0x0000B004UL) 	/*<!  */
#define 	MIPI_CSI_CPU_CTRL_ENABLE_Pos 	(0x0U)
#define 	MIPI_CSI_CPU_CTRL_ENABLE_Msk 	(0x1UL << MIPI_CSI_CPU_CTRL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_CPU_CTRL_ENABLE 	MIPI_CSI_CPU_CTRL_ENABLE_Msk
#define 	MIPI_CSI_CPU_CTRL_EMPTY_Pos 	(0x1U)
#define 	MIPI_CSI_CPU_CTRL_EMPTY_Msk 	(0x1UL << MIPI_CSI_CPU_CTRL_EMPTY_Pos) 	/*!< 0x00000002 */
#define 	MIPI_CSI_CPU_CTRL_EMPTY 	MIPI_CSI_CPU_CTRL_EMPTY_Msk
#define 	MIPI_CSI_CPU_CTRL_BUSY_Pos 	(0x2U)
#define 	MIPI_CSI_CPU_CTRL_BUSY_Msk 	(0x1UL << MIPI_CSI_CPU_CTRL_BUSY_Pos) 	/*!< 0x00000004 */
#define 	MIPI_CSI_CPU_CTRL_BUSY 	MIPI_CSI_CPU_CTRL_BUSY_Msk
#define 	MIPI_CSI_CPU_CTRL_DATA_TYPE_Pos 	(0xAU)
#define 	MIPI_CSI_CPU_CTRL_DATA_TYPE_Msk 	(0x3FUL << MIPI_CSI_CPU_CTRL_DATA_TYPE_Pos) 	/*!< 0x0000FC00 */
#define 	MIPI_CSI_CPU_CTRL_DATA_TYPE 	MIPI_CSI_CPU_CTRL_DATA_TYPE_Msk
#define 	MIPI_CSI_CPU_CTRL_PKT_SIZE_Pos 	(0x10U)
#define 	MIPI_CSI_CPU_CTRL_PKT_SIZE_Msk 	(0x3FFFUL << MIPI_CSI_CPU_CTRL_PKT_SIZE_Pos) 	/*!< 0x3FFF0000 */
#define 	MIPI_CSI_CPU_CTRL_PKT_SIZE 	MIPI_CSI_CPU_CTRL_PKT_SIZE_Msk
#define MIPI_CSI_LANE_CTRL 	(0x0000B008UL) 	/*<!  */
#define MIPI_CSI_CLK_CTRL 	(0x0000B00CUL) 	/*<!  */
#define 	MIPI_CSI_CLK_CTRL_TXCLKESC_DIVIDER_Pos 	(0x0U)
#define 	MIPI_CSI_CLK_CTRL_TXCLKESC_DIVIDER_Msk 	(0xFFUL << MIPI_CSI_CLK_CTRL_TXCLKESC_DIVIDER_Pos) 	/*!< 0x000000FF */
#define 	MIPI_CSI_CLK_CTRL_TXCLKESC_DIVIDER 	MIPI_CSI_CLK_CTRL_TXCLKESC_DIVIDER_Msk
#define 	MIPI_CSI_CLK_CTRL_TXCLKESC_EN_Pos 	(0x8U)
#define 	MIPI_CSI_CLK_CTRL_TXCLKESC_EN_Msk 	(0x1UL << MIPI_CSI_CLK_CTRL_TXCLKESC_EN_Pos) 	/*!< 0x00000100 */
#define 	MIPI_CSI_CLK_CTRL_TXCLKESC_EN 	MIPI_CSI_CLK_CTRL_TXCLKESC_EN_Msk
#define 	MIPI_CSI_CLK_CTRL_STBUS_EN_Pos 	(0x9U)
#define 	MIPI_CSI_CLK_CTRL_STBUS_EN_Msk 	(0x1UL << MIPI_CSI_CLK_CTRL_STBUS_EN_Pos) 	/*!< 0x00000200 */
#define 	MIPI_CSI_CLK_CTRL_STBUS_EN 	MIPI_CSI_CLK_CTRL_STBUS_EN_Msk
#define 	MIPI_CSI_CLK_CTRL_CL_CLKESC_EN_Pos 	(0xAU)
#define 	MIPI_CSI_CLK_CTRL_CL_CLKESC_EN_Msk 	(0x1UL << MIPI_CSI_CLK_CTRL_CL_CLKESC_EN_Pos) 	/*!< 0x00000400 */
#define 	MIPI_CSI_CLK_CTRL_CL_CLKESC_EN 	MIPI_CSI_CLK_CTRL_CL_CLKESC_EN_Msk
#define 	MIPI_CSI_CLK_CTRL_DL_CLKESC_EN_Pos 	(0xBU)
#define 	MIPI_CSI_CLK_CTRL_DL_CLKESC_EN_Msk 	(0x1UL << MIPI_CSI_CLK_CTRL_DL_CLKESC_EN_Pos) 	/*!< 0x00000800 */
#define 	MIPI_CSI_CLK_CTRL_DL_CLKESC_EN 	MIPI_CSI_CLK_CTRL_DL_CLKESC_EN_Msk
#define 	MIPI_CSI_CLK_CTRL_TXBYTECLKHS_EN_Pos 	(0xCU)
#define 	MIPI_CSI_CLK_CTRL_TXBYTECLKHS_EN_Msk 	(0x1UL << MIPI_CSI_CLK_CTRL_TXBYTECLKHS_EN_Pos) 	/*!< 0x00001000 */
#define 	MIPI_CSI_CLK_CTRL_TXBYTECLKHS_EN 	MIPI_CSI_CLK_CTRL_TXBYTECLKHS_EN_Msk
#define MIPI_CSI_FRAME_CTRL 	(0x0000B010UL) 	/*<!  */
#define 	MIPI_CSI_FRAME_CTRL_PKT_TIMEOUT_EN_Pos 	(0x0U)
#define 	MIPI_CSI_FRAME_CTRL_PKT_TIMEOUT_EN_Msk 	(0x1UL << MIPI_CSI_FRAME_CTRL_PKT_TIMEOUT_EN_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_FRAME_CTRL_PKT_TIMEOUT_EN 	MIPI_CSI_FRAME_CTRL_PKT_TIMEOUT_EN_Msk
#define 	MIPI_CSI_FRAME_CTRL_PKT_FIX_RATE_EN_Pos 	(0x1U)
#define 	MIPI_CSI_FRAME_CTRL_PKT_FIX_RATE_EN_Msk 	(0x1UL << MIPI_CSI_FRAME_CTRL_PKT_FIX_RATE_EN_Pos) 	/*!< 0x00000002 */
#define 	MIPI_CSI_FRAME_CTRL_PKT_FIX_RATE_EN 	MIPI_CSI_FRAME_CTRL_PKT_FIX_RATE_EN_Msk
#define 	MIPI_CSI_FRAME_CTRL_PKT_FIX_SIZE_EN_Pos 	(0x2U)
#define 	MIPI_CSI_FRAME_CTRL_PKT_FIX_SIZE_EN_Msk 	(0x1UL << MIPI_CSI_FRAME_CTRL_PKT_FIX_SIZE_EN_Pos) 	/*!< 0x00000004 */
#define 	MIPI_CSI_FRAME_CTRL_PKT_FIX_SIZE_EN 	MIPI_CSI_FRAME_CTRL_PKT_FIX_SIZE_EN_Msk
#define 	MIPI_CSI_FRAME_CTRL_FIX_RATE_EN_Pos 	(0x3U)
#define 	MIPI_CSI_FRAME_CTRL_FIX_RATE_EN_Msk 	(0x1UL << MIPI_CSI_FRAME_CTRL_FIX_RATE_EN_Pos) 	/*!< 0x00000008 */
#define 	MIPI_CSI_FRAME_CTRL_FIX_RATE_EN 	MIPI_CSI_FRAME_CTRL_FIX_RATE_EN_Msk
#define 	MIPI_CSI_FRAME_CTRL_FIX_SIZE_EN_Pos 	(0x4U)
#define 	MIPI_CSI_FRAME_CTRL_FIX_SIZE_EN_Msk 	(0x1UL << MIPI_CSI_FRAME_CTRL_FIX_SIZE_EN_Pos) 	/*!< 0x00000010 */
#define 	MIPI_CSI_FRAME_CTRL_FIX_SIZE_EN 	MIPI_CSI_FRAME_CTRL_FIX_SIZE_EN_Msk
#define 	MIPI_CSI_FRAME_CTRL_FIX_RATE_EMPTY_PKT_Pos 	(0x5U)
#define 	MIPI_CSI_FRAME_CTRL_FIX_RATE_EMPTY_PKT_Msk 	(0x1UL << MIPI_CSI_FRAME_CTRL_FIX_RATE_EMPTY_PKT_Pos) 	/*!< 0x00000020 */
#define 	MIPI_CSI_FRAME_CTRL_FIX_RATE_EMPTY_PKT 	MIPI_CSI_FRAME_CTRL_FIX_RATE_EMPTY_PKT_Msk
#define MIPI_CSI_FRAME_CFG 	(0x0000B014UL) 	/*<!  */
#define 	MIPI_CSI_FRAME_CFG_PERIOD_Pos 	(0x0U)
#define 	MIPI_CSI_FRAME_CFG_PERIOD_Msk 	(0xFFFFUL << MIPI_CSI_FRAME_CFG_PERIOD_Pos) 	/*!< 0x0000FFFF */
#define 	MIPI_CSI_FRAME_CFG_PERIOD 	MIPI_CSI_FRAME_CFG_PERIOD_Msk
#define 	MIPI_CSI_FRAME_CFG_SIZE_Pos 	(0x10U)
#define 	MIPI_CSI_FRAME_CFG_SIZE_Msk 	(0xFFFFUL << MIPI_CSI_FRAME_CFG_SIZE_Pos) 	/*!< 0xFFFF0000 */
#define 	MIPI_CSI_FRAME_CFG_SIZE 	MIPI_CSI_FRAME_CFG_SIZE_Msk
#define MIPI_CSI_FRAME_SYNC 	(0x0000B018UL) 	/*<!  */
#define 	MIPI_CSI_FRAME_SYNC_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_FRAME_SYNC_VAL_Msk 	(0xFFFFUL << MIPI_CSI_FRAME_SYNC_VAL_Pos) 	/*!< 0x0000FFFF */
#define 	MIPI_CSI_FRAME_SYNC_VAL 	MIPI_CSI_FRAME_SYNC_VAL_Msk
#define MIPI_CSI_MID 	(0x0000B01CUL) 	/*<!  */
#define 	MIPI_CSI_MID_Pos 	(0x0U)
#define 	MIPI_CSI_MID_Msk 	(0xFFFFUL << MIPI_CSI_MID_Pos) 	/*!< 0x0000FFFF */
#define MIPI_CSI_BL_LINE 	(0x0000B020UL) 	/*<!  */
#define 	MIPI_CSI_BL_LINE_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_BL_LINE_VAL_Msk 	(0xFFFFUL << MIPI_CSI_BL_LINE_VAL_Pos) 	/*!< 0x0000FFFF */
#define 	MIPI_CSI_BL_LINE_VAL 	MIPI_CSI_BL_LINE_VAL_Msk
#define 	MIPI_CSI_BL_LINE_CK_LANE_HS_Pos 	(0x1EU)
#define 	MIPI_CSI_BL_LINE_CK_LANE_HS_Msk 	(0x1UL << MIPI_CSI_BL_LINE_CK_LANE_HS_Pos) 	/*!< 0x40000000 */
#define 	MIPI_CSI_BL_LINE_CK_LANE_HS 	MIPI_CSI_BL_LINE_CK_LANE_HS_Msk
#define 	MIPI_CSI_BL_LINE_ENABLE_Pos 	(0x1FU)
#define 	MIPI_CSI_BL_LINE_ENABLE_Msk 	(0x1UL << MIPI_CSI_BL_LINE_ENABLE_Pos) 	/*!< 0x80000000 */
#define 	MIPI_CSI_BL_LINE_ENABLE 	MIPI_CSI_BL_LINE_ENABLE_Msk
#define MIPI_CSI_BL_FRAME 	(0x0000B024UL) 	/*<!  */
#define 	MIPI_CSI_BL_FRAME_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_BL_FRAME_VAL_Msk 	(0xFFFFFFUL << MIPI_CSI_BL_FRAME_VAL_Pos) 	/*!< 0x00FFFFFF */
#define 	MIPI_CSI_BL_FRAME_VAL 	MIPI_CSI_BL_FRAME_VAL_Msk
#define 	MIPI_CSI_BL_FRAME_CK_LANE_HS_Pos 	(0x1EU)
#define 	MIPI_CSI_BL_FRAME_CK_LANE_HS_Msk 	(0x1UL << MIPI_CSI_BL_FRAME_CK_LANE_HS_Pos) 	/*!< 0x40000000 */
#define 	MIPI_CSI_BL_FRAME_CK_LANE_HS 	MIPI_CSI_BL_FRAME_CK_LANE_HS_Msk
#define 	MIPI_CSI_BL_FRAME_ENABLE_Pos 	(0x1FU)
#define 	MIPI_CSI_BL_FRAME_ENABLE_Msk 	(0x1UL << MIPI_CSI_BL_FRAME_ENABLE_Pos) 	/*!< 0x80000000 */
#define 	MIPI_CSI_BL_FRAME_ENABLE 	MIPI_CSI_BL_FRAME_ENABLE_Msk
#define MIPI_CSI_BL_FRAME_START 	(0x0000B028UL) 	/*<!  */
#define 	MIPI_CSI_BL_FRAME_START_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_BL_FRAME_START_VAL_Msk 	(0xFFFFUL << MIPI_CSI_BL_FRAME_START_VAL_Pos) 	/*!< 0x0000FFFF */
#define 	MIPI_CSI_BL_FRAME_START_VAL 	MIPI_CSI_BL_FRAME_START_VAL_Msk
#define 	MIPI_CSI_BL_FRAME_START_ENABLE_Pos 	(0x1FU)
#define 	MIPI_CSI_BL_FRAME_START_ENABLE_Msk 	(0x1UL << MIPI_CSI_BL_FRAME_START_ENABLE_Pos) 	/*!< 0x80000000 */
#define 	MIPI_CSI_BL_FRAME_START_ENABLE 	MIPI_CSI_BL_FRAME_START_ENABLE_Msk
#define MIPI_CSI_BL_FRAME_END 	(0x0000B02CUL) 	/*<!  */
#define 	MIPI_CSI_BL_FRAME_END_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_BL_FRAME_END_VAL_Msk 	(0xFFFFUL << MIPI_CSI_BL_FRAME_END_VAL_Pos) 	/*!< 0x0000FFFF */
#define 	MIPI_CSI_BL_FRAME_END_VAL 	MIPI_CSI_BL_FRAME_END_VAL_Msk
#define 	MIPI_CSI_BL_FRAME_END_ENABLE_Pos 	(0x1FU)
#define 	MIPI_CSI_BL_FRAME_END_ENABLE_Msk 	(0x1UL << MIPI_CSI_BL_FRAME_END_ENABLE_Pos) 	/*!< 0x80000000 */
#define 	MIPI_CSI_BL_FRAME_END_ENABLE 	MIPI_CSI_BL_FRAME_END_ENABLE_Msk
#define MIPI_CSI_POWER 	(0x0000B030UL) 	/*<!  */
#define 	MIPI_CSI_POWER_CL_RSTN_Pos 	(0x0U)
#define 	MIPI_CSI_POWER_CL_RSTN_Msk 	(0x1UL << MIPI_CSI_POWER_CL_RSTN_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_POWER_CL_RSTN 	MIPI_CSI_POWER_CL_RSTN_Msk
#define 	MIPI_CSI_POWER_DL_RSTN_Pos 	(0x1U)
#define 	MIPI_CSI_POWER_DL_RSTN_Msk 	(0x1UL << MIPI_CSI_POWER_DL_RSTN_Pos) 	/*!< 0x00000002 */
#define 	MIPI_CSI_POWER_DL_RSTN 	MIPI_CSI_POWER_DL_RSTN_Msk
#define 	MIPI_CSI_POWER_CL_ENABLE_Pos 	(0x2U)
#define 	MIPI_CSI_POWER_CL_ENABLE_Msk 	(0x1UL << MIPI_CSI_POWER_CL_ENABLE_Pos) 	/*!< 0x00000004 */
#define 	MIPI_CSI_POWER_CL_ENABLE 	MIPI_CSI_POWER_CL_ENABLE_Msk
#define 	MIPI_CSI_POWER_DL_ENABLE_Pos 	(0x3U)
#define 	MIPI_CSI_POWER_DL_ENABLE_Msk 	(0x1UL << MIPI_CSI_POWER_DL_ENABLE_Pos) 	/*!< 0x00000008 */
#define 	MIPI_CSI_POWER_DL_ENABLE 	MIPI_CSI_POWER_DL_ENABLE_Msk
#define 	MIPI_CSI_POWER_CUR_EN_Pos 	(0x4U)
#define 	MIPI_CSI_POWER_CUR_EN_Msk 	(0x1UL << MIPI_CSI_POWER_CUR_EN_Pos) 	/*!< 0x00000010 */
#define 	MIPI_CSI_POWER_CUR_EN 	MIPI_CSI_POWER_CUR_EN_Msk
#define MIPI_CSI_CL_CTRL 	(0x0000B034UL) 	/*<!  */
#define 	MIPI_CSI_CL_CTRL_ULPS_Pos 	(0x0U)
#define 	MIPI_CSI_CL_CTRL_ULPS_Msk 	(0x1UL << MIPI_CSI_CL_CTRL_ULPS_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_CL_CTRL_ULPS 	MIPI_CSI_CL_CTRL_ULPS_Msk
#define 	MIPI_CSI_CL_CTRL_ULPSEXIT_Pos 	(0x1U)
#define 	MIPI_CSI_CL_CTRL_ULPSEXIT_Msk 	(0x1UL << MIPI_CSI_CL_CTRL_ULPSEXIT_Pos) 	/*!< 0x00000002 */
#define 	MIPI_CSI_CL_CTRL_ULPSEXIT 	MIPI_CSI_CL_CTRL_ULPSEXIT_Msk
#define 	MIPI_CSI_CL_CTRL_ULPSACTIVENOT_Pos 	(0x2U)
#define 	MIPI_CSI_CL_CTRL_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_CSI_CL_CTRL_ULPSACTIVENOT_Pos) 	/*!< 0x00000004 */
#define 	MIPI_CSI_CL_CTRL_ULPSACTIVENOT 	MIPI_CSI_CL_CTRL_ULPSACTIVENOT_Msk
#define 	MIPI_CSI_CL_CTRL_STOPSTATE_Pos 	(0x3U)
#define 	MIPI_CSI_CL_CTRL_STOPSTATE_Msk 	(0x1UL << MIPI_CSI_CL_CTRL_STOPSTATE_Pos) 	/*!< 0x00000008 */
#define 	MIPI_CSI_CL_CTRL_STOPSTATE 	MIPI_CSI_CL_CTRL_STOPSTATE_Msk
#define MIPI_CSI_DL_CTRL 	(0x0000B038UL) 	/*<!  */
#define 	MIPI_CSI_DL_CTRL_REQUESTESC_Pos 	(0x0U)
#define 	MIPI_CSI_DL_CTRL_REQUESTESC_Msk 	(0x1UL << MIPI_CSI_DL_CTRL_REQUESTESC_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_DL_CTRL_REQUESTESC 	MIPI_CSI_DL_CTRL_REQUESTESC_Msk
#define 	MIPI_CSI_DL_CTRL_ULPSESC_Pos 	(0x4U)
#define 	MIPI_CSI_DL_CTRL_ULPSESC_Msk 	(0x1UL << MIPI_CSI_DL_CTRL_ULPSESC_Pos) 	/*!< 0x00000010 */
#define 	MIPI_CSI_DL_CTRL_ULPSESC 	MIPI_CSI_DL_CTRL_ULPSESC_Msk
#define 	MIPI_CSI_DL_CTRL_ULPSEXIT_Pos 	(0x8U)
#define 	MIPI_CSI_DL_CTRL_ULPSEXIT_Msk 	(0x1UL << MIPI_CSI_DL_CTRL_ULPSEXIT_Pos) 	/*!< 0x00000100 */
#define 	MIPI_CSI_DL_CTRL_ULPSEXIT 	MIPI_CSI_DL_CTRL_ULPSEXIT_Msk
#define 	MIPI_CSI_DL_CTRL_ULPSACTIVENOT_Pos 	(0x10U)
#define 	MIPI_CSI_DL_CTRL_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_CSI_DL_CTRL_ULPSACTIVENOT_Pos) 	/*!< 0x00010000 */
#define 	MIPI_CSI_DL_CTRL_ULPSACTIVENOT 	MIPI_CSI_DL_CTRL_ULPSACTIVENOT_Msk
#define 	MIPI_CSI_DL_CTRL_STOPSTATE_Pos 	(0x14U)
#define 	MIPI_CSI_DL_CTRL_STOPSTATE_Msk 	(0x1UL << MIPI_CSI_DL_CTRL_STOPSTATE_Pos) 	/*!< 0x00100000 */
#define 	MIPI_CSI_DL_CTRL_STOPSTATE 	MIPI_CSI_DL_CTRL_STOPSTATE_Msk
#define MIPI_CSI_ULPS_CTRL 	(0x0000B03CUL) 	/*<!  */
#define 	MIPI_CSI_ULPS_CTRL_WAKEUP_Pos 	(0x0U)
#define 	MIPI_CSI_ULPS_CTRL_WAKEUP_Msk 	(0xFFFFFFUL << MIPI_CSI_ULPS_CTRL_WAKEUP_Pos) 	/*!< 0x00FFFFFF */
#define 	MIPI_CSI_ULPS_CTRL_WAKEUP 	MIPI_CSI_ULPS_CTRL_WAKEUP_Msk
#define 	MIPI_CSI_ULPS_CTRL_STATUS_Pos 	(0x18U)
#define 	MIPI_CSI_ULPS_CTRL_STATUS_Msk 	(0xFUL << MIPI_CSI_ULPS_CTRL_STATUS_Pos) 	/*!< 0x0F000000 */
#define 	MIPI_CSI_ULPS_CTRL_STATUS 	MIPI_CSI_ULPS_CTRL_STATUS_Msk
#define 	MIPI_CSI_ULPS_CTRL_ENABLE_Pos 	(0x1FU)
#define 	MIPI_CSI_ULPS_CTRL_ENABLE_Msk 	(0x1UL << MIPI_CSI_ULPS_CTRL_ENABLE_Pos) 	/*!< 0x80000000 */
#define 	MIPI_CSI_ULPS_CTRL_ENABLE 	MIPI_CSI_ULPS_CTRL_ENABLE_Msk
#define MIPI_CSI_CPU_DATA 	(0x0000B040UL) 	/*<!  */
#define 	MIPI_CSI_CPU_DATA_Pos 	(0x0U)
#define 	MIPI_CSI_CPU_DATA_Msk 	(0xFFFFFFFFUL << MIPI_CSI_CPU_DATA_Pos) 	/*!< 0xFFFFFFFF */
#define MIPI_CSI_CPU_CMD 	(0x0000B044UL) 	/*<!  */
#define 	MIPI_CSI_CPU_CMD_SEND_Pos 	(0x0U)
#define 	MIPI_CSI_CPU_CMD_SEND_Msk 	(0x1UL << MIPI_CSI_CPU_CMD_SEND_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_CPU_CMD_SEND 	MIPI_CSI_CPU_CMD_SEND_Msk
#define 	MIPI_CSI_CPU_CMD_BUSY_Pos 	(0x1FU)
#define 	MIPI_CSI_CPU_CMD_BUSY_Msk 	(0x1UL << MIPI_CSI_CPU_CMD_BUSY_Pos) 	/*!< 0x80000000 */
#define 	MIPI_CSI_CPU_CMD_BUSY 	MIPI_CSI_CPU_CMD_BUSY_Msk
#define MIPI_CSI_CPU_CFG 	(0x0000B048UL) 	/*<!  */
#define 	MIPI_CSI_CPU_CFG_SRAM_PART_Pos 	(0x0U)
#define 	MIPI_CSI_CPU_CFG_SRAM_PART_Msk 	(0x7UL << MIPI_CSI_CPU_CFG_SRAM_PART_Pos) 	/*!< 0x00000007 */
#define 	MIPI_CSI_CPU_CFG_SRAM_PART 	MIPI_CSI_CPU_CFG_SRAM_PART_Msk
#define MIPI_CSI_IRQ_MASK 	(0x0000B060UL) 	/*<!  */
#define 	MIPI_CSI_IRQ_MASK_CPU_DATA_SEND_Pos 	(0x0U)
#define 	MIPI_CSI_IRQ_MASK_CPU_DATA_SEND_Msk 	(0x1UL << MIPI_CSI_IRQ_MASK_CPU_DATA_SEND_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_IRQ_MASK_CPU_DATA_SEND 	MIPI_CSI_IRQ_MASK_CPU_DATA_SEND_Msk
#define 	MIPI_CSI_IRQ_MASK_STATS_AVAIL_Pos 	(0x1U)
#define 	MIPI_CSI_IRQ_MASK_STATS_AVAIL_Msk 	(0x1UL << MIPI_CSI_IRQ_MASK_STATS_AVAIL_Pos) 	/*!< 0x00000002 */
#define 	MIPI_CSI_IRQ_MASK_STATS_AVAIL 	MIPI_CSI_IRQ_MASK_STATS_AVAIL_Msk
#define 	MIPI_CSI_IRQ_MASK_FRAME_START_Pos 	(0x2U)
#define 	MIPI_CSI_IRQ_MASK_FRAME_START_Msk 	(0x1UL << MIPI_CSI_IRQ_MASK_FRAME_START_Pos) 	/*!< 0x00000004 */
#define 	MIPI_CSI_IRQ_MASK_FRAME_START 	MIPI_CSI_IRQ_MASK_FRAME_START_Msk
#define 	MIPI_CSI_IRQ_MASK_FRAME_END_Pos 	(0x3U)
#define 	MIPI_CSI_IRQ_MASK_FRAME_END_Msk 	(0x1UL << MIPI_CSI_IRQ_MASK_FRAME_END_Pos) 	/*!< 0x00000008 */
#define 	MIPI_CSI_IRQ_MASK_FRAME_END 	MIPI_CSI_IRQ_MASK_FRAME_END_Msk
#define 	MIPI_CSI_IRQ_MASK_CL_STOP_Pos 	(0x4U)
#define 	MIPI_CSI_IRQ_MASK_CL_STOP_Msk 	(0x1UL << MIPI_CSI_IRQ_MASK_CL_STOP_Pos) 	/*!< 0x00000010 */
#define 	MIPI_CSI_IRQ_MASK_CL_STOP 	MIPI_CSI_IRQ_MASK_CL_STOP_Msk
#define 	MIPI_CSI_IRQ_MASK_CL_ULPSACTIVENOT_Pos 	(0x5U)
#define 	MIPI_CSI_IRQ_MASK_CL_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_CSI_IRQ_MASK_CL_ULPSACTIVENOT_Pos) 	/*!< 0x00000020 */
#define 	MIPI_CSI_IRQ_MASK_CL_ULPSACTIVENOT 	MIPI_CSI_IRQ_MASK_CL_ULPSACTIVENOT_Msk
#define 	MIPI_CSI_IRQ_MASK_DL_STOP_Pos 	(0x6U)
#define 	MIPI_CSI_IRQ_MASK_DL_STOP_Msk 	(0x1UL << MIPI_CSI_IRQ_MASK_DL_STOP_Pos) 	/*!< 0x00000040 */
#define 	MIPI_CSI_IRQ_MASK_DL_STOP 	MIPI_CSI_IRQ_MASK_DL_STOP_Msk
#define 	MIPI_CSI_IRQ_MASK_DL_ULPSACTIVENOT_Pos 	(0x7U)
#define 	MIPI_CSI_IRQ_MASK_DL_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_CSI_IRQ_MASK_DL_ULPSACTIVENOT_Pos) 	/*!< 0x00000080 */
#define 	MIPI_CSI_IRQ_MASK_DL_ULPSACTIVENOT 	MIPI_CSI_IRQ_MASK_DL_ULPSACTIVENOT_Msk
#define MIPI_CSI_IRQ_PENDING 	(0x0000B064UL) 	/*<!  */
#define 	MIPI_CSI_IRQ_PENDING_CPU_DATA_SEND_Pos 	(0x0U)
#define 	MIPI_CSI_IRQ_PENDING_CPU_DATA_SEND_Msk 	(0x1UL << MIPI_CSI_IRQ_PENDING_CPU_DATA_SEND_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_IRQ_PENDING_CPU_DATA_SEND 	MIPI_CSI_IRQ_PENDING_CPU_DATA_SEND_Msk
#define 	MIPI_CSI_IRQ_PENDING_STATS_AVAIL_Pos 	(0x1U)
#define 	MIPI_CSI_IRQ_PENDING_STATS_AVAIL_Msk 	(0x1UL << MIPI_CSI_IRQ_PENDING_STATS_AVAIL_Pos) 	/*!< 0x00000002 */
#define 	MIPI_CSI_IRQ_PENDING_STATS_AVAIL 	MIPI_CSI_IRQ_PENDING_STATS_AVAIL_Msk
#define 	MIPI_CSI_IRQ_PENDING_FRAME_START_Pos 	(0x2U)
#define 	MIPI_CSI_IRQ_PENDING_FRAME_START_Msk 	(0x1UL << MIPI_CSI_IRQ_PENDING_FRAME_START_Pos) 	/*!< 0x00000004 */
#define 	MIPI_CSI_IRQ_PENDING_FRAME_START 	MIPI_CSI_IRQ_PENDING_FRAME_START_Msk
#define 	MIPI_CSI_IRQ_PENDING_FRAME_END_Pos 	(0x3U)
#define 	MIPI_CSI_IRQ_PENDING_FRAME_END_Msk 	(0x1UL << MIPI_CSI_IRQ_PENDING_FRAME_END_Pos) 	/*!< 0x00000008 */
#define 	MIPI_CSI_IRQ_PENDING_FRAME_END 	MIPI_CSI_IRQ_PENDING_FRAME_END_Msk
#define 	MIPI_CSI_IRQ_PENDING_CL_STOP_Pos 	(0x4U)
#define 	MIPI_CSI_IRQ_PENDING_CL_STOP_Msk 	(0x1UL << MIPI_CSI_IRQ_PENDING_CL_STOP_Pos) 	/*!< 0x00000010 */
#define 	MIPI_CSI_IRQ_PENDING_CL_STOP 	MIPI_CSI_IRQ_PENDING_CL_STOP_Msk
#define 	MIPI_CSI_IRQ_PENDING_CL_ULPSACTIVENOT_Pos 	(0x5U)
#define 	MIPI_CSI_IRQ_PENDING_CL_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_CSI_IRQ_PENDING_CL_ULPSACTIVENOT_Pos) 	/*!< 0x00000020 */
#define 	MIPI_CSI_IRQ_PENDING_CL_ULPSACTIVENOT 	MIPI_CSI_IRQ_PENDING_CL_ULPSACTIVENOT_Msk
#define 	MIPI_CSI_IRQ_PENDING_DL_STOP_Pos 	(0x6U)
#define 	MIPI_CSI_IRQ_PENDING_DL_STOP_Msk 	(0x1UL << MIPI_CSI_IRQ_PENDING_DL_STOP_Pos) 	/*!< 0x00000040 */
#define 	MIPI_CSI_IRQ_PENDING_DL_STOP 	MIPI_CSI_IRQ_PENDING_DL_STOP_Msk
#define 	MIPI_CSI_IRQ_PENDING_DL_ULPSACTIVENOT_Pos 	(0x7U)
#define 	MIPI_CSI_IRQ_PENDING_DL_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_CSI_IRQ_PENDING_DL_ULPSACTIVENOT_Pos) 	/*!< 0x00000080 */
#define 	MIPI_CSI_IRQ_PENDING_DL_ULPSACTIVENOT 	MIPI_CSI_IRQ_PENDING_DL_ULPSACTIVENOT_Msk
#define MIPI_CSI_IRQ_STATUS 	(0x0000B068UL) 	/*<!  */
#define 	MIPI_CSI_IRQ_STATUS_CPU_DATA_SEND_Pos 	(0x0U)
#define 	MIPI_CSI_IRQ_STATUS_CPU_DATA_SEND_Msk 	(0x1UL << MIPI_CSI_IRQ_STATUS_CPU_DATA_SEND_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_IRQ_STATUS_CPU_DATA_SEND 	MIPI_CSI_IRQ_STATUS_CPU_DATA_SEND_Msk
#define 	MIPI_CSI_IRQ_STATUS_STATS_AVAIL_Pos 	(0x1U)
#define 	MIPI_CSI_IRQ_STATUS_STATS_AVAIL_Msk 	(0x1UL << MIPI_CSI_IRQ_STATUS_STATS_AVAIL_Pos) 	/*!< 0x00000002 */
#define 	MIPI_CSI_IRQ_STATUS_STATS_AVAIL 	MIPI_CSI_IRQ_STATUS_STATS_AVAIL_Msk
#define 	MIPI_CSI_IRQ_STATUS_FRAME_START_Pos 	(0x2U)
#define 	MIPI_CSI_IRQ_STATUS_FRAME_START_Msk 	(0x1UL << MIPI_CSI_IRQ_STATUS_FRAME_START_Pos) 	/*!< 0x00000004 */
#define 	MIPI_CSI_IRQ_STATUS_FRAME_START 	MIPI_CSI_IRQ_STATUS_FRAME_START_Msk
#define 	MIPI_CSI_IRQ_STATUS_FRAME_END_Pos 	(0x3U)
#define 	MIPI_CSI_IRQ_STATUS_FRAME_END_Msk 	(0x1UL << MIPI_CSI_IRQ_STATUS_FRAME_END_Pos) 	/*!< 0x00000008 */
#define 	MIPI_CSI_IRQ_STATUS_FRAME_END 	MIPI_CSI_IRQ_STATUS_FRAME_END_Msk
#define 	MIPI_CSI_IRQ_STATUS_CL_STOP_Pos 	(0x4U)
#define 	MIPI_CSI_IRQ_STATUS_CL_STOP_Msk 	(0x1UL << MIPI_CSI_IRQ_STATUS_CL_STOP_Pos) 	/*!< 0x00000010 */
#define 	MIPI_CSI_IRQ_STATUS_CL_STOP 	MIPI_CSI_IRQ_STATUS_CL_STOP_Msk
#define 	MIPI_CSI_IRQ_STATUS_CL_ULPSACTIVENOT_Pos 	(0x5U)
#define 	MIPI_CSI_IRQ_STATUS_CL_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_CSI_IRQ_STATUS_CL_ULPSACTIVENOT_Pos) 	/*!< 0x00000020 */
#define 	MIPI_CSI_IRQ_STATUS_CL_ULPSACTIVENOT 	MIPI_CSI_IRQ_STATUS_CL_ULPSACTIVENOT_Msk
#define 	MIPI_CSI_IRQ_STATUS_DL_STOP_Pos 	(0x6U)
#define 	MIPI_CSI_IRQ_STATUS_DL_STOP_Msk 	(0x1UL << MIPI_CSI_IRQ_STATUS_DL_STOP_Pos) 	/*!< 0x00000040 */
#define 	MIPI_CSI_IRQ_STATUS_DL_STOP 	MIPI_CSI_IRQ_STATUS_DL_STOP_Msk
#define 	MIPI_CSI_IRQ_STATUS_DL_ULPSACTIVENOT_Pos 	(0x7U)
#define 	MIPI_CSI_IRQ_STATUS_DL_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_CSI_IRQ_STATUS_DL_ULPSACTIVENOT_Pos) 	/*!< 0x00000080 */
#define 	MIPI_CSI_IRQ_STATUS_DL_ULPSACTIVENOT 	MIPI_CSI_IRQ_STATUS_DL_ULPSACTIVENOT_Msk
#define MIPI_CSI_GPIO_CTRL 	(0x0000B06CUL) 	/*<!  */
#define 	MIPI_CSI_GPIO_CTRL_FRAME_START_Pos 	(0x0U)
#define 	MIPI_CSI_GPIO_CTRL_FRAME_START_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_FRAME_START_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_GPIO_CTRL_FRAME_START 	MIPI_CSI_GPIO_CTRL_FRAME_START_Msk
#define 	MIPI_CSI_GPIO_CTRL_FRAME_END_Pos 	(0x1U)
#define 	MIPI_CSI_GPIO_CTRL_FRAME_END_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_FRAME_END_Pos) 	/*!< 0x00000002 */
#define 	MIPI_CSI_GPIO_CTRL_FRAME_END 	MIPI_CSI_GPIO_CTRL_FRAME_END_Msk
#define 	MIPI_CSI_GPIO_CTRL_DATA_Pos 	(0x2U)
#define 	MIPI_CSI_GPIO_CTRL_DATA_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_DATA_Pos) 	/*!< 0x00000004 */
#define 	MIPI_CSI_GPIO_CTRL_DATA 	MIPI_CSI_GPIO_CTRL_DATA_Msk
#define 	MIPI_CSI_GPIO_CTRL_PAD_DATA_Pos 	(0x3U)
#define 	MIPI_CSI_GPIO_CTRL_PAD_DATA_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_PAD_DATA_Pos) 	/*!< 0x00000008 */
#define 	MIPI_CSI_GPIO_CTRL_PAD_DATA 	MIPI_CSI_GPIO_CTRL_PAD_DATA_Msk
#define 	MIPI_CSI_GPIO_CTRL_CPU_DATA_Pos 	(0x4U)
#define 	MIPI_CSI_GPIO_CTRL_CPU_DATA_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_CPU_DATA_Pos) 	/*!< 0x00000010 */
#define 	MIPI_CSI_GPIO_CTRL_CPU_DATA 	MIPI_CSI_GPIO_CTRL_CPU_DATA_Msk
#define 	MIPI_CSI_GPIO_CTRL_CL_STOP_Pos 	(0x5U)
#define 	MIPI_CSI_GPIO_CTRL_CL_STOP_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_CL_STOP_Pos) 	/*!< 0x00000020 */
#define 	MIPI_CSI_GPIO_CTRL_CL_STOP 	MIPI_CSI_GPIO_CTRL_CL_STOP_Msk
#define 	MIPI_CSI_GPIO_CTRL_CL_ULPSACTIVENOT_Pos 	(0x6U)
#define 	MIPI_CSI_GPIO_CTRL_CL_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_CL_ULPSACTIVENOT_Pos) 	/*!< 0x00000040 */
#define 	MIPI_CSI_GPIO_CTRL_CL_ULPSACTIVENOT 	MIPI_CSI_GPIO_CTRL_CL_ULPSACTIVENOT_Msk
#define 	MIPI_CSI_GPIO_CTRL_DL_STOP_Pos 	(0x7U)
#define 	MIPI_CSI_GPIO_CTRL_DL_STOP_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_DL_STOP_Pos) 	/*!< 0x00000080 */
#define 	MIPI_CSI_GPIO_CTRL_DL_STOP 	MIPI_CSI_GPIO_CTRL_DL_STOP_Msk
#define 	MIPI_CSI_GPIO_CTRL_DL_ULPSACTIVENOT_Pos 	(0x8U)
#define 	MIPI_CSI_GPIO_CTRL_DL_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_DL_ULPSACTIVENOT_Pos) 	/*!< 0x00000100 */
#define 	MIPI_CSI_GPIO_CTRL_DL_ULPSACTIVENOT 	MIPI_CSI_GPIO_CTRL_DL_ULPSACTIVENOT_Msk
#define 	MIPI_CSI_GPIO_CTRL_SOF_Pos 	(0x9U)
#define 	MIPI_CSI_GPIO_CTRL_SOF_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_SOF_Pos) 	/*!< 0x00000200 */
#define 	MIPI_CSI_GPIO_CTRL_SOF 	MIPI_CSI_GPIO_CTRL_SOF_Msk
#define 	MIPI_CSI_GPIO_CTRL_ATOMIC_Pos 	(0xAU)
#define 	MIPI_CSI_GPIO_CTRL_ATOMIC_Msk 	(0x1UL << MIPI_CSI_GPIO_CTRL_ATOMIC_Pos) 	/*!< 0x00000400 */
#define 	MIPI_CSI_GPIO_CTRL_ATOMIC 	MIPI_CSI_GPIO_CTRL_ATOMIC_Msk
#define MIPI_CSI_STAT_CTRL 	(0x0000B080UL) 	/*<!  */
#define 	MIPI_CSI_STAT_CTRL_ENABLE_Pos 	(0x0U)
#define 	MIPI_CSI_STAT_CTRL_ENABLE_Msk 	(0x1UL << MIPI_CSI_STAT_CTRL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	MIPI_CSI_STAT_CTRL_ENABLE 	MIPI_CSI_STAT_CTRL_ENABLE_Msk
#define 	MIPI_CSI_STAT_CTRL_TRIGGER_Pos 	(0x1U)
#define 	MIPI_CSI_STAT_CTRL_TRIGGER_Msk 	(0x1UL << MIPI_CSI_STAT_CTRL_TRIGGER_Pos) 	/*!< 0x00000002 */
#define 	MIPI_CSI_STAT_CTRL_TRIGGER 	MIPI_CSI_STAT_CTRL_TRIGGER_Msk
#define 	MIPI_CSI_STAT_CTRL_CLEAR_Pos 	(0x2U)
#define 	MIPI_CSI_STAT_CTRL_CLEAR_Msk 	(0x1UL << MIPI_CSI_STAT_CTRL_CLEAR_Pos) 	/*!< 0x00000004 */
#define 	MIPI_CSI_STAT_CTRL_CLEAR 	MIPI_CSI_STAT_CTRL_CLEAR_Msk
#define MIPI_CSI_STAT_FRAME_CNT 	(0x0000B084UL) 	/*<!  */
#define 	MIPI_CSI_STAT_FRAME_CNT_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_STAT_FRAME_CNT_VAL_Msk 	(0xFFFFFFFFUL << MIPI_CSI_STAT_FRAME_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	MIPI_CSI_STAT_FRAME_CNT_VAL 	MIPI_CSI_STAT_FRAME_CNT_VAL_Msk
#define MIPI_CSI_STAT_BYTE_CNT 	(0x0000B088UL) 	/*<!  */
#define 	MIPI_CSI_STAT_BYTE_CNT_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_STAT_BYTE_CNT_VAL_Msk 	(0xFFFFFFFFUL << MIPI_CSI_STAT_BYTE_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	MIPI_CSI_STAT_BYTE_CNT_VAL 	MIPI_CSI_STAT_BYTE_CNT_VAL_Msk
#define MIPI_CSI_STAT_PAD_CNT 	(0x0000B08CUL) 	/*<!  */
