jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	MIPI_CSI_STAT_PAD_CNT_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_STAT_PAD_CNT_VAL_Msk 	(0xFFFFFFFFUL << MIPI_CSI_STAT_PAD_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	MIPI_CSI_STAT_PAD_CNT_VAL 	MIPI_CSI_STAT_PAD_CNT_VAL_Msk
#define MIPI_CSI_STAT_PKT_CNT 	(0x0000B090UL) 	/*<!  */
#define 	MIPI_CSI_STAT_PKT_CNT_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_STAT_PKT_CNT_VAL_Msk 	(0xFFFFFFFFUL << MIPI_CSI_STAT_PKT_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	MIPI_CSI_STAT_PKT_CNT_VAL 	MIPI_CSI_STAT_PKT_CNT_VAL_Msk
#define MIPI_CSI_STAT_INC_PKT_CNT 	(0x0000B094UL) 	/*<!  */
#define 	MIPI_CSI_STAT_INC_PKT_CNT_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_STAT_INC_PKT_CNT_VAL_Msk 	(0xFFFFFFFFUL << MIPI_CSI_STAT_INC_PKT_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	MIPI_CSI_STAT_INC_PKT_CNT_VAL 	MIPI_CSI_STAT_INC_PKT_CNT_VAL_Msk
#define MIPI_CSI_STAT_FRAME_PERIOD 	(0x0000B098UL) 	/*<!  */
#define 	MIPI_CSI_STAT_FRAME_PERIOD_VAL_Pos 	(0x0U)
#define 	MIPI_CSI_STAT_FRAME_PERIOD_VAL_Msk 	(0xFFFFFFFFUL << MIPI_CSI_STAT_FRAME_PERIOD_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	MIPI_CSI_STAT_FRAME_PERIOD_VAL 	MIPI_CSI_STAT_FRAME_PERIOD_VAL_Msk
#define MIPI_CSI_SPG_CFG 	(0x0000B0C0UL) 	/*<!  */
#define 	MIPI_CSI_SPG_CFG_SELF_TEST_CTRL_Pos 	(0x0U)
#define 	MIPI_CSI_SPG_CFG_SELF_TEST_CTRL_Msk 	(0x7UL << MIPI_CSI_SPG_CFG_SELF_TEST_CTRL_Pos) 	/*!< 0x00000007 */
#define 	MIPI_CSI_SPG_CFG_SELF_TEST_CTRL 	MIPI_CSI_SPG_CFG_SELF_TEST_CTRL_Msk
#define 	MIPI_CSI_SPG_CFG_SELF_TEST_RATE_Pos 	(0x4U)
#define 	MIPI_CSI_SPG_CFG_SELF_TEST_RATE_Msk 	(0x3FFUL << MIPI_CSI_SPG_CFG_SELF_TEST_RATE_Pos) 	/*!< 0x00003FF0 */
#define 	MIPI_CSI_SPG_CFG_SELF_TEST_RATE 	MIPI_CSI_SPG_CFG_SELF_TEST_RATE_Msk
#define 	MIPI_CSI_SPG_CFG_SELF_TEST_REPEAT_Pos 	(0x10U)
#define 	MIPI_CSI_SPG_CFG_SELF_TEST_REPEAT_Msk 	(0x1FFFUL << MIPI_CSI_SPG_CFG_SELF_TEST_REPEAT_Pos) 	/*!< 0x1FFF0000 */
#define 	MIPI_CSI_SPG_CFG_SELF_TEST_REPEAT 	MIPI_CSI_SPG_CFG_SELF_TEST_REPEAT_Msk
#define MIPI_CSI_SPG_DATA 	(0x0000B0C4UL) 	/*<!  */
#define 	MIPI_CSI_SPG_DATA_SELF_TEST_Pos 	(0x0U)
#define 	MIPI_CSI_SPG_DATA_SELF_TEST_Msk 	(0xFFFFFFFFUL << MIPI_CSI_SPG_DATA_SELF_TEST_Pos) 	/*!< 0xFFFFFFFF */
#define 	MIPI_CSI_SPG_DATA_SELF_TEST 	MIPI_CSI_SPG_DATA_SELF_TEST_Msk

/* ------------------------------------------------------")
 * MIPI_DPHY: MIPI-DPHY Register Map
 * ------------------------------------------------------ */

#define MIPI_DPHY_DPHY_BLOCK_CLK_W_TX_CLK_ZERO_HS_PRP_REG 	(0x0000B400UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ZERO_HS_PRP_REG_3_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ZERO_HS_PRP_REG_3_0_Msk 	(0xFUL << MIPI_DPHY_BLOCK_CLK_W_TX_ZERO_HS_PRP_REG_3_0_Pos) 	/*!< 0x0000000F */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ZERO_HS_PRP_REG_3_0 	MIPI_DPHY_BLOCK_CLK_W_TX_ZERO_HS_PRP_REG_3_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ZERO_HS_PRP_REG_7_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ZERO_HS_PRP_REG_7_4_Msk 	(0xFUL << MIPI_DPHY_BLOCK_CLK_W_TX_ZERO_HS_PRP_REG_7_4_Pos) 	/*!< 0x000000F0 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ZERO_HS_PRP_REG_7_4 	MIPI_DPHY_BLOCK_CLK_W_TX_ZERO_HS_PRP_REG_7_4_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_W_TX_CLK_BCTL_REG 	(0x0000B404UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_0 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_1_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_1 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_1_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_2 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_BAND_CTRL_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_BAND_CTRL_Msk 	(0x1FUL << MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_BAND_CTRL_Pos) 	/*!< 0x000000F8 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_BAND_CTRL 	MIPI_DPHY_BLOCK_CLK_W_TX_BCTL_REG_BAND_CTRL_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_W_TX_CLK_ANA_CTRL1_REG 	(0x0000B408UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_O_TM_PD_DISABLE_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_O_TM_PD_DISABLE_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_O_TM_PD_DISABLE_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_O_TM_PD_DISABLE 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_O_TM_PD_DISABLE_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_PDN_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_PDN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_PDN_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_PDN 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_PDN_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_SEL_PDN_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_SEL_PDN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_SEL_PDN_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_SEL_PDN 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_SEL_PDN_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_ULPS_PDN_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_ULPS_PDN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_ULPS_PDN_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_ULPS_PDN 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_ULPS_PDN_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_SEL_ULPS_PDN_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_SEL_ULPS_PDN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_SEL_ULPS_PDN_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_SEL_ULPS_PDN 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_SEL_ULPS_PDN_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_INV_LPTX_DN_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_INV_LPTX_DN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_INV_LPTX_DN_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_INV_LPTX_DN 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_INV_LPTX_DN_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_INV_LPTX_DP_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_INV_LPTX_DP_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_INV_LPTX_DP_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_INV_LPTX_DP 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_INV_LPTX_DP_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_LPTX_DP_DN_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_LPTX_DP_DN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_LPTX_DP_DN_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_LPTX_DP_DN 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL1_REG_BYPASS_LPTX_DP_DN_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_W_TX_CLK_ANA_CTRL2_REG 	(0x0000B40CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_BYPASS_LPTX_PD_RE_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_BYPASS_LPTX_PD_RE_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_BYPASS_LPTX_PD_RE_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_BYPASS_LPTX_PD_RE 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_BYPASS_LPTX_PD_RE_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_SEL_LPTX_PD_REF_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_SEL_LPTX_PD_REF_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_SEL_LPTX_PD_REF_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_SEL_LPTX_PD_REF 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_SEL_LPTX_PD_REF_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_O_LOOPBACK_PDNB_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_O_LOOPBACK_PDNB_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_O_LOOPBACK_PDNB_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_O_LOOPBACK_PDNB 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_O_LOOPBACK_PDNB_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_O_LOOPBACK_EN_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_O_LOOPBACK_EN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_O_LOOPBACK_EN_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_O_LOOPBACK_EN 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_O_LOOPBACK_EN_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_REG4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_REG4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_REG4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_REG4 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_REG4_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_REG5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_REG5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_REG5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_REG5 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_REG5_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_BYPASS_POR_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_BYPASS_POR_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_BYPASS_POR_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_BYPASS_POR 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_BYPASS_POR_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_SEL_POR_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_SEL_POR_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_SEL_POR_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_SEL_POR 	MIPI_DPHY_BLOCK_CLK_W_TX_ANA_CTRL2_REG_SEL_POR_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_O_ANA_TX_CLK_TBIT1 	(0x0000B410UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_BIAS_TM_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_BIAS_TM_Msk 	(0x3UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_BIAS_TM_Pos) 	/*!< 0x00000003 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_BIAS_TM 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_BIAS_TM_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_LDO_PD_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_LDO_PD_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_LDO_PD_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_LDO_PD 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_LDO_PD_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_BIAS_PD_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_BIAS_PD_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_BIAS_PD_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_BIAS_PD 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT1_LPTX_BIAS_PD_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_O_ANA_TX_CLK_TBIT2 	(0x0000B414UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT2_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT2_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT2_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT2_REG_0 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT2_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT2_REG_7_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT2_REG_7_1_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT2_REG_7_1_Pos) 	/*!< 0x000000FE */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT2_REG_7_1 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT2_REG_7_1_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_O_ANA_TX_CLK_TBIT3 	(0x0000B418UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_0 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_1_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_1 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_1_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_2 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_3_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_3_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_3 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_3_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_7_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_7_4_Msk 	(0xFUL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_7_4_Pos) 	/*!< 0x000000F0 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_7_4 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT3_REG_7_4_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_O_ANA_TX_CLK_TBIT4 	(0x0000B41CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT4_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT4_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT4_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT4_REG_0 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT4_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT4_REG_7_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT4_REG_7_1_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT4_REG_7_1_Pos) 	/*!< 0x000000FE */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT4_REG_7_1 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT4_REG_7_1_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_O_ANA_TX_CLK_TBIT5 	(0x0000B420UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT5_REG_6_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT5_REG_6_0_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT5_REG_6_0_Pos) 	/*!< 0x0000007F */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT5_REG_6_0 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT5_REG_6_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT5_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT5_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT5_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT5_REG_7 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT5_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_O_ANA_TX_CLK_TBIT6 	(0x0000B424UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_0 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_1_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_1 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_1_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_2 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_3_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_3_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_3 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_3_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_4 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_4_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_5 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_5_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_6_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_6_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_6_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_6 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_6_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_7 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT6_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_O_ANA_TX_CLK_TBIT7 	(0x0000B428UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_1_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_1_0_Msk 	(0x3UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_1_0_Pos) 	/*!< 0x00000003 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_1_0 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_1_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_3_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_3_2_Msk 	(0x3UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_3_2_Pos) 	/*!< 0x0000000C */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_3_2 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_3_2_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_4 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_4_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_5 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_5_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_6_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_6_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_6_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_6 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_6_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_7 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT7_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_O_ANA_TX_CLK_TBIT8 	(0x0000B42CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT8_REG_6_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT8_REG_6_0_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT8_REG_6_0_Pos) 	/*!< 0x0000007F */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT8_REG_6_0 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT8_REG_6_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT8_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT8_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT8_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT8_REG_7 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT8_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_O_ANA_TX_CLK_TBIT9 	(0x0000B430UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT9_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT9_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT9_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT9_REG_7_0 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_TBIT9_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET 	(0x0000B434UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET_REG_6_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET_REG_6_0_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET_REG_6_0_Pos) 	/*!< 0x0000007F */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET_REG_6_0 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET_REG_6_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET_REG_7 	MIPI_DPHY_BLOCK_CLK_O_ANA_TX_SLEW_SET_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_W_BIST_EN 	(0x0000B438UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_W_BIST_EN_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_W_BIST_EN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_W_BIST_EN_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_CLK_W_BIST_EN 	MIPI_DPHY_BLOCK_CLK_W_BIST_EN_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_BIST_EN_REG_7_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_CLK_W_BIST_EN_REG_7_1_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_CLK_W_BIST_EN_REG_7_1_Pos) 	/*!< 0x000000FE */
#define 	MIPI_DPHY_BLOCK_CLK_W_BIST_EN_REG_7_1 	MIPI_DPHY_BLOCK_CLK_W_BIST_EN_REG_7_1_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_W_TX_CLK_PRP_REG 	(0x0000B43CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_PRP_REG_3_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_PRP_REG_3_0_Msk 	(0xFUL << MIPI_DPHY_BLOCK_CLK_W_TX_PRP_REG_3_0_Pos) 	/*!< 0x0000000F */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_PRP_REG_3_0 	MIPI_DPHY_BLOCK_CLK_W_TX_PRP_REG_3_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_PRP_REG_7_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_PRP_REG_7_4_Msk 	(0xFUL << MIPI_DPHY_BLOCK_CLK_W_TX_PRP_REG_7_4_Pos) 	/*!< 0x000000F0 */
#define 	MIPI_DPHY_BLOCK_CLK_W_TX_PRP_REG_7_4 	MIPI_DPHY_BLOCK_CLK_W_TX_PRP_REG_7_4_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_W_LDO_PWRUP_CNT 	(0x0000B440UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_W_LDO_PWRUP_CNT_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_W_LDO_PWRUP_CNT_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_CLK_W_LDO_PWRUP_CNT_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_CLK_W_LDO_PWRUP_CNT_REG_7_0 	MIPI_DPHY_BLOCK_CLK_W_LDO_PWRUP_CNT_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_W_DATA_INT 	(0x0000B444UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_W_DATA_INT_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_W_DATA_INT_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_CLK_W_DATA_INT_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_CLK_W_DATA_INT_REG_7_0 	MIPI_DPHY_BLOCK_CLK_W_DATA_INT_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX_CLK_STATUS_REG 	(0x0000B448UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX_CLK_STATUS_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX_CLK_STATUS_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX_CLK_STATUS_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX_CLK_STATUS_REG_7_0 	MIPI_DPHY_BLOCK_TX_CLK_STATUS_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_M_CLK_MODULE_ID 	(0x0000B44CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_M_CLK_MODULE_ID_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_M_CLK_MODULE_ID_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_M_CLK_MODULE_ID_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_M_CLK_MODULE_ID_REG_7_0 	MIPI_DPHY_BLOCK_M_CLK_MODULE_ID_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_M_CLK_VERSION_ID 	(0x0000B450UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_M_CLK_VERSION_ID_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_M_CLK_VERSION_ID_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_M_CLK_VERSION_ID_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_M_CLK_VERSION_ID_REG_7_0 	MIPI_DPHY_BLOCK_M_CLK_VERSION_ID_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_ULPS 	(0x0000B454UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_M_SWAPDPDN_CTX_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_M_SWAPDPDN_CTX_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ULPS_M_SWAPDPDN_CTX_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_M_SWAPDPDN_CTX 	MIPI_DPHY_BLOCK_CLK_ULPS_M_SWAPDPDN_CTX_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_TXULPSEXITCLK_CTX_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_TXULPSEXITCLK_CTX_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ULPS_TXULPSEXITCLK_CTX_Pos) 	/*!< 0x00000002 */
