jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_TXULPSEXITCLK_CTX 	MIPI_DPHY_BLOCK_CLK_ULPS_TXULPSEXITCLK_CTX_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_TXULPSCLK_CTX_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_TXULPSCLK_CTX_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ULPS_TXULPSCLK_CTX_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_TXULPSCLK_CTX 	MIPI_DPHY_BLOCK_CLK_ULPS_TXULPSCLK_CTX_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_TXENABLECLK_CTX_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_TXENABLECLK_CTX_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ULPS_TXENABLECLK_CTX_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_TXENABLECLK_CTX 	MIPI_DPHY_BLOCK_CLK_ULPS_TXENABLECLK_CTX_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_REG_7_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_REG_7_4_Msk 	(0xFUL << MIPI_DPHY_BLOCK_CLK_ULPS_REG_7_4_Pos) 	/*!< 0x000000F0 */
#define 	MIPI_DPHY_BLOCK_CLK_ULPS_REG_7_4 	MIPI_DPHY_BLOCK_CLK_ULPS_REG_7_4_Msk
#define MIPI_DPHY_DPHY_BLOCK_CLK_ESCAPE 	(0x0000B458UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_0 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_1_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_1 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_1_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_2 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_3_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_3_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_3 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_3_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_4 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_4_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_TXULPSACTIVENOTCLK_CTX_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_TXULPSACTIVENOTCLK_CTX_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ESCAPE_TXULPSACTIVENOTCLK_CTX_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_TXULPSACTIVENOTCLK_CTX 	MIPI_DPHY_BLOCK_CLK_ESCAPE_TXULPSACTIVENOTCLK_CTX_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_TXSTOPSTATECLK_CTX_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_TXSTOPSTATECLK_CTX_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ESCAPE_TXSTOPSTATECLK_CTX_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_TXSTOPSTATECLK_CTX 	MIPI_DPHY_BLOCK_CLK_ESCAPE_TXSTOPSTATECLK_CTX_Msk
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_7 	MIPI_DPHY_BLOCK_CLK_ESCAPE_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG 	(0x0000B45CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG_3_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG_3_0_Msk 	(0xFUL << MIPI_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG_3_0_Pos) 	/*!< 0x0000000F */
#define 	MIPI_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG_3_0 	MIPI_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG_3_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG_7_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG_7_4_Msk 	(0xFUL << MIPI_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG_7_4_Pos) 	/*!< 0x000000F0 */
#define 	MIPI_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG_7_4 	MIPI_DPHY_BLOCK_TX1_W_DATA_ZERO_HS_PRP_REG_7_4_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG 	(0x0000B460UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG_3_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG_3_0_Msk 	(0xFUL << MIPI_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG_3_0_Pos) 	/*!< 0x0000000F */
#define 	MIPI_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG_3_0 	MIPI_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG_3_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG_7_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG_7_4_Msk 	(0xFUL << MIPI_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG_7_4_Pos) 	/*!< 0x000000F0 */
#define 	MIPI_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG_7_4 	MIPI_DPHY_BLOCK_TX1_W_T1_DATA_CLK_PRP_REG_7_4_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG 	(0x0000B464UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_FORCERXMODE0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_FORCERXMODE0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_FORCERXMODE0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_FORCERXMODE0 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_FORCERXMODE0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_BYPASS_PDN_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_BYPASS_PDN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_BYPASS_PDN_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_BYPASS_PDN 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_BYPASS_PDN_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_SEL_ANA_PDN_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_SEL_ANA_PDN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_SEL_ANA_PDN_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_SEL_ANA_PDN 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_SEL_ANA_PDN_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_BYPASS_ULPS_PDN_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_BYPASS_ULPS_PDN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_BYPASS_ULPS_PDN_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_BYPASS_ULPS_PDN 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_BYPASS_ULPS_PDN_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_SEL_ULPS_PDN_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_SEL_ULPS_PDN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_SEL_ULPS_PDN_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_SEL_ULPS_PDN 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_SEL_ULPS_PDN_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_ANA_HS_LP_DNB_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_ANA_HS_LP_DNB_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_ANA_HS_LP_DNB_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_ANA_HS_LP_DNB 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_ANA_HS_LP_DNB_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_ANA_HS_LP_DPB_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_ANA_HS_LP_DPB_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_ANA_HS_LP_DPB_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_ANA_HS_LP_DPB 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_ANA_HS_LP_DPB_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_SEL_ANA_HS_LP_D_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_SEL_ANA_HS_LP_D_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_SEL_ANA_HS_LP_D_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_SEL_ANA_HS_LP_D 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_HSTX_BITS_REG_TEST_SEL_ANA_HS_LP_D_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG 	(0x0000B468UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_FORCERXMODE_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_FORCERXMODE_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_FORCERXMODE_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_FORCERXMODE 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_FORCERXMODE_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_BYPASS_PDN_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_BYPASS_PDN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_BYPASS_PDN_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_BYPASS_PDN 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_BYPASS_PDN_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_2 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_3_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_3_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_3 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_3_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_4 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_4_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_5 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_5_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_6_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_6_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_6_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_6 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_6_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_7 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL1_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG 	(0x0000B46CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_BYPASS_LPTX_PD_REF_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_BYPASS_LPTX_PD_REF_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_BYPASS_LPTX_PD_REF_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_BYPASS_LPTX_PD_REF 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_BYPASS_LPTX_PD_REF_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_SEL_LPTX_PD_REF_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_SEL_LPTX_PD_REF_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_SEL_LPTX_PD_REF_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_SEL_LPTX_PD_REF 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_SEL_LPTX_PD_REF_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_LOOPBACK_PDNB_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_LOOPBACK_PDNB_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_LOOPBACK_PDNB_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_LOOPBACK_PDNB 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_LOOPBACK_PDNB_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_LOOPBACK_EN_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_LOOPBACK_EN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_LOOPBACK_EN_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_LOOPBACK_EN 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_LOOPBACK_EN_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_TM_PD_DISABLE_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_TM_PD_DISABLE_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_TM_PD_DISABLE_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_TM_PD_DISABLE 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_O_TM_PD_DISABLE_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_TEST_SEL_IN_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_TEST_SEL_IN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_TEST_SEL_IN_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_TEST_SEL_IN 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_TEST_SEL_IN_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_BYPASS_POR_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_BYPASS_POR_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_BYPASS_POR_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_BYPASS_POR 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_BYPASS_POR_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_SEL_POR_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_SEL_POR_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_SEL_POR_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_SEL_POR 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_ANA_CTRL2_REG_SEL_POR_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG 	(0x0000B470UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_CTRL_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_CTRL_Msk 	(0x1FUL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_CTRL_Pos) 	/*!< 0x0000001F */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_CTRL 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_CTRL_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_5 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_5_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_6_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_6_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_6_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_6 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_6_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_7 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_BAND_CTL_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1 	(0x0000B474UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_1_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_1_0_Msk 	(0x3UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_1_0_Pos) 	/*!< 0x00000003 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_1_0 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_1_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_3_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_3_2_Msk 	(0x3UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_3_2_Pos) 	/*!< 0x0000000C */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_3_2 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_3_2_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_4 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_4_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_5 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_5_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_6_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_6_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_6_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_6 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_6_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_7 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT1_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2 	(0x0000B478UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2_REG_0 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2_REG_7_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2_REG_7_1_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2_REG_7_1_Pos) 	/*!< 0x000000FE */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2_REG_7_1 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT2_REG_7_1_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3 	(0x0000B47CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_0 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_1_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_1 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_1_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_2 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_3_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_3_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_3 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_3_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_7_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_7_4_Msk 	(0xFUL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_7_4_Pos) 	/*!< 0x000000F0 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_7_4 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT3_REG_7_4_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4 	(0x0000B480UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_0 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_1_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_1 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_1_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_2 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_3_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_3_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_3 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_3_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_4 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_4_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_7_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_7_5_Msk 	(0x7UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_7_5_Pos) 	/*!< 0x000000E0 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_7_5 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT4_REG_7_5_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5 	(0x0000B484UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5_REG_6_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5_REG_6_0_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5_REG_6_0_Pos) 	/*!< 0x0000007F */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5_REG_6_0 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5_REG_6_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5_REG_7 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT5_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT6 	(0x0000B488UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT6_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT6_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT6_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT6_REG_7_0 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT6_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7 	(0x0000B48CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_1_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_1_0_Msk 	(0x3UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_1_0_Pos) 	/*!< 0x00000003 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_1_0 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_1_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_3_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_3_2_Msk 	(0x3UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_3_2_Pos) 	/*!< 0x0000000C */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_3_2 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_3_2_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_4 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_4_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_5 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_5_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_6_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_6_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_6_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_6 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_6_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_7_Pos 	(0x7U)
