jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_7 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT7_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8 	(0x0000B490UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8_REG_6_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8_REG_6_0_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8_REG_6_0_Pos) 	/*!< 0x0000007F */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8_REG_6_0 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8_REG_6_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8_REG_7 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_TBIT8_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_LDO_PWRUP_CNT 	(0x0000B494UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_LDO_PWRUP_CNT_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_LDO_PWRUP_CNT_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_W_LDO_PWRUP_CNT_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_W_LDO_PWRUP_CNT_REG_7_0 	MIPI_DPHY_BLOCK_TX1_W_LDO_PWRUP_CNT_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_DATA_LPTX_DATA 	(0x0000B498UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_DATA_LPTX_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_DATA_LPTX_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_W_DATA_LPTX_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_W_DATA_LPTX_REG_7_0 	MIPI_DPHY_BLOCK_TX1_W_DATA_LPTX_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL 	(0x0000B49CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_0 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_1_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_1 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_1_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_2 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_3_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_3_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_3 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_3_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_4 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_4_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_5 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_5_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_6_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_6_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_6_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_6 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_6_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_7 	MIPI_DPHY_BLOCK_TX1_W_TX_DATA_LP_CTRL_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_O_ANA_TX_DATA_SLEW_SET 	(0x0000B4A0UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_SLEW_SET_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_SLEW_SET_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_SLEW_SET_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_SLEW_SET_REG_7_0 	MIPI_DPHY_BLOCK_TX1_O_ANA_TX_DATA_SLEW_SET_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_BURNIN 	(0x0000B4A4UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_BURNIN_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_BURNIN_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_BIST_BURNIN_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_BURNIN_REG_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_BURNIN_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_BURNIN_REG_7_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_BURNIN_REG_7_1_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_TX1_W_BIST_BURNIN_REG_7_1_Pos) 	/*!< 0x000000FE */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_BURNIN_REG_7_1 	MIPI_DPHY_BLOCK_TX1_W_BIST_BURNIN_REG_7_1_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_EN 	(0x0000B4A8UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_EN_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_EN_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_BIST_EN_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_EN_REG_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_EN_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_EN_REG_7_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_EN_REG_7_1_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_TX1_W_BIST_EN_REG_7_1_Pos) 	/*!< 0x000000FE */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_EN_REG_7_1 	MIPI_DPHY_BLOCK_TX1_W_BIST_EN_REG_7_1_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_TEST_MODE 	(0x0000B4ACUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_MODE_REG_2_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_MODE_REG_2_0_Msk 	(0x7UL << MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_MODE_REG_2_0_Pos) 	/*!< 0x00000007 */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_MODE_REG_2_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_MODE_REG_2_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_MODE_REG_7_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_MODE_REG_7_3_Msk 	(0x1FUL << MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_MODE_REG_7_3_Pos) 	/*!< 0x000000F8 */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_MODE_REG_7_3 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_MODE_REG_7_3_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE 	(0x0000B4B0UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE_REG_1_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE_REG_1_0_Msk 	(0x3UL << MIPI_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE_REG_1_0_Pos) 	/*!< 0x00000003 */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE_REG_1_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE_REG_1_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE_REG_7_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE_REG_7_2_Msk 	(0x3FUL << MIPI_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE_REG_7_2_Pos) 	/*!< 0x000000FC */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE_REG_7_2 	MIPI_DPHY_BLOCK_TX1_W_BIST_PRBS_MODE_REG_7_2_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_FREEZE 	(0x0000B4B4UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_FREEZE_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_FREEZE_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_BIST_FREEZE_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_FREEZE_REG_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_FREEZE_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_FREEZE_REG_7_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_FREEZE_REG_7_1_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_TX1_W_BIST_FREEZE_REG_7_1_Pos) 	/*!< 0x000000FE */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_FREEZE_REG_7_1 	MIPI_DPHY_BLOCK_TX1_W_BIST_FREEZE_REG_7_1_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR 	(0x0000B4B8UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR_REG_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR_REG_7_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR_REG_7_1_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR_REG_7_1_Pos) 	/*!< 0x000000FE */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR_REG_7_1 	MIPI_DPHY_BLOCK_TX1_W_BIST_INJECT_ERR_REG_7_1_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_IDLE_TIME 	(0x0000B4BCUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_IDLE_TIME_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_IDLE_TIME_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_W_BIST_IDLE_TIME_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_IDLE_TIME_REG_7_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_IDLE_TIME_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_LOW_PULSE_TIME 	(0x0000B4C0UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_LOW_PULSE_TIME_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_LOW_PULSE_TIME_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_W_BIST_LOW_PULSE_TIME_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_LOW_PULSE_TIME_REG_7_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_LOW_PULSE_TIME_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_TOTAL_PULSE_TIME 	(0x0000B4C4UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TOTAL_PULSE_TIME_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TOTAL_PULSE_TIME_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_W_BIST_TOTAL_PULSE_TIME_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TOTAL_PULSE_TIME_REG_7_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_TOTAL_PULSE_TIME_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_TEST_PAT1 	(0x0000B4C8UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_PAT1_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_PAT1_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_PAT1_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_PAT1_REG_7_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_PAT1_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_TEST_PAT2 	(0x0000B4CCUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_PAT2_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_PAT2_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_PAT2_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_PAT2_REG_7_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_TEST_PAT2_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_PKT_NUM 	(0x0000B4D0UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_PKT_NUM_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_PKT_NUM_REG_7_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_BIST_PKT_NUM_REG_7_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_PKT_NUM_REG_7_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_PKT_NUM_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_FRAME_IDLE_TIME 	(0x0000B4D4UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_FRAME_IDLE_TIME_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_FRAME_IDLE_TIME_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_W_BIST_FRAME_IDLE_TIME_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_FRAME_IDLE_TIME_REG_7_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_FRAME_IDLE_TIME_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_RUN_LEN 	(0x0000B4D8UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_RUN_LEN_REG_11_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_RUN_LEN_REG_11_0_Msk 	(0xFFFUL << MIPI_DPHY_BLOCK_TX1_W_BIST_RUN_LEN_REG_11_0_Pos) 	/*!< 0x00000FFF */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_RUN_LEN_REG_11_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_RUN_LEN_REG_11_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_BIST_ERR_INJECT_POINT 	(0x0000B4DCUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_ERR_INJECT_POINT_REG_11_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_ERR_INJECT_POINT_REG_11_0_Msk 	(0xFFFUL << MIPI_DPHY_BLOCK_TX1_W_BIST_ERR_INJECT_POINT_REG_11_0_Pos) 	/*!< 0x00000FFF */
#define 	MIPI_DPHY_BLOCK_TX1_W_BIST_ERR_INJECT_POINT_REG_11_0 	MIPI_DPHY_BLOCK_TX1_W_BIST_ERR_INJECT_POINT_REG_11_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_O_TM_PD_DISABLE 	(0x0000B4E0UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_O_TM_PD_DISABLE_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_O_TM_PD_DISABLE_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_O_TM_PD_DISABLE_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_O_TM_PD_DISABLE_REG_7_0 	MIPI_DPHY_BLOCK_TX1_O_TM_PD_DISABLE_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_W_REG29 	(0x0000B4E4UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_W_REG29_REG_6_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_W_REG29_REG_6_0_Msk 	(0x7FUL << MIPI_DPHY_BLOCK_TX1_W_REG29_REG_6_0_Pos) 	/*!< 0x0000007F */
#define 	MIPI_DPHY_BLOCK_TX1_W_REG29_REG_6_0 	MIPI_DPHY_BLOCK_TX1_W_REG29_REG_6_0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_W_REG29_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_TX1_W_REG29_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_W_REG29_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_W_REG29_REG_7 	MIPI_DPHY_BLOCK_TX1_W_REG29_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_DATA_EDGE_DETECT 	(0x0000B4E8UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_DATA_EDGE_DETECT_REG_7_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_DATA_EDGE_DETECT_REG_7_0_Msk 	(0xFFUL << MIPI_DPHY_BLOCK_TX1_DATA_EDGE_DETECT_REG_7_0_Pos) 	/*!< 0x000000FF */
#define 	MIPI_DPHY_BLOCK_TX1_DATA_EDGE_DETECT_REG_7_0 	MIPI_DPHY_BLOCK_TX1_DATA_EDGE_DETECT_REG_7_0_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_LPDET_ULPDET 	(0x0000B4ECUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_DATA_SWAPDPDN_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_DATA_SWAPDPDN_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_DATA_SWAPDPDN_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_DATA_SWAPDPDN 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_DATA_SWAPDPDN_Msk
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_FORCETXSTOPMODE_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_FORCETXSTOPMODE_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_FORCETXSTOPMODE_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_FORCETXSTOPMODE 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_FORCETXSTOPMODE_Msk
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ENABLE_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ENABLE_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ENABLE_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ENABLE 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ENABLE_Msk
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_LPDTESC_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_LPDTESC_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_LPDTESC_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_LPDTESC 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_LPDTESC_Msk
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_REQUESTESC_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_REQUESTESC_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_REQUESTESC_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_REQUESTESC 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_REQUESTESC_Msk
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ULPSEXITESC_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ULPSEXITESC_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ULPSEXITESC_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ULPSEXITESC 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ULPSEXITESC_Msk
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ULPSESC_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ULPSESC_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ULPSESC_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ULPSESC 	MIPI_DPHY_BLOCK_TX1_LPDET_ULPDET_ULPSESC_Msk
#define MIPI_DPHY_DPHY_BLOCK_TX1_ESCAPE 	(0x0000B4F0UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRSYNCESC_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRSYNCESC_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRSYNCESC_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRSYNCESC 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRSYNCESC_Msk
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRESC_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRESC_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRESC_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRESC 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRESC_Msk
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTROL_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTROL_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTROL_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTROL 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTROL_Msk
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTENTIONLP1_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTENTIONLP1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTENTIONLP1_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTENTIONLP1 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTENTIONLP1_Msk
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTENTIONLP0_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTENTIONLP0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTENTIONLP0_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTENTIONLP0 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ERRCONTENTIONLP0_Msk
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ULPSACTIVENOT_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ULPSACTIVENOT_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_ESCAPE_ULPSACTIVENOT_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ULPSACTIVENOT 	MIPI_DPHY_BLOCK_TX1_ESCAPE_ULPSACTIVENOT_Msk
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_STOPSTATE_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_STOPSTATE_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_ESCAPE_STOPSTATE_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_STOPSTATE 	MIPI_DPHY_BLOCK_TX1_ESCAPE_STOPSTATE_Msk
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_DIRECTION_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_DIRECTION_Msk 	(0x1UL << MIPI_DPHY_BLOCK_TX1_ESCAPE_DIRECTION_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_TX1_ESCAPE_DIRECTION 	MIPI_DPHY_BLOCK_TX1_ESCAPE_DIRECTION_Msk
#define MIPI_DPHY_DPHY_BLOCK_BIST_RESULTS_REG 	(0x0000B98CUL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_BIST_RESULTS_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_0 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_BIST_RESULTS_REG_1_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_1 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_1_Msk
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_BIST_RESULTS_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_2 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_3_Msk 	(0x1UL << MIPI_DPHY_BLOCK_BIST_RESULTS_REG_3_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_3 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_3_Msk
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_BIST_RESULTS_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_4 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_4_Msk
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_BIST_RESULTS_REG_5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_5 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_5_Msk
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_6_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_6_Msk 	(0x1UL << MIPI_DPHY_BLOCK_BIST_RESULTS_REG_6_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_6 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_6_Msk
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_BIST_RESULTS_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_7 	MIPI_DPHY_BLOCK_BIST_RESULTS_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_STATUS_CLK_LANE_REG 	(0x0000B990UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_0 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_1_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_1 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_1_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_2 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_3_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_3_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_3 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_3_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_4 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_4_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_5 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_5_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_6_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_6_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_6_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_6 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_6_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_7 	MIPI_DPHY_BLOCK_STATUS_CLK_LANE_REG_7_Msk
#define MIPI_DPHY_DPHY_BLOCK_STATUS_TX1_LANE_REG 	(0x0000B994UL) 	/*<!  */
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_0_Pos 	(0x0U)
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_0_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_0_Pos) 	/*!< 0x00000001 */
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_0 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_0_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_1_Pos 	(0x1U)
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_1_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_1_Pos) 	/*!< 0x00000002 */
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_1 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_1_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_2_Pos 	(0x2U)
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_2_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_2_Pos) 	/*!< 0x00000004 */
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_2 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_2_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_3_Pos 	(0x3U)
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_3_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_3_Pos) 	/*!< 0x00000008 */
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_3 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_3_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_4_Pos 	(0x4U)
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_4_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_4_Pos) 	/*!< 0x00000010 */
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_4 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_4_Msk
