jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_5_Pos 	(0x5U)
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_5_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_5_Pos) 	/*!< 0x00000020 */
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_5 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_5_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_6_Pos 	(0x6U)
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_6_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_6_Pos) 	/*!< 0x00000040 */
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_6 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_6_Msk
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_7_Pos 	(0x7U)
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_7_Msk 	(0x1UL << MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_7_Pos) 	/*!< 0x00000080 */
#define 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_7 	MIPI_DPHY_BLOCK_STATUS_TX1_LANE_REG_7_Msk

/* ------------------------------------------------------")
 * AFK: Anti Flickering Filter Register Map
 * ------------------------------------------------------ */

#define AFK_PIPELINE_CONTROL 	(0x0000C000UL) 	/*<! Block Control register */
#define 	AFK_PIPELINE_CONTROL_ENABLE_Pos 	(0x0U)
#define 	AFK_PIPELINE_CONTROL_ENABLE_Msk 	(0x1UL << AFK_PIPELINE_CONTROL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	AFK_PIPELINE_CONTROL_ENABLE 	AFK_PIPELINE_CONTROL_ENABLE_Msk
#define 	AFK_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos 	(0x1U)
#define 	AFK_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk 	(0x1UL << AFK_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos) 	/*!< 0x00000002 */
#define 	AFK_PIPELINE_CONTROL_DROP_NBACKPRESSURE 	AFK_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk
#define 	AFK_PIPELINE_CONTROL_BYPASS_Pos 	(0x2U)
#define 	AFK_PIPELINE_CONTROL_BYPASS_Msk 	(0x1UL << AFK_PIPELINE_CONTROL_BYPASS_Pos) 	/*!< 0x00000004 */
#define 	AFK_PIPELINE_CONTROL_BYPASS 	AFK_PIPELINE_CONTROL_BYPASS_Msk
#define AFK_PIPELINE_STATUS 	(0x0000C004UL) 	/*<! Block Status Register: This register give information about the internal status of the block. */
#define 	AFK_PIPELINE_STATUS_EMPTY_Pos 	(0x0U)
#define 	AFK_PIPELINE_STATUS_EMPTY_Msk 	(0x1UL << AFK_PIPELINE_STATUS_EMPTY_Pos) 	/*!< 0x00000001 */
#define 	AFK_PIPELINE_STATUS_EMPTY 	AFK_PIPELINE_STATUS_EMPTY_Msk
#define 	AFK_PIPELINE_STATUS_BUSY_Pos 	(0x1U)
#define 	AFK_PIPELINE_STATUS_BUSY_Msk 	(0x1UL << AFK_PIPELINE_STATUS_BUSY_Pos) 	/*!< 0x00000002 */
#define 	AFK_PIPELINE_STATUS_BUSY 	AFK_PIPELINE_STATUS_BUSY_Msk
#define 	AFK_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Pos 	(0x2U)
#define 	AFK_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Msk 	(0x1UL << AFK_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Pos) 	/*!< 0x00000004 */
#define 	AFK_PIPELINE_STATUS_DEEP_LOW_POWER_READY 	AFK_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Msk
#define AFK_AFK_PARAM 	(0x0000C008UL) 	/*<! AntiFlickering Parameter register */
#define 	AFK_PARAM_COUNTER_LOW_Pos 	(0x0U)
#define 	AFK_PARAM_COUNTER_LOW_Msk 	(0x7UL << AFK_PARAM_COUNTER_LOW_Pos) 	/*!< 0x00000007 */
#define 	AFK_PARAM_COUNTER_LOW 	AFK_PARAM_COUNTER_LOW_Msk
#define 	AFK_PARAM_COUNTER_HIGH_Pos 	(0x3U)
#define 	AFK_PARAM_COUNTER_HIGH_Msk 	(0x7UL << AFK_PARAM_COUNTER_HIGH_Pos) 	/*!< 0x00000038 */
#define 	AFK_PARAM_COUNTER_HIGH 	AFK_PARAM_COUNTER_HIGH_Msk
#define 	AFK_PARAM_INVERT_Pos 	(0x6U)
#define 	AFK_PARAM_INVERT_Msk 	(0x1UL << AFK_PARAM_INVERT_Pos) 	/*!< 0x00000040 */
#define 	AFK_PARAM_INVERT 	AFK_PARAM_INVERT_Msk
#define 	AFK_PARAM_DROP_DISABLE_Pos 	(0x7U)
#define 	AFK_PARAM_DROP_DISABLE_Msk 	(0x1UL << AFK_PARAM_DROP_DISABLE_Pos) 	/*!< 0x00000080 */
#define 	AFK_PARAM_DROP_DISABLE 	AFK_PARAM_DROP_DISABLE_Msk
#define AFK_FILTER_PERIOD 	(0x0000C00CUL) 	/*<! AntiFlickering Filter Period definition Register */
#define 	AFK_FILTER_PERIOD_MIN_CUTOFF_Pos 	(0x0U)
#define 	AFK_FILTER_PERIOD_MIN_CUTOFF_Msk 	(0xFFUL << AFK_FILTER_PERIOD_MIN_CUTOFF_Pos) 	/*!< 0x000000FF */
#define 	AFK_FILTER_PERIOD_MIN_CUTOFF 	AFK_FILTER_PERIOD_MIN_CUTOFF_Msk
#define 	AFK_FILTER_PERIOD_MAX_CUTOFF_Pos 	(0x8U)
#define 	AFK_FILTER_PERIOD_MAX_CUTOFF_Msk 	(0xFFUL << AFK_FILTER_PERIOD_MAX_CUTOFF_Pos) 	/*!< 0x0000FF00 */
#define 	AFK_FILTER_PERIOD_MAX_CUTOFF 	AFK_FILTER_PERIOD_MAX_CUTOFF_Msk
#define 	AFK_FILTER_PERIOD_INVERTED_DUTY_CYCLE_Pos 	(0x10U)
#define 	AFK_FILTER_PERIOD_INVERTED_DUTY_CYCLE_Msk 	(0xFUL << AFK_FILTER_PERIOD_INVERTED_DUTY_CYCLE_Pos) 	/*!< 0x000F0000 */
#define 	AFK_FILTER_PERIOD_INVERTED_DUTY_CYCLE 	AFK_FILTER_PERIOD_INVERTED_DUTY_CYCLE_Msk
#define AFK_INVALIDATION 	(0x0000C0C0UL) 	/*<! Timestamping life time invalidation control */
#define 	AFK_INVALIDATION_DT_FIFO_WAIT_TIME_Pos 	(0x0U)
#define 	AFK_INVALIDATION_DT_FIFO_WAIT_TIME_Msk 	(0xFFFUL << AFK_INVALIDATION_DT_FIFO_WAIT_TIME_Pos) 	/*!< 0x00000FFF */
#define 	AFK_INVALIDATION_DT_FIFO_WAIT_TIME 	AFK_INVALIDATION_DT_FIFO_WAIT_TIME_Msk
#define 	AFK_INVALIDATION_DT_FIFO_TIMEOUT_Pos 	(0xCU)
#define 	AFK_INVALIDATION_DT_FIFO_TIMEOUT_Msk 	(0xFFFUL << AFK_INVALIDATION_DT_FIFO_TIMEOUT_Pos) 	/*!< 0x00FFF000 */
#define 	AFK_INVALIDATION_DT_FIFO_TIMEOUT 	AFK_INVALIDATION_DT_FIFO_TIMEOUT_Msk
#define 	AFK_INVALIDATION_IN_PARALLEL_Pos 	(0x18U)
#define 	AFK_INVALIDATION_IN_PARALLEL_Msk 	(0x7UL << AFK_INVALIDATION_IN_PARALLEL_Pos) 	/*!< 0x07000000 */
#define 	AFK_INVALIDATION_IN_PARALLEL 	AFK_INVALIDATION_IN_PARALLEL_Msk
#define 	AFK_INVALIDATION_FLAG_INV_BUSY_Pos 	(0x1BU)
#define 	AFK_INVALIDATION_FLAG_INV_BUSY_Msk 	(0x1UL << AFK_INVALIDATION_FLAG_INV_BUSY_Pos) 	/*!< 0x08000000 */
#define 	AFK_INVALIDATION_FLAG_INV_BUSY 	AFK_INVALIDATION_FLAG_INV_BUSY_Msk
#define AFK_INITIALISATION 	(0x0000C0C4UL) 	/*<! Time stamping life time initialisation control */
#define 	AFK_INITIALISATION_REQ_INIT_Pos 	(0x0U)
#define 	AFK_INITIALISATION_REQ_INIT_Msk 	(0x1UL << AFK_INITIALISATION_REQ_INIT_Pos) 	/*!< 0x00000001 */
#define 	AFK_INITIALISATION_REQ_INIT 	AFK_INITIALISATION_REQ_INIT_Msk
#define 	AFK_INITIALISATION_FLAG_INIT_BUSY_Pos 	(0x1U)
#define 	AFK_INITIALISATION_FLAG_INIT_BUSY_Msk 	(0x1UL << AFK_INITIALISATION_FLAG_INIT_BUSY_Pos) 	/*!< 0x00000002 */
#define 	AFK_INITIALISATION_FLAG_INIT_BUSY 	AFK_INITIALISATION_FLAG_INIT_BUSY_Msk
#define 	AFK_INITIALISATION_FLAG_INIT_DONE_Pos 	(0x2U)
#define 	AFK_INITIALISATION_FLAG_INIT_DONE_Msk 	(0x1UL << AFK_INITIALISATION_FLAG_INIT_DONE_Pos) 	/*!< 0x00000004 */
#define 	AFK_INITIALISATION_FLAG_INIT_DONE 	AFK_INITIALISATION_FLAG_INIT_DONE_Msk
#define AFK_ICN_SRAM_CTRL 	(0x0000C0C8UL) 	/*<! ICN SRAM Access: Request Control */
#define 	AFK_ICN_SRAM_CTRL_REQ_TRIGGER_Pos 	(0x0U)
#define 	AFK_ICN_SRAM_CTRL_REQ_TRIGGER_Msk 	(0x1UL << AFK_ICN_SRAM_CTRL_REQ_TRIGGER_Pos) 	/*!< 0x00000001 */
#define 	AFK_ICN_SRAM_CTRL_REQ_TRIGGER 	AFK_ICN_SRAM_CTRL_REQ_TRIGGER_Msk
#define 	AFK_ICN_SRAM_CTRL_REQ_TYPE_Pos 	(0x1U)
#define 	AFK_ICN_SRAM_CTRL_REQ_TYPE_Msk 	(0x1UL << AFK_ICN_SRAM_CTRL_REQ_TYPE_Pos) 	/*!< 0x00000002 */
#define 	AFK_ICN_SRAM_CTRL_REQ_TYPE 	AFK_ICN_SRAM_CTRL_REQ_TYPE_Msk
#define 	AFK_ICN_SRAM_CTRL_DATA_SEL_Pos 	(0x2U)
#define 	AFK_ICN_SRAM_CTRL_DATA_SEL_Msk 	(0x7UL << AFK_ICN_SRAM_CTRL_DATA_SEL_Pos) 	/*!< 0x0000001C */
#define 	AFK_ICN_SRAM_CTRL_DATA_SEL 	AFK_ICN_SRAM_CTRL_DATA_SEL_Msk
#define AFK_ICN_SRAM_ADDRESS 	(0x0000C0CCUL) 	/*<! ICN SRAM Access: Address */
#define 	AFK_ICN_SRAM_ADDRESS_X_ADDR_Pos 	(0x0U)
#define 	AFK_ICN_SRAM_ADDRESS_X_ADDR_Msk 	(0x7FFUL << AFK_ICN_SRAM_ADDRESS_X_ADDR_Pos) 	/*!< 0x000007FF */
#define 	AFK_ICN_SRAM_ADDRESS_X_ADDR 	AFK_ICN_SRAM_ADDRESS_X_ADDR_Msk
#define 	AFK_ICN_SRAM_ADDRESS_Y_ADDR_Pos 	(0x10U)
#define 	AFK_ICN_SRAM_ADDRESS_Y_ADDR_Msk 	(0x7FFUL << AFK_ICN_SRAM_ADDRESS_Y_ADDR_Pos) 	/*!< 0x07FF0000 */
#define 	AFK_ICN_SRAM_ADDRESS_Y_ADDR 	AFK_ICN_SRAM_ADDRESS_Y_ADDR_Msk
#define AFK_ICN_SRAM_DATA 	(0x0000C0D0UL) 	/*<! ICN SRAM Access: Read/Write Data */
#define 	AFK_ICN_SRAM_DATA_VAL_Pos 	(0x0U)
#define 	AFK_ICN_SRAM_DATA_VAL_Msk 	(0xFFFFFFFFUL << AFK_ICN_SRAM_DATA_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	AFK_ICN_SRAM_DATA_VAL 	AFK_ICN_SRAM_DATA_VAL_Msk
#define AFK_SHADOW_CTRL 	(0x0000C0D4UL) 	/*<! Atomic register read control */
#define 	AFK_SHADOW_CTRL_TIMER_EN_Pos 	(0x0U)
#define 	AFK_SHADOW_CTRL_TIMER_EN_Msk 	(0x1UL << AFK_SHADOW_CTRL_TIMER_EN_Pos) 	/*!< 0x00000001 */
#define 	AFK_SHADOW_CTRL_TIMER_EN 	AFK_SHADOW_CTRL_TIMER_EN_Msk
#define 	AFK_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos 	(0x1U)
#define 	AFK_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk 	(0x1UL << AFK_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos) 	/*!< 0x00000002 */
#define 	AFK_SHADOW_CTRL_IRQ_SW_OVERRIDE 	AFK_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk
#define 	AFK_SHADOW_CTRL_RESET_ON_COPY_Pos 	(0x2U)
#define 	AFK_SHADOW_CTRL_RESET_ON_COPY_Msk 	(0x1UL << AFK_SHADOW_CTRL_RESET_ON_COPY_Pos) 	/*!< 0x00000004 */
#define 	AFK_SHADOW_CTRL_RESET_ON_COPY 	AFK_SHADOW_CTRL_RESET_ON_COPY_Msk
#define AFK_SHADOW_TIMER_THRESHOLD 	(0x0000C0D8UL) 	/*<! Atomic register timer */
#define 	AFK_SHADOW_TIMER_THRESHOLD_Pos 	(0x0U)
#define 	AFK_SHADOW_TIMER_THRESHOLD_Msk 	(0xFFFFFFFFUL << AFK_SHADOW_TIMER_THRESHOLD_Pos) 	/*!< 0xFFFFFFFF */
#define AFK_SHADOW_STATUS 	(0x0000C0DCUL) 	/*<! Atomic register read control */
#define 	AFK_SHADOW_STATUS_VALID_Pos 	(0x0U)
#define 	AFK_SHADOW_STATUS_VALID_Msk 	(0x1UL << AFK_SHADOW_STATUS_VALID_Pos) 	/*!< 0x00000001 */
#define 	AFK_SHADOW_STATUS_VALID 	AFK_SHADOW_STATUS_VALID_Msk
#define 	AFK_SHADOW_STATUS_OVERRUN_Pos 	(0x1U)
#define 	AFK_SHADOW_STATUS_OVERRUN_Msk 	(0x1UL << AFK_SHADOW_STATUS_OVERRUN_Pos) 	/*!< 0x00000002 */
#define 	AFK_SHADOW_STATUS_OVERRUN 	AFK_SHADOW_STATUS_OVERRUN_Msk
#define AFK_TOTAL_EVT_CNT 	(0x0000C0E0UL) 	/*<!  */
#define 	AFK_TOTAL_EVT_CNT_VAL_Pos 	(0x0U)
#define 	AFK_TOTAL_EVT_CNT_VAL_Msk 	(0xFFFFFFFFUL << AFK_TOTAL_EVT_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	AFK_TOTAL_EVT_CNT_VAL 	AFK_TOTAL_EVT_CNT_VAL_Msk
#define AFK_FLICKER_EVT_CNT 	(0x0000C0E4UL) 	/*<!  */
#define 	AFK_FLICKER_EVT_CNT_VAL_Pos 	(0x0U)
#define 	AFK_FLICKER_EVT_CNT_VAL_Msk 	(0xFFFFFFFFUL << AFK_FLICKER_EVT_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	AFK_FLICKER_EVT_CNT_VAL 	AFK_FLICKER_EVT_CNT_VAL_Msk
#define AFK_OUTPUT_VECTOR_CNT 	(0x0000C0E8UL) 	/*<!  */
#define 	AFK_OUTPUT_VECTOR_CNT_VAL_Pos 	(0x0U)
#define 	AFK_OUTPUT_VECTOR_CNT_VAL_Msk 	(0xFFFFFFFFUL << AFK_OUTPUT_VECTOR_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	AFK_OUTPUT_VECTOR_CNT_VAL 	AFK_OUTPUT_VECTOR_CNT_VAL_Msk
#define AFK_PERF_CTRL 	(0x0000C0ECUL) 	/*<!  */
#define 	AFK_PERF_CTRL_LITE_VERSION_ENABLE_Pos 	(0x0U)
#define 	AFK_PERF_CTRL_LITE_VERSION_ENABLE_Msk 	(0x1UL << AFK_PERF_CTRL_LITE_VERSION_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	AFK_PERF_CTRL_LITE_VERSION_ENABLE 	AFK_PERF_CTRL_LITE_VERSION_ENABLE_Msk
#define AFK_CHICKEN0_BITS 	(0x0000C1C0UL) 	/*<! Private register0. It helps unrisking the design by adding deep control bits */
#define 	AFK_CHICKEN0_BITS_POWERDOWN_ENABLE_Pos 	(0x0U)
#define 	AFK_CHICKEN0_BITS_POWERDOWN_ENABLE_Msk 	(0x1UL << AFK_CHICKEN0_BITS_POWERDOWN_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	AFK_CHICKEN0_BITS_POWERDOWN_ENABLE 	AFK_CHICKEN0_BITS_POWERDOWN_ENABLE_Msk
#define 	AFK_CHICKEN0_BITS_INV_POWERDOWN_ENABLE_Pos 	(0x1U)
#define 	AFK_CHICKEN0_BITS_INV_POWERDOWN_ENABLE_Msk 	(0x1UL << AFK_CHICKEN0_BITS_INV_POWERDOWN_ENABLE_Pos) 	/*!< 0x00000002 */
#define 	AFK_CHICKEN0_BITS_INV_POWERDOWN_ENABLE 	AFK_CHICKEN0_BITS_INV_POWERDOWN_ENABLE_Msk
#define 	AFK_CHICKEN0_BITS_SRAM_CLK_GATING_ENABLE_Pos 	(0x3U)
#define 	AFK_CHICKEN0_BITS_SRAM_CLK_GATING_ENABLE_Msk 	(0x1UL << AFK_CHICKEN0_BITS_SRAM_CLK_GATING_ENABLE_Pos) 	/*!< 0x00000008 */
#define 	AFK_CHICKEN0_BITS_SRAM_CLK_GATING_ENABLE 	AFK_CHICKEN0_BITS_SRAM_CLK_GATING_ENABLE_Msk
#define 	AFK_CHICKEN0_BITS_ENABLE_INV_ABS_TIMEBASE_Pos 	(0x4U)
#define 	AFK_CHICKEN0_BITS_ENABLE_INV_ABS_TIMEBASE_Msk 	(0x1UL << AFK_CHICKEN0_BITS_ENABLE_INV_ABS_TIMEBASE_Pos) 	/*!< 0x00000010 */
#define 	AFK_CHICKEN0_BITS_ENABLE_INV_ABS_TIMEBASE 	AFK_CHICKEN0_BITS_ENABLE_INV_ABS_TIMEBASE_Msk
#define AFK_CHICKEN1_BITS 	(0x0000C1C4UL) 	/*<! AFK dedicated private register1. It helps unrisking the design by adding deep control bits */
#define 	AFK_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_TS_Pos 	(0x0U)
#define 	AFK_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_TS_Msk 	(0x1UL << AFK_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_TS_Pos) 	/*!< 0x00000001 */
#define 	AFK_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_TS 	AFK_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_TS_Msk
#define 	AFK_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_BURST_Pos 	(0x1U)
#define 	AFK_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_BURST_Msk 	(0x1UL << AFK_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_BURST_Pos) 	/*!< 0x00000002 */
#define 	AFK_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_BURST 	AFK_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_BURST_Msk
#define 	AFK_CHICKEN1_BITS_ENABLE_INV_ABS_THRESHOLD_Pos 	(0x10U)
#define 	AFK_CHICKEN1_BITS_ENABLE_INV_ABS_THRESHOLD_Msk 	(0xFFFUL << AFK_CHICKEN1_BITS_ENABLE_INV_ABS_THRESHOLD_Pos) 	/*!< 0x0FFF0000 */
#define 	AFK_CHICKEN1_BITS_ENABLE_INV_ABS_THRESHOLD 	AFK_CHICKEN1_BITS_ENABLE_INV_ABS_THRESHOLD_Msk

