jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * STC: Spatio Temporal Contrast Filter Register Map
 * ------------------------------------------------------ */

#define STC_PIPELINE_CONTROL 	(0x0000D000UL) 	/*<! Block Control register */
#define 	STC_PIPELINE_CONTROL_ENABLE_Pos 	(0x0U)
#define 	STC_PIPELINE_CONTROL_ENABLE_Msk 	(0x1UL << STC_PIPELINE_CONTROL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	STC_PIPELINE_CONTROL_ENABLE 	STC_PIPELINE_CONTROL_ENABLE_Msk
#define 	STC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos 	(0x1U)
#define 	STC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk 	(0x1UL << STC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos) 	/*!< 0x00000002 */
#define 	STC_PIPELINE_CONTROL_DROP_NBACKPRESSURE 	STC_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk
#define 	STC_PIPELINE_CONTROL_BYPASS_Pos 	(0x2U)
#define 	STC_PIPELINE_CONTROL_BYPASS_Msk 	(0x1UL << STC_PIPELINE_CONTROL_BYPASS_Pos) 	/*!< 0x00000004 */
#define 	STC_PIPELINE_CONTROL_BYPASS 	STC_PIPELINE_CONTROL_BYPASS_Msk
#define STC_PIPELINE_STATUS 	(0x0000D004UL) 	/*<! Block Status Register: This register give information about the internal status of the block. */
#define 	STC_PIPELINE_STATUS_EMPTY_Pos 	(0x0U)
#define 	STC_PIPELINE_STATUS_EMPTY_Msk 	(0x1UL << STC_PIPELINE_STATUS_EMPTY_Pos) 	/*!< 0x00000001 */
#define 	STC_PIPELINE_STATUS_EMPTY 	STC_PIPELINE_STATUS_EMPTY_Msk
#define 	STC_PIPELINE_STATUS_BUSY_Pos 	(0x1U)
#define 	STC_PIPELINE_STATUS_BUSY_Msk 	(0x1UL << STC_PIPELINE_STATUS_BUSY_Pos) 	/*!< 0x00000002 */
#define 	STC_PIPELINE_STATUS_BUSY 	STC_PIPELINE_STATUS_BUSY_Msk
#define 	STC_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Pos 	(0x2U)
#define 	STC_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Msk 	(0x1UL << STC_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Pos) 	/*!< 0x00000004 */
#define 	STC_PIPELINE_STATUS_DEEP_LOW_POWER_READY 	STC_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Msk
#define STC_STC_PARAM 	(0x0000D008UL) 	/*<! Spatio Temporal Contrast parameters register */
#define 	STC_PARAM_ENABLE_Pos 	(0x0U)
#define 	STC_PARAM_ENABLE_Msk 	(0x1UL << STC_PARAM_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	STC_PARAM_ENABLE 	STC_PARAM_ENABLE_Msk
#define 	STC_PARAM_THRESHOLD_Pos 	(0x1U)
#define 	STC_PARAM_THRESHOLD_Msk 	(0x7FFFFUL << STC_PARAM_THRESHOLD_Pos) 	/*!< 0x000FFFFE */
#define 	STC_PARAM_THRESHOLD 	STC_PARAM_THRESHOLD_Msk
#define 	STC_PARAM_DISABLE_CUT_TRAIL_Pos 	(0x18U)
#define 	STC_PARAM_DISABLE_CUT_TRAIL_Msk 	(0x1UL << STC_PARAM_DISABLE_CUT_TRAIL_Pos) 	/*!< 0x01000000 */
#define 	STC_PARAM_DISABLE_CUT_TRAIL 	STC_PARAM_DISABLE_CUT_TRAIL_Msk
#define STC_TRAIL_PARAM 	(0x0000D00CUL) 	/*<! Trail parameters register */
#define 	STC_TRAIL_PARAM_ENABLE_Pos 	(0x0U)
#define 	STC_TRAIL_PARAM_ENABLE_Msk 	(0x1UL << STC_TRAIL_PARAM_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	STC_TRAIL_PARAM_ENABLE 	STC_TRAIL_PARAM_ENABLE_Msk
#define 	STC_TRAIL_PARAM_THRESHOLD_Pos 	(0x1U)
#define 	STC_TRAIL_PARAM_THRESHOLD_Msk 	(0x7FFFFUL << STC_TRAIL_PARAM_THRESHOLD_Pos) 	/*!< 0x000FFFFE */
#define 	STC_TRAIL_PARAM_THRESHOLD 	STC_TRAIL_PARAM_THRESHOLD_Msk
#define STC_TIMESTAMPING 	(0x0000D010UL) 	/*<! Precision tuning of timestamping */
#define 	STC_TIMESTAMPING_PRESCALER_Pos 	(0x0U)
#define 	STC_TIMESTAMPING_PRESCALER_Msk 	(0x1FUL << STC_TIMESTAMPING_PRESCALER_Pos) 	/*!< 0x0000001F */
#define 	STC_TIMESTAMPING_PRESCALER 	STC_TIMESTAMPING_PRESCALER_Msk
#define 	STC_TIMESTAMPING_MULTIPLIER_Pos 	(0x5U)
#define 	STC_TIMESTAMPING_MULTIPLIER_Msk 	(0xFUL << STC_TIMESTAMPING_MULTIPLIER_Pos) 	/*!< 0x000001E0 */
#define 	STC_TIMESTAMPING_MULTIPLIER 	STC_TIMESTAMPING_MULTIPLIER_Msk
#define 	STC_TIMESTAMPING_ENABLE_RIGHTSHIFT_ROUND_Pos 	(0x9U)
#define 	STC_TIMESTAMPING_ENABLE_RIGHTSHIFT_ROUND_Msk 	(0x1UL << STC_TIMESTAMPING_ENABLE_RIGHTSHIFT_ROUND_Pos) 	/*!< 0x00000200 */
#define 	STC_TIMESTAMPING_ENABLE_RIGHTSHIFT_ROUND 	STC_TIMESTAMPING_ENABLE_RIGHTSHIFT_ROUND_Msk
#define 	STC_TIMESTAMPING_ENABLE_LAST_TS_UPDATE_AT_EVERY_EVENT_Pos 	(0x10U)
#define 	STC_TIMESTAMPING_ENABLE_LAST_TS_UPDATE_AT_EVERY_EVENT_Msk 	(0x1UL << STC_TIMESTAMPING_ENABLE_LAST_TS_UPDATE_AT_EVERY_EVENT_Pos) 	/*!< 0x00010000 */
#define 	STC_TIMESTAMPING_ENABLE_LAST_TS_UPDATE_AT_EVERY_EVENT 	STC_TIMESTAMPING_ENABLE_LAST_TS_UPDATE_AT_EVERY_EVENT_Msk
#define STC_INVALIDATION 	(0x0000D0C0UL) 	/*<! Timestamping life time invalidation control */
#define 	STC_INVALIDATION_DT_FIFO_WAIT_TIME_Pos 	(0x0U)
#define 	STC_INVALIDATION_DT_FIFO_WAIT_TIME_Msk 	(0xFFFUL << STC_INVALIDATION_DT_FIFO_WAIT_TIME_Pos) 	/*!< 0x00000FFF */
#define 	STC_INVALIDATION_DT_FIFO_WAIT_TIME 	STC_INVALIDATION_DT_FIFO_WAIT_TIME_Msk
#define 	STC_INVALIDATION_DT_FIFO_TIMEOUT_Pos 	(0xCU)
#define 	STC_INVALIDATION_DT_FIFO_TIMEOUT_Msk 	(0xFFFUL << STC_INVALIDATION_DT_FIFO_TIMEOUT_Pos) 	/*!< 0x00FFF000 */
#define 	STC_INVALIDATION_DT_FIFO_TIMEOUT 	STC_INVALIDATION_DT_FIFO_TIMEOUT_Msk
#define 	STC_INVALIDATION_IN_PARALLEL_Pos 	(0x18U)
#define 	STC_INVALIDATION_IN_PARALLEL_Msk 	(0x7UL << STC_INVALIDATION_IN_PARALLEL_Pos) 	/*!< 0x07000000 */
#define 	STC_INVALIDATION_IN_PARALLEL 	STC_INVALIDATION_IN_PARALLEL_Msk
#define 	STC_INVALIDATION_FLAG_INV_BUSY_Pos 	(0x1BU)
#define 	STC_INVALIDATION_FLAG_INV_BUSY_Msk 	(0x1UL << STC_INVALIDATION_FLAG_INV_BUSY_Pos) 	/*!< 0x08000000 */
#define 	STC_INVALIDATION_FLAG_INV_BUSY 	STC_INVALIDATION_FLAG_INV_BUSY_Msk
#define STC_INITIALISATION 	(0x0000D0C4UL) 	/*<! Timestamping life time invalidation control register */
#define 	STC_INITIALISATION_REQ_INIT_Pos 	(0x0U)
#define 	STC_INITIALISATION_REQ_INIT_Msk 	(0x1UL << STC_INITIALISATION_REQ_INIT_Pos) 	/*!< 0x00000001 */
#define 	STC_INITIALISATION_REQ_INIT 	STC_INITIALISATION_REQ_INIT_Msk
#define 	STC_INITIALISATION_FLAG_INIT_BUSY_Pos 	(0x1U)
#define 	STC_INITIALISATION_FLAG_INIT_BUSY_Msk 	(0x1UL << STC_INITIALISATION_FLAG_INIT_BUSY_Pos) 	/*!< 0x00000002 */
#define 	STC_INITIALISATION_FLAG_INIT_BUSY 	STC_INITIALISATION_FLAG_INIT_BUSY_Msk
#define 	STC_INITIALISATION_FLAG_INIT_DONE_Pos 	(0x2U)
#define 	STC_INITIALISATION_FLAG_INIT_DONE_Msk 	(0x1UL << STC_INITIALISATION_FLAG_INIT_DONE_Pos) 	/*!< 0x00000004 */
#define 	STC_INITIALISATION_FLAG_INIT_DONE 	STC_INITIALISATION_FLAG_INIT_DONE_Msk
#define STC_ICN_SRAM_CTRL 	(0x0000D0C8UL) 	/*<! ICN SRAM Access: Request control register */
#define 	STC_ICN_SRAM_CTRL_REQ_TRIGGER_Pos 	(0x0U)
#define 	STC_ICN_SRAM_CTRL_REQ_TRIGGER_Msk 	(0x1UL << STC_ICN_SRAM_CTRL_REQ_TRIGGER_Pos) 	/*!< 0x00000001 */
#define 	STC_ICN_SRAM_CTRL_REQ_TRIGGER 	STC_ICN_SRAM_CTRL_REQ_TRIGGER_Msk
#define 	STC_ICN_SRAM_CTRL_REQ_TYPE_Pos 	(0x1U)
#define 	STC_ICN_SRAM_CTRL_REQ_TYPE_Msk 	(0x1UL << STC_ICN_SRAM_CTRL_REQ_TYPE_Pos) 	/*!< 0x00000002 */
#define 	STC_ICN_SRAM_CTRL_REQ_TYPE 	STC_ICN_SRAM_CTRL_REQ_TYPE_Msk
#define 	STC_ICN_SRAM_CTRL_DATA_SEL_Pos 	(0x2U)
#define 	STC_ICN_SRAM_CTRL_DATA_SEL_Msk 	(0x1UL << STC_ICN_SRAM_CTRL_DATA_SEL_Pos) 	/*!< 0x00000004 */
#define 	STC_ICN_SRAM_CTRL_DATA_SEL 	STC_ICN_SRAM_CTRL_DATA_SEL_Msk
#define STC_ICN_SRAM_ADDRESS 	(0x0000D0CCUL) 	/*<! ICN SRAM Access: Address */
#define 	STC_ICN_SRAM_ADDRESS_X_ADDR_Pos 	(0x0U)
#define 	STC_ICN_SRAM_ADDRESS_X_ADDR_Msk 	(0x7FFUL << STC_ICN_SRAM_ADDRESS_X_ADDR_Pos) 	/*!< 0x000007FF */
#define 	STC_ICN_SRAM_ADDRESS_X_ADDR 	STC_ICN_SRAM_ADDRESS_X_ADDR_Msk
#define 	STC_ICN_SRAM_ADDRESS_Y_ADDR_Pos 	(0x10U)
#define 	STC_ICN_SRAM_ADDRESS_Y_ADDR_Msk 	(0x7FFUL << STC_ICN_SRAM_ADDRESS_Y_ADDR_Pos) 	/*!< 0x07FF0000 */
#define 	STC_ICN_SRAM_ADDRESS_Y_ADDR 	STC_ICN_SRAM_ADDRESS_Y_ADDR_Msk
#define STC_ICN_SRAM_DATA 	(0x0000D0D0UL) 	/*<! ICN SRAM Access: Read/Write Data */
#define 	STC_ICN_SRAM_DATA_VAL_Pos 	(0x0U)
#define 	STC_ICN_SRAM_DATA_VAL_Msk 	(0xFFFFFFFFUL << STC_ICN_SRAM_DATA_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	STC_ICN_SRAM_DATA_VAL 	STC_ICN_SRAM_DATA_VAL_Msk
#define STC_SHADOW_CTRL 	(0x0000D0D4UL) 	/*<! Atomic register read ctrl */
#define 	STC_SHADOW_CTRL_TIMER_EN_Pos 	(0x0U)
#define 	STC_SHADOW_CTRL_TIMER_EN_Msk 	(0x1UL << STC_SHADOW_CTRL_TIMER_EN_Pos) 	/*!< 0x00000001 */
#define 	STC_SHADOW_CTRL_TIMER_EN 	STC_SHADOW_CTRL_TIMER_EN_Msk
#define 	STC_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos 	(0x1U)
#define 	STC_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk 	(0x1UL << STC_SHADOW_CTRL_IRQ_SW_OVERRIDE_Pos) 	/*!< 0x00000002 */
#define 	STC_SHADOW_CTRL_IRQ_SW_OVERRIDE 	STC_SHADOW_CTRL_IRQ_SW_OVERRIDE_Msk
#define 	STC_SHADOW_CTRL_RESET_ON_COPY_Pos 	(0x2U)
#define 	STC_SHADOW_CTRL_RESET_ON_COPY_Msk 	(0x1UL << STC_SHADOW_CTRL_RESET_ON_COPY_Pos) 	/*!< 0x00000004 */
#define 	STC_SHADOW_CTRL_RESET_ON_COPY 	STC_SHADOW_CTRL_RESET_ON_COPY_Msk
#define STC_SHADOW_TIMER_THRESHOLD 	(0x0000D0D8UL) 	/*<! Atomic register timer */
#define 	STC_SHADOW_TIMER_THRESHOLD_Pos 	(0x0U)
#define 	STC_SHADOW_TIMER_THRESHOLD_Msk 	(0xFFFFFFFFUL << STC_SHADOW_TIMER_THRESHOLD_Pos) 	/*!< 0xFFFFFFFF */
#define STC_SHADOW_STATUS 	(0x0000D0DCUL) 	/*<! Atomic register read ctrl */
#define 	STC_SHADOW_STATUS_VALID_Pos 	(0x0U)
#define 	STC_SHADOW_STATUS_VALID_Msk 	(0x1UL << STC_SHADOW_STATUS_VALID_Pos) 	/*!< 0x00000001 */
#define 	STC_SHADOW_STATUS_VALID 	STC_SHADOW_STATUS_VALID_Msk
#define 	STC_SHADOW_STATUS_OVERRUN_Pos 	(0x1U)
#define 	STC_SHADOW_STATUS_OVERRUN_Msk 	(0x1UL << STC_SHADOW_STATUS_OVERRUN_Pos) 	/*!< 0x00000002 */
#define 	STC_SHADOW_STATUS_OVERRUN 	STC_SHADOW_STATUS_OVERRUN_Msk
#define STC_TOTAL_EVT_CNT 	(0x0000D0E0UL) 	/*<! Total events statistic register */
#define 	STC_TOTAL_EVT_CNT_VAL_Pos 	(0x0U)
#define 	STC_TOTAL_EVT_CNT_VAL_Msk 	(0xFFFFFFFFUL << STC_TOTAL_EVT_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	STC_TOTAL_EVT_CNT_VAL 	STC_TOTAL_EVT_CNT_VAL_Msk
#define STC_STC_EVT_CNT 	(0x0000D0E4UL) 	/*<! STC events statistic register */
#define 	STC_EVT_CNT_VAL_Pos 	(0x0U)
#define 	STC_EVT_CNT_VAL_Msk 	(0xFFFFFFFFUL << STC_EVT_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	STC_EVT_CNT_VAL 	STC_EVT_CNT_VAL_Msk
#define STC_TRAIL_EVT_CNT 	(0x0000D0E8UL) 	/*<! Trail events statistic register */
#define 	STC_TRAIL_EVT_CNT_VAL_Pos 	(0x0U)
#define 	STC_TRAIL_EVT_CNT_VAL_Msk 	(0xFFFFFFFFUL << STC_TRAIL_EVT_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	STC_TRAIL_EVT_CNT_VAL 	STC_TRAIL_EVT_CNT_VAL_Msk
#define STC_OUTPUT_VECTOR_CNT 	(0x0000D0ECUL) 	/*<! Output vector statistic register */
#define 	STC_OUTPUT_VECTOR_CNT_VAL_Pos 	(0x0U)
#define 	STC_OUTPUT_VECTOR_CNT_VAL_Msk 	(0xFFFFFFFFUL << STC_OUTPUT_VECTOR_CNT_VAL_Pos) 	/*!< 0xFFFFFFFF */
#define 	STC_OUTPUT_VECTOR_CNT_VAL 	STC_OUTPUT_VECTOR_CNT_VAL_Msk
#define STC_CHICKEN0_BITS 	(0x0000D1C0UL) 	/*<! Private register 0. It helps unrisking the design by adding deep control bits */
#define 	STC_CHICKEN0_BITS_POWERDOWN_ENABLE_Pos 	(0x0U)
#define 	STC_CHICKEN0_BITS_POWERDOWN_ENABLE_Msk 	(0x1UL << STC_CHICKEN0_BITS_POWERDOWN_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	STC_CHICKEN0_BITS_POWERDOWN_ENABLE 	STC_CHICKEN0_BITS_POWERDOWN_ENABLE_Msk
#define 	STC_CHICKEN0_BITS_INV_POWERDOWN_ENABLE_Pos 	(0x1U)
#define 	STC_CHICKEN0_BITS_INV_POWERDOWN_ENABLE_Msk 	(0x1UL << STC_CHICKEN0_BITS_INV_POWERDOWN_ENABLE_Pos) 	/*!< 0x00000002 */
#define 	STC_CHICKEN0_BITS_INV_POWERDOWN_ENABLE 	STC_CHICKEN0_BITS_INV_POWERDOWN_ENABLE_Msk
#define 	STC_CHICKEN0_BITS_SRAM_CLK_GATING_ENABLE_Pos 	(0x2U)
#define 	STC_CHICKEN0_BITS_SRAM_CLK_GATING_ENABLE_Msk 	(0x1UL << STC_CHICKEN0_BITS_SRAM_CLK_GATING_ENABLE_Pos) 	/*!< 0x00000004 */
#define 	STC_CHICKEN0_BITS_SRAM_CLK_GATING_ENABLE 	STC_CHICKEN0_BITS_SRAM_CLK_GATING_ENABLE_Msk
#define 	STC_CHICKEN0_BITS_ENABLE_INV_ABS_TIMEBASE_Pos 	(0x3U)
#define 	STC_CHICKEN0_BITS_ENABLE_INV_ABS_TIMEBASE_Msk 	(0x1UL << STC_CHICKEN0_BITS_ENABLE_INV_ABS_TIMEBASE_Pos) 	/*!< 0x00000008 */
#define 	STC_CHICKEN0_BITS_ENABLE_INV_ABS_TIMEBASE 	STC_CHICKEN0_BITS_ENABLE_INV_ABS_TIMEBASE_Msk
#define STC_CHICKEN1_BITS 	(0x0000D1C4UL) 	/*<! Private register 1. It helps unrisking the design by adding deep control bits */
#define 	STC_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_TS_Pos 	(0x0U)
#define 	STC_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_TS_Msk 	(0x1UL << STC_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_TS_Pos) 	/*!< 0x00000001 */
#define 	STC_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_TS 	STC_CHICKEN1_BITS_ENABLE_INV_ALR_LAST_TS_Msk
#define 	STC_CHICKEN1_BITS_ENABLE_INV_ABS_THRESHOLD_Pos 	(0x10U)
#define 	STC_CHICKEN1_BITS_ENABLE_INV_ABS_THRESHOLD_Msk 	(0xFFFUL << STC_CHICKEN1_BITS_ENABLE_INV_ABS_THRESHOLD_Pos) 	/*!< 0x0FFF0000 */
#define 	STC_CHICKEN1_BITS_ENABLE_INV_ABS_THRESHOLD 	STC_CHICKEN1_BITS_ENABLE_INV_ABS_THRESHOLD_Msk

