jasonwaseq/GenX320_STM32F7_Stream/STM32CubeIDE/Drivers/product-genx-ctrl/src/genx320_all_pub_registers.h
/* ------------------------------------------------------")
 * NFL: Noise Filter Register Map
 * ------------------------------------------------------ */

#define NFL_PIPELINE_CONTROL 	(0x0000E000UL) 	/*<! Block Control register */
#define 	NFL_PIPELINE_CONTROL_ENABLE_Pos 	(0x0U)
#define 	NFL_PIPELINE_CONTROL_ENABLE_Msk 	(0x1UL << NFL_PIPELINE_CONTROL_ENABLE_Pos) 	/*!< 0x00000001 */
#define 	NFL_PIPELINE_CONTROL_ENABLE 	NFL_PIPELINE_CONTROL_ENABLE_Msk
#define 	NFL_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos 	(0x1U)
#define 	NFL_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk 	(0x1UL << NFL_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Pos) 	/*!< 0x00000002 */
#define 	NFL_PIPELINE_CONTROL_DROP_NBACKPRESSURE 	NFL_PIPELINE_CONTROL_DROP_NBACKPRESSURE_Msk
#define 	NFL_PIPELINE_CONTROL_BYPASS_Pos 	(0x2U)
#define 	NFL_PIPELINE_CONTROL_BYPASS_Msk 	(0x1UL << NFL_PIPELINE_CONTROL_BYPASS_Pos) 	/*!< 0x00000004 */
#define 	NFL_PIPELINE_CONTROL_BYPASS 	NFL_PIPELINE_CONTROL_BYPASS_Msk
#define NFL_PIPELINE_STATUS 	(0x0000E004UL) 	/*<! Block Status Register: This register give information about the internal status of the block. */
#define 	NFL_PIPELINE_STATUS_EMPTY_Pos 	(0x0U)
#define 	NFL_PIPELINE_STATUS_EMPTY_Msk 	(0x1UL << NFL_PIPELINE_STATUS_EMPTY_Pos) 	/*!< 0x00000001 */
#define 	NFL_PIPELINE_STATUS_EMPTY 	NFL_PIPELINE_STATUS_EMPTY_Msk
#define 	NFL_PIPELINE_STATUS_BUSY_Pos 	(0x1U)
#define 	NFL_PIPELINE_STATUS_BUSY_Msk 	(0x1UL << NFL_PIPELINE_STATUS_BUSY_Pos) 	/*!< 0x00000002 */
#define 	NFL_PIPELINE_STATUS_BUSY 	NFL_PIPELINE_STATUS_BUSY_Msk
#define 	NFL_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Pos 	(0x2U)
#define 	NFL_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Msk 	(0x1UL << NFL_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Pos) 	/*!< 0x00000004 */
#define 	NFL_PIPELINE_STATUS_DEEP_LOW_POWER_READY 	NFL_PIPELINE_STATUS_DEEP_LOW_POWER_READY_Msk
#define NFL_REFERENCE_PERIOD 	(0x0000E008UL) 	/*<! Length of pseudo sliding window in µs. */
#define 	NFL_REFERENCE_PERIOD_VAL_Pos 	(0x0U)
#define 	NFL_REFERENCE_PERIOD_VAL_Msk 	(0x7FFUL << NFL_REFERENCE_PERIOD_VAL_Pos) 	/*!< 0x000007FF */
#define 	NFL_REFERENCE_PERIOD_VAL 	NFL_REFERENCE_PERIOD_VAL_Msk
#define NFL_MIN_VOXEL_THRESHOLD_ON 	(0x0000E00CUL) 	/*<! Threshold value used to decide the minimum voxel drop mode is turned on. */
#define 	NFL_MIN_VOXEL_THRESHOLD_ON_VAL_Pos 	(0x0U)
#define 	NFL_MIN_VOXEL_THRESHOLD_ON_VAL_Msk 	(0x1FFFFFUL << NFL_MIN_VOXEL_THRESHOLD_ON_VAL_Pos) 	/*!< 0x001FFFFF */
#define 	NFL_MIN_VOXEL_THRESHOLD_ON_VAL 	NFL_MIN_VOXEL_THRESHOLD_ON_VAL_Msk
#define NFL_MIN_VOXEL_THRESHOLD_OFF 	(0x0000E010UL) 	/*<! Threshold value used to decide the minimum voxel drop mode is turned off. */
#define 	NFL_MIN_VOXEL_THRESHOLD_OFF_VAL_Pos 	(0x0U)
#define 	NFL_MIN_VOXEL_THRESHOLD_OFF_VAL_Msk 	(0x1FFFFFUL << NFL_MIN_VOXEL_THRESHOLD_OFF_VAL_Pos) 	/*!< 0x001FFFFF */
#define 	NFL_MIN_VOXEL_THRESHOLD_OFF_VAL 	NFL_MIN_VOXEL_THRESHOLD_OFF_VAL_Msk
#define NFL_MAX_VOXEL_THRESHOLD_OFF 	(0x0000E014UL) 	/*<! Threshold value used to decide if the maximum voxel drop mode is turned off. */
#define 	NFL_MAX_VOXEL_THRESHOLD_OFF_VAL_Pos 	(0x0U)
#define 	NFL_MAX_VOXEL_THRESHOLD_OFF_VAL_Msk 	(0x1FFFFFUL << NFL_MAX_VOXEL_THRESHOLD_OFF_VAL_Pos) 	/*!< 0x001FFFFF */
#define 	NFL_MAX_VOXEL_THRESHOLD_OFF_VAL 	NFL_MAX_VOXEL_THRESHOLD_OFF_VAL_Msk
#define NFL_MAX_VOXEL_THRESHOLD_ON 	(0x0000E018UL) 	/*<! Threshold value used to decide if incoming event is dropped. */
#define 	NFL_MAX_VOXEL_THRESHOLD_ON_VAL_Pos 	(0x0U)
#define 	NFL_MAX_VOXEL_THRESHOLD_ON_VAL_Msk 	(0x1FFFFFUL << NFL_MAX_VOXEL_THRESHOLD_ON_VAL_Pos) 	/*!< 0x001FFFFF */
#define 	NFL_MAX_VOXEL_THRESHOLD_ON_VAL 	NFL_MAX_VOXEL_THRESHOLD_ON_VAL_Msk
#define NFL_INSERT_DROP_MONITORING 	(0x0000E01CUL) 	/*<! When insert_drop_monitoring.en is 1 and a TD event is dropped, a MASTER_NFL_DROP monitoring event is inserted in place of the TD event if one of the following conditions is true: max_voxel_drop or min_voxel_drop is '1' and the previous TD was not dropped; max_voxel_drop or min_voxel_drop is '1' and drop_monitor_for_each_dropped_td is 1. */
#define 	NFL_INSERT_DROP_MONITORING_EN_Pos 	(0x0U)
#define 	NFL_INSERT_DROP_MONITORING_EN_Msk 	(0x1UL << NFL_INSERT_DROP_MONITORING_EN_Pos) 	/*!< 0x00000001 */
#define 	NFL_INSERT_DROP_MONITORING_EN 	NFL_INSERT_DROP_MONITORING_EN_Msk
#define NFL_VOXELS_IN_WINDOW 	(0x0000E020UL) 	/*<! Current state of pseudo-sliding window. */
#define 	NFL_VOXELS_IN_WINDOW_VAL_Pos 	(0x0U)
#define 	NFL_VOXELS_IN_WINDOW_VAL_Msk 	(0x1FFFFFUL << NFL_VOXELS_IN_WINDOW_VAL_Pos) 	/*!< 0x001FFFFF */
#define 	NFL_VOXELS_IN_WINDOW_VAL 	NFL_VOXELS_IN_WINDOW_VAL_Msk
#define 	NFL_VOXELS_IN_WINDOW_FIRST_TD_SEEN_Pos 	(0x19U)
#define 	NFL_VOXELS_IN_WINDOW_FIRST_TD_SEEN_Msk 	(0x1UL << NFL_VOXELS_IN_WINDOW_FIRST_TD_SEEN_Pos) 	/*!< 0x02000000 */
#define 	NFL_VOXELS_IN_WINDOW_FIRST_TD_SEEN 	NFL_VOXELS_IN_WINDOW_FIRST_TD_SEEN_Msk
#define 	NFL_VOXELS_IN_WINDOW_MIN_VOXEL_DROP_MODE_Pos 	(0x1AU)
#define 	NFL_VOXELS_IN_WINDOW_MIN_VOXEL_DROP_MODE_Msk 	(0x1UL << NFL_VOXELS_IN_WINDOW_MIN_VOXEL_DROP_MODE_Pos) 	/*!< 0x04000000 */
#define 	NFL_VOXELS_IN_WINDOW_MIN_VOXEL_DROP_MODE 	NFL_VOXELS_IN_WINDOW_MIN_VOXEL_DROP_MODE_Msk
#define 	NFL_VOXELS_IN_WINDOW_MAX_VOXEL_DROP_MODE_Pos 	(0x1BU)
#define 	NFL_VOXELS_IN_WINDOW_MAX_VOXEL_DROP_MODE_Msk 	(0x1UL << NFL_VOXELS_IN_WINDOW_MAX_VOXEL_DROP_MODE_Pos) 	/*!< 0x08000000 */
#define 	NFL_VOXELS_IN_WINDOW_MAX_VOXEL_DROP_MODE 	NFL_VOXELS_IN_WINDOW_MAX_VOXEL_DROP_MODE_Msk
#define NFL_CHICKEN_BITS 	(0x0000E024UL) 	/*<! (s) Use timestamp from TimeHigh and TD events only to sync internal timer. */
#define 	NFL_CHICKEN_BITS_TIMESTAMP_FROM_TH_TD_ONLY_Pos 	(0x0U)
#define 	NFL_CHICKEN_BITS_TIMESTAMP_FROM_TH_TD_ONLY_Msk 	(0x1UL << NFL_CHICKEN_BITS_TIMESTAMP_FROM_TH_TD_ONLY_Pos) 	/*!< 0x00000001 */
#define 	NFL_CHICKEN_BITS_TIMESTAMP_FROM_TH_TD_ONLY 	NFL_CHICKEN_BITS_TIMESTAMP_FROM_TH_TD_ONLY_Msk
#define 	NFL_CHICKEN_BITS_DROP_MONITOR_FOR_EACH_DROPPED_TD_Pos 	(0x1U)
#define 	NFL_CHICKEN_BITS_DROP_MONITOR_FOR_EACH_DROPPED_TD_Msk 	(0x1UL << NFL_CHICKEN_BITS_DROP_MONITOR_FOR_EACH_DROPPED_TD_Pos) 	/*!< 0x00000002 */
#define 	NFL_CHICKEN_BITS_DROP_MONITOR_FOR_EACH_DROPPED_TD 	NFL_CHICKEN_BITS_DROP_MONITOR_FOR_EACH_DROPPED_TD_Msk

/* ------------------------------------------------------")
 * MBX: CPU MBX Register Map
 * ------------------------------------------------------ */

#define MBX_CPU_START_EN 	(0x0000F000UL) 	/*<! Register to release IMEM code execution once programmed */
#define 	MBX_CPU_START_EN_Pos 	(0x0U)
#define 	MBX_CPU_START_EN_Msk 	(0x1UL << MBX_CPU_START_EN_Pos) 	/*!< 0x00000001 */
#define MBX_CPU_SOFT_RESET 	(0x0000F004UL) 	/*<! REgister to reset CPU SubSystem only(force reboot). */
#define 	MBX_CPU_SOFT_RESET_Pos 	(0x0U)
#define 	MBX_CPU_SOFT_RESET_Msk 	(0x1UL << MBX_CPU_SOFT_RESET_Pos) 	/*!< 0x00000001 */
#define MBX_CMD_PTR 	(0x0000F008UL) 	/*<! Register to communicate from Host to embedded CPU */
#define 	MBX_CMD_PTR_Pos 	(0x0U)
#define 	MBX_CMD_PTR_Msk 	(0xFFFFFFFFUL << MBX_CMD_PTR_Pos) 	/*!< 0xFFFFFFFF */
#define MBX_STATUS_PTR 	(0x0000F00CUL) 	/*<! Register to communicate from embedded CPU to Host */
#define 	MBX_STATUS_PTR_Pos 	(0x0U)
#define 	MBX_STATUS_PTR_Msk 	(0xFFFFFFFFUL << MBX_STATUS_PTR_Pos) 	/*!< 0xFFFFFFFF */
#define MBX_MISC 	(0x0000F010UL) 	/*<! Register to transfer data from Host to Embedded CPU, or the opposite */
#define 	MBX_MISC_Pos 	(0x0U)
#define 	MBX_MISC_Msk 	(0xFFFFFFFFUL << MBX_MISC_Pos) 	/*!< 0xFFFFFFFF */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __GENX320_H */
